{"Doomsday": "[Intro: Pebbles the Invisible Girl, MF DOOM]\nMic Check\nWhen I was led to you\nI knew you were the one for me\nCome through dig the sound\nI swear the whole world could feel you MC\nCrowd around\n\n[Verse 1: MF DOOM]\nI used to cop a lot, but never copped no drop\nHold mics like pony tails tied in bobbalobs\nStop and stick around, come through and dig the sound\nOf the fly brown 6-0 sicko psycho who throws his dick around\nBound to go three-plat, came to destroy rap\nIt's a intricate plot of a b-boy strap\nFemstat cats get kidnapped\nThen release a statement to the press, let the rest know who did that\nMetal Fist terrorists claim responsibility\nBroken household name usually said in hostility\nUm... what is MF? You silly\nI'd like to take \"Means to the End\" for two milli'\n\"Doo-doo-doo-doo-doo!\" That's a audio daily double\nRappers need to fall off just to save me the trouble, yo\nWatch your own back came in and go out alone, black\nStay in the zone—turn H2O to Cognac\n\n[Hook: MF DOOM]\nOn Doomsday!, ever since the womb ‘til I'm back where my brother went, that's what my tomb will say\nRight above my government; Dumile\nEither unmarked or engraved, hey, who's to say?\n\n[Verse 2: MF DOOM]\nI wrote this one in B.C. D.C. O-section\nIf you don't believe me, go get bagged and check then\nCell number 17, up under the top bunk\nI say this not to be mean, wish bad luck or pop junk\nPop the trunk on Cee Cipher Punk, leave him left scraped\nGod forbid, if there ain't no escape, blame MF tape\nDefinition \"super-villain\": a killer who love children\nOne who is well-skilled in destruction, as well as building\nWhile Sidney Sheldon teaches the trife to be trifer\nI'm trading science fiction with my man the live lifer\nA pied piper holler a rhyme, a dollar and a dime\nDo his thing, ring around the white collar crime\nGet out my face, askin' ‘bout my case, need toothpaste\nFresher mint, monkey-style nigga get dentadent\nAnd dope fiends still in they teens, shook niggas turn witness\nReal mens mind their own business\nThat's the difference between sissy-pissy rappers that's double-dutch\nHow come I hold the microphone double-clutch\nC.O.'s make rounds, never have ‘ox found\nOn shakedown, lock-down, wet dreams of Fox' Brown\n\n[Hook: MF DOOM]\nOn Doomsday!\nEver since the womb ‘til I'm back where my brother went\nThat's what my tomb will say\nRight above my government; Dumile\nEither unmarked or engraved, hey, who's to say?\n\n[Bridge: MF DOOM]\nDoomsday\nEver since the womb ‘til I'm back to the essence\nRead it off the tomb\nEither engraved or unmarked grave, who's to say?\n\n[Verse 3: MF DOOM]\nPass the mic like \"Pass the peas like they used to say\"\nSome M-er F-ers don't like how Sally walk\nI'll tell y'all fools it's hella cool how ladies from Cali talk\nNever let her interfere with the Yeti ghetto slang\nNicknames of nimble and tip of nipple metal fang\nKnown amongst hoes for the bang-bang\nKnown amongst foes for flow without no talking orangutans\nOnly gin and Tang\nGuzzled out a rusty tin can, me and this mic is like yin and yang\nClang! Crime don't pay, listen, youth\nIt's like me holding up the line at the kissing booth\nI took her back to the truck, she was uncouth\nSpittin' all out the sunroof, through her missing tooth\nBut then she has a sexy voice, sound like Jazzy Joyce\nSo I turned it up faster than a speeding knife\nStrong enough to please a wife\nAble to drop today's math in the 48 keys of life\nCut the crap far as rap\nTouch the mic, get the same thing a Arab will do to you for stealing\nWhat the Devil? He's on another level\nIt's a word! No, a name! MF - the Super-Villain!\n\n[Outro: Pebbles the Invisible Girl]\nWhen I was led to you\nI knew you were the one for me\nI swear the whole world could feel you MC", "Beef Rap": "[Produced by Metal Fingers]\n\n[Skit 1]\nNow I haven't eaten all day. How am I gonna do this man?\nYeah don't wait for her man, don't wait for her\nI'll tell you what man: come with me now and you know\nI'll get you some lunch, I'll hook you up with something\nI got a little bank, y'know, no problem\nI hear you, that's cool (alright? It's cool)\nMan, can't you guys just wait here about a half hour, man?\nYo I'll be back man, I'm just gonna munch up a little bit man, I'm pretty hungry\nYo let him come back\n\n[Skit 2]\nHere you will find food for your body\nAs well as comfort for your troubled mind\nI'd really like some soup (bread and butter)\nOf course my friend. What happened to your hand?\nOh, food at last!\n\n[Skit 3]\nHow did they get here?\nRegular storage procedure, the same as the other food\nWhat other food?\nFish (food) protein (fast for ya)\n\n[Skit 4]\nNow what happened?\nWell, the cop got\nThe next morning I went to the store to get some food\n(Bread and butter) They arrested me\nI'll save you (thank you)\nWould you like a snack?\nThanks for the drink\n\n[Skit 5]\nOperation Doomsday complete\nAll your intercoms casualty and damage testing\n\n[Skit 6]\nEnough! you talk of the people's rights\nThe people have only those rights which I choose to give them\nAnd that's for their own good, believe me\nI do, DOOM\nThey dissappoint me, they must work faster\nWhat about the prisoner?\nAh yes, the young traitor who has tried to turn my people against me\nWatch him. I have special plans for that one\n\n[Verse 1]\nBeef rap, could lead to getting teeth capped\nOr even a wreath for mom dukes on some grief crap\nI suggest you change your diet\nIt can lead to high blood pressure if you fry it\nOr even a stroke, heart attack, heart disease\nIt ain't no starting back once arteries start to squeeze\nTake the easy way out phony, until then\nThey know they wouldn't be talking that bologna in the bullpen\nSo disgusting, pardon self as I discuss this\nThey talk a wealth of shit and they ain't never seen the justice\nBust this, like a cold milk from out the toilet\nTwo batteries some Brillo and some foil, heat'll boil it\nHe be better off on PC glued\nAnd it's a feud so don't be in no TV mood\nEvery week it's mystery meat, seaweed stewed\n(Food, we need food!)\n\n[Verse 2]\nHe wears a mask just to cover the raw flesh\nA rather ugly brother with flows that's gorgeous\nDrop dead joints hit the whips like bird shit\nThey need it like a hole in they head or a third tit\nHer bra smell, his card say: aw hell\nBarred from all bars and kicked out the Carvel\nKeep a cooker where the jar fell\nAnd keep a cheap hooker that's off the hook like Ma Bell\nTop bleeding, maybe fella took the loaded rod gears\nStop feeding babies colored sugar-coated lard squares\nThe odd pair swears and God fears\nEven when it's rotten, we've gotten through the hard years\nI wrote this note around New Year's\nOff a couple a shots and a few beers, but who cares?\nEnough about me, it's about the beats\nNot about the streets and who food he 'bout to eat\nA rhyming cannibal who's dressed to kill and cynical\nWhether is it animal, vegetable or mineral\nIt's a miracle how he get so lyrical\nAnd proceed to move the crowd like a old Negro spiritual\nFor a mil', do a commercial for Mello Yello\nTell 'em devil's hell no, sell y'all own Jello\nWe hollow krills, she swallow pills\nHe follow flea collar three dollar bills\nAnd squeal for halal veal, if y'all appeal\nDig the real, it's how the big ballers deal\nTwirl a L after every meal (food!)\n\n[Verse 3]\nWhat up?\nTo all rappers: shut up with your shutting up\nAnd keep your shirt on, at least a button-up\nYuck, is they rhymers or strippin' males?\nOut of work jerks since they shut down Chippendales\nThey chippin' nails, DOOM, tippin' scales\nLet alone the pre-orders that's counted off shippin' sales\nThis one goes out to all my peoples skippin' bail\nDippin' jail, whippin' tail and sippin' ale\nLight the doobie 'til it glow like a ruby\nAfter which they couldn't find the Villain like Scooby\nHe's in the lab on some old Buddha Monk shit\nOverproof drunk shit, but who'd'a thunk it?\nPunk, try and ask why ours be better\nCould be the iron mask or the Cosby sweater\nYes, you, who's screwed by the dude on the CD, nude\n(We need food!)", "Rapp Snitch Knishes": "[Intro: Mr. Fantastik & (MF DOOM)]\nYo! (Yo!)\nMF DOOM (Mr. Fantastik)\nMr. Fantastik (Villain)\nWhat up, nigga? (Ain't nuttin; what's the word?)\nWhat's cracking, boy? (Same ol' shit, kid)\nMan (Different day, you know?)\nThese rap snitches, man, shit is bugged out, man\nWhat the fuck, man? (Shit, you telling me)\nNiggas running their mouth, telling e'rything, e'rything (critical)\n\n[Hook: Mr. Fantastik]\nRap snitches, telling all their business\nSit in the court and be their own star witness\nDo you see the perpetrator? Yeah, I'm right here\nFuck around, get the whole label sent up for years\nRap snitches, telling all their business\nSit in the court and be their own star witness\nDo you see the perpetrator? Yeah, I'm right here\nFuck around, get the whole label sent up for years\n\n[Verse 1: Mr. Fantastik]\nType profile low, like A in \"Paid in Full\"\nAttract heavy cash cause the game's centrifugal\nMr. Fantastik, long dough like elastic\nGuard my life with twin Glocks that's made out of plastic\nCan't stand a brown nosing nigga, fake ass bastard\nAdmiring my style, tour bus through Manhattan\nPlotting, plan the quickest, my flow's the sickest\nMy hoes be the thickest, my dro the stickiest\nStreet nigga, stamped and bonafide\nWhen beef jump niggas come get me cause they know I ride\nTrue to the ski mask, New York's my origin\nPlay a fake gangsta like a old accordion\nAccording to him, when the D's rushed in\nComplication from the wire testimony was thin\nCaused his man to go up north, the ball hit 'em again\nLame rap snitch nigga even told on the Mexican\n\n[Hook: Mr. Fantastik]\nRap snitches, telling all their business\nSit in the court and be their own star witness\nDo you see the perpetrator? Yeah, I'm right here\nFuck around, get the whole label sent up for years\nRap snitches, telling all their business\nSit in the court and be their own star witness\nDo you see the perpetrator? Yeah, I'm right here\nFuck around, get the whole label sent up for years\n\n[Verse 2: MF DOOM]\nTrue, there's rules to this shit, fools dare care\nEverybody wanna rule the world with tears for fear\nYeah, yeah, tell 'em tell it on the mountain hill\nRunning up they mouth bill, everybody doubting still\nInformer, keep it up and get tested\nPop through your bubble vest or double-breasted\nHe keep a lab down south in the little beast\nSo much heat you woulda thought it was the Middle East\nA little grease always keeps the wheels a-spinning\nLike sitting on twenty threes to get the squealers grinning\nHitting on many trees, feel real linen\nSpitting on enemies, get the steel for tin men\nWhere no brains but gum flap\nHe said his gun clap, then he fled after one slap (pap!)\nSon, shut your trap, save it for the bitches\nMmm, delicious, rapp snitch knishes\n\n[Outro: Mr. Fantastik & (MF DOOM)]\nYou know what I'm saying? (It's terrible)\nCrazy, man, I'm just analyzing this whole game\nThis is bugged out, man, niggas is snitching\nTelling on they own self (it's a horror, yo)\nFuck around and get everybody bagged, man\n(Atrocities) Fuck around and get yo mama bagged, nigga\nYou know your grandmama used to be bootlegging\nFake hustling nigga, heheheheh, haha\nPerpetrator? Yeah, I'm right here...", "Hoe Cakes": "[Intro]\nKeep your hoes in check...\n(Super!)\n\n[Verse]\nI got this girl and she wants me to duke her\nI told her I'd come scoop her around 8, she said (\"Super!\")\nThat sounds great, shorty girl's a trooper\nNo matter what I need her to do, she be like (\"Super!\")\nOwn his own throne, the boss like King Koopa\nOn the microphone he flossed the ring (\"Super!\")\nAverage emcees is like a TV blooper\nMF DOOM, he's like D.B. Cooper\nOut with the moolah, I let her get a outfit\nJust to cool her off she said niggas ain't about shit\nI wonder if she meant it, I doubt it\nThe way it be in her mouth she can't live without it\nAnd can't live with this, handle your business\nVillain'll stay on a scandalous ho's shit list\nOne pack of cookies please, Mr. Hooper\nIt's fun smacking rookies, he is the (\"Super!\")\nLook like a black wookie when he let his beard grow\nWeirdo, brown-skinned'd, always kept his hair low\nRumor has it it's a S-Curl accident\nDOOM was always known to keep the best girls' backs bent\nSome say it's the eyes, some say the accent\nA lot of guys wonder where they stacks went\nI call her thunder thighs with the fatty swolla\nOnly mess with high rollers, do what daddy told her\nNo matter the city she with me to do the thang-thang\nWork in the coochie, hooptie chitty chitty bang bang\nSame name on the titty as on the name ring\nPretty like Baby D off \"All in the Same Gang\"\nKeep my eye on her, really don't trust her\nBut I treat her like a daughter, taught her how to bust a nut\nAnd the heat to turn beef to horsemeat chalupa\nTeach her how to hold it, of course he is the (\"Super!\")\nSee most cats treat her like Foofur\nOr beat her to a stupor, take it from the (\"Super!\")\nYou need to make her feel cuter\nAnd lay down the G like Luther, everything'll be (\"Super!\")\nDo for her, keep her in a new fur\nSo she look sweet when she go to meet the (\"Super!\")\nGot the buddha get the Grenadiers, twist it\nPut it in the air, come here, kiss it\nListen here scooter, let her try to bag you\nWhen she's on the rag, never let her fry the Ragu\nWhich'll have you under some type of spell crying \"dag boo\"\nHer name on your back in a tattoo\nWhether a bougie broad, nerd ho, street chick\nDon't call her Wifey if you met her at the Freaknik\nYou don't want her don't waste her time, I'll dupe her\nAnd be a father to your child like the (\"Super!\")\nHe keep his hoes in check\nSends 'em out to get glows from off frozen necks\nTell 'em take his clothes, leave him posing naked for real\nBetter yet, get him for the check off the record deal\nFind out where he keep the Tec and the blue steel\nMake sure for extra wreck, let him know how you feel\nAnd while he's running down to All-Star Weekend to ball\nI'm coming with the U-Haul (\"Super!\")\n(\"Super! Super!\")\n\n[Outro Skit]\n(DOOM): Has the laser cannon been lowered?\n(DOOM Cronie): Everything has been prepared as you ordered. But how did you get permission to return to New York master?\n(DOOM): Through the efforts of the misguided fools\n(J. Jonah Jameson): It's free enterprise, and I'm not gonna have some blasted government bureaucrat tell me how to run my business. But DOOM will be my guest on my private estate in Long Island. There's nothing you can do about it\n(Jameson Employee): He's dangerous, I just hope you know what you're doing\n(Jay Jonah Jameson):  Don't I always. Ah, there's DOOM's jet, right on time\n\n(Voice 1): Why's it so cold out here?\n(Voice 2): The heat went out in the whole building\n(Voice 3): It's warming up out there in Long Island with DOOM\n(Voice 1): DOOM? Here in New York?\n(Voice 2): Yes DOOM has an amazing new machine\n\n(DOOM): Get the president of the United States on the phone\n(Jay Jonah Jameson): How long's all this gonna take, DOOM?\n(DOOM): I would not advise you to repeat that error\n(Jay Jonah Jameson): Sure, I know what you mean", "Deep Fried Frenz": "[Intro]\nBefore we go any further\nFriends\n\n[Verse]\nAs you call 'em, they call you when they need something\nTrees for the blunt, the G's for the front\nI found a way to get peace of mind for years and left the hell alone\nTurn a deaf ear to the cellular phone\nSend me a letter or better, we could see each other in real life\nJust so you could feel me like a steel knife\nAt least so you could see the white of they eyes\nBright with surprise, once they finish spitting lies\nAsssociates, is your boys, your girls, bitches, niggas, homies\nClose, but really don't know me\nMom, dad, comrade, peeps, brothers, sisters, duns, dunnies\nSome come around when they need some money\nOthers make us laugh like the Sunday funnies\nFam be around whether you paid or bummy\nYou could either ignore this advice or take it from me\nBe too nice and people take you for a dummy\nSo nowadays he ain't so friendly\nActually they wouldn’t have made a worthy enemy\nRead the signs: \"No feeding the baboon\"\nSeein' as how they got ya back bleeding from the stab wounds\nY'all know the dance, they smile in ya face, y'all know the glance\nTry to put 'em on, they blow the chance\nNever let your so-called mans know your plans\n(How many of us have them?) A show of hands\n(Friends) is a term some people use loosely\nI'm real choosy on what I choose to let crews see\nYou telling me; I try to act broke\nJealousy the number one killer among black folk\nFellas be under some type of spell like crack smoke\nGhetto Cinderellas, lead 'em right to your stack, loc\nJust another way a chick'll lead to your end\nI check the dictionary for the meaning of friend\nIt said: person, one who likes to socialize with\nSympathiser, helper, and that's about the size of it\nMost of the time these attributes is one-sided\nTo bolster the crime, they're apt to shoot you through your eyelid\nAnd they can't hide it, going wild like a white bitch\nSometimes ya need to cut niggas off like a light switch\n(Click!) And when things get quiet\nCatch 'em like a thief in the night, what a riot\nI first met Mr. Fantastik at a arms deal\nDon't let it get drastic, think of how your moms'll feel\nWhen it get for real, steel get to sparkin'\nEverything darken, and ain't no talkin'\nFor somethin so cheap, it sure buys a lot of trouble\nYa better off focusing than tryin to plot to bubble\nOr else it'd be a sad note to end on, the guns we got is\n(One's we can depend on, friends)\nSome come in the form of codependence\nA lot of times only end up being codefendants\nTen bucks say they tell for a lower sentence\nAnd leave you up under the jail, begging for a penance\nIt don't make no sense, what happened to the loyalty?\nHonor amongst crooks, trust amongst royalty\nI'd rather go out in a blaze, than give 'em the glory\n(How many of us have--) a similar story\n(Friends) before lovers, we used to have some type of over-standing\nJust so when I let her get the man thing, she know it's no strings\nWe could do the damn thing, but ho, it's no rings\nJust how the tramp swings\nWill she see 'em again?\nThat depends on how good was the skins and could she memorize the lessons\nIt ain't no need to pretend\nEven though she let 'em stab it, she know they're just friends\n\n[Outro]\nFriends\nHow many of us have them?\nFriends\nOnes we can depend on?\nFriends\nHow many of us have them?\nFriends\nBefore we go any further\n\n[Skit]\nFellas! Don't be silly! I know who my friends are!\nAnd the next nice neighborhood I move into, you guys'll get crack'\n(Negro humor always escaped me.)\n\n[Outro Skit: Character 1; Mr. Fantastic; (Invisible Woman);\nDr. DOOM; Character 2]\nThe most powerful, the most mysterious monarch in all the world\nGuided by a fighting force that never sleeps\nThat never relaxes its vigilance\nFor none is as feared, none has as many foes\nAs DOOM, the awesome ironclad lord of\nI know who Doom is (Then tell us)\nHe happens to be the most dangerous man in the world\nI’d hope we’d never hear from him\nI’d hope we’d never have to battle him\nBut now the worst has happened and I must tell you what we’re up against\nI first met DOOM years ago\nWhen he wanted to be alone, alone to pursue his forbidden experiments\nOne day while conducting a secret experiment\n[Explosion sounds] Later, when he recovered from his injuries\nInstead of having learned his lesson, DOOM was bitter, angry, vengeful\n[Woman screams] What have I done to myself?\nMy face, it is hideous\nHe traveled the world, seeking a cure for his disfigured face\n(I’m sorry sir, there is nothing we can do for you)\nHe traveled through remote villages, where strangers are seldom seen\nHe continued his search, never showing his face\nUnless threatened by bandits who prey on travelers\nWho foolishly wander alone through their domain", "One Beer": "[Intro]\nI get no kick from champagne\nMere alcohol doesn't thrill me at all\nSo tell me why shouldn't it be true?\nI get a kick out of brew\n\n[Verse]\nThere's only one beer left\nRappers screaming all in our ears like we're deaf\nTempt me, do a number on the label\nEat up all they emcees and drink 'em under the table\nLike, \"It's on me—put it on my tab, kid\"\nHowever you get there, foot it, cab it, iron horse it\nYou're leaving on your face, forfeit\nI crush the mic, hold it like the heat, he might toss it\nTold him tell her they stole it, he told her he lost it\nShe told him, \"Get off it,\" and a bunch of other more shit\nGetting money, DT's be getting no new leads\nIt's like he eating watermelon, stay spitting new seeds\nIt's the weed, give me some of what he drooping off\nSoon as he wake up, choking like it was whooping cough\nThey group been soft\nFirst hour at the open bar and they're trooping off\nHe went to go laugh and get some head by the side road\nShe asked him autograph her derriere, read\n\"To Wide Load, this yard bird taste like fried toad turd\nLove, Villain.\" Take pride in code words\nCrooked eye mold nerd geek with a cold heart\nProbably still be speaking in rhymes as an old fart\nStudy how to eat to die by the pizza guy\nNo he's not too fly to skeet in a skeezer eye\nAnd squeeze her thigh, maybe give her curves a feel\nThe same way she feel it when he flow with nerves of steel\nThey call the super when they need their back, uhh, plumbing fixed\n\"How there only one left? The pack comes in six!\nWhatever happened to two and three?\"\nA herb tried to slide with four and five and got caught like, \"What you doing G?\nDon't make me have to get cutting like truancy\nMatter fact, not for nothing, right now, you and me!\"\nLooser than a pair of Adidas\nI hope you brought your spare tweeters, MC's sound like cheerleaders\nRapping and dancing like Red Head Kingpin\nDOOM came do his thing again, no matter who be blingin'\nHe do it for the smelly hubbies\nSeeds know what time it is like it's time for Tellie Tubbies\nFew can do it, even fewer can sell it\nTake it from the dude who wears mask like a 'tarded helmet\nHe plots shows like robberies\nIn and out, one, two, three, no bodies, please\nRun the cash and you won't get a wet sweatshirt\nThe mic is the shotty: nobody move, nobody get hurt\nBring heat like your boy done gone to war\nHe came in the door, and \"Everybody on the floor!\"\nA whole string of jobs like we on tour\nEvery night on the score, coming to your corner store\n\n[Skit]\nThere, it is done\nNow that the representative from South Africa has been mind programmed\nAll of the world leaders on earth are under my control\nAnd when they meet tomorrow in special session\nI, Doom, shall be voted: Master of the World\nMy plan is foolproof, but just in case\nAnd what about snow?\n\n[Skit 2]\nNow you keep your eyes open\nWhen I tell ya, start snappin' (Oh yeah, sure)\nUh, ladies and gentlemen\nI am risking my life to tell you with great concern that I must warn you\nI, I, you must listen\nMany among you, have, have, have their minds taken over\n(What a story, start snappin’)\nDOOM, gosh, I wish I’d brought my autograph book\n(Your attempts at humor bore me) Right lead head\nYou’re weird\nWhy is everyone staring at us?\n(Aw, I should have realized, we must look like freaks to them)\nRelax masseur, just do your thing\n(Get a good grip on my-)\nWhat? Why I’ll bend your read out meter for ya, you little\n(Knock it off, Ben)\nWhat’s the matter? (Oh, Ben)\nYou’re nothing but a chicken head\n(You overgrown granite head) Hold it\n\n[Produced by Madlib]", "Rhymes Like Dimes": "[Intro]\nYo, yo, yo, y'all can't stand right here\nIn his right hand was your man's worst nightmare\nLoud enough to burst his right eardrum, close-range\nThe game is not only dangerous, but it's most strange\n\n[Chorus]\nI sell rhymes like dimes\nThe one who mostly keep cash but brag about the broker times\n\n[Verse 1]\nJoking rhymes, like the \"Is you just happy to see me?\" trick\nClassical slapstick rappers need Chapstick\nA lot of 'em sound like they in a talent show\nSo I give 'em something to remember like the Alamo\nTally-ho! A high Joker like a Spades game\nCame back from five years laying and stayed the same\nI'm saying, electromagnetic field it blocks all logic, Spock\nAnd G-Shocks her biological clock\nWhen I hit it, slit it to the shitter,  thought I killed her goose\nHer Power U was pure Brita water, filtered juice\nKeep a pen like a fiend keep a pipe with him\nGentleman who lent a pen to a friend who write with him\nNever seen the shit again but he's still my dunny\nThe only thing that come between us is krill and money\n\n[Chorus]\nI sell rhymes like dimes\nThe one who mostly keep cash but brag about the broker times\n\n[Verse 2]\nBetter rhymes make for better songs, it matters not\nIf you got a lot of what it takes just to get along\nSurrender now or suffer serious setbacks\nGot get-back, connects wet-back, get stacks\nEven if you gots to get jet-black, head to toe\nTo get the dough, battle for bottles of Mo' or 'dro\nThis fly flow take practice like Tae Bo with Billy Blanks\n\"Oh, you're too kind!\" \"Really? Thanks!\"\nTo the gone and lost forever like \"Oh My Darling Clementine\"\nHe hold his heart when he telling rhyme\nWhen it's his time, I hope his soul go to Heaven\nHe nasty like the old time Old No. 7\nYou still taste it when you chase it with the Coca-Cola\nMake 'em wish they could erase it out the Motorola\nI told her, \"No credit for a bag\nIf you want what they got, then go get it, it's all gack\"\nOnly in America could you find a way to earn a healthy buck\nAnd still keep your attitude on self-destruct\n\n[Chorus]\nI sell rhymes like dimes\nThe one who mostly keep cash but brag about the broker times\n\n[Verse 3]\nJoking rhymes, like the \"Is you just happy to see me?\" trick\nClassical slapstick rappers need Chapstick\nA lot of 'em sound like they in a talent show\nSo I give 'em something to remember like the Alamo\nTally-ho! A high Joker like a Spades game\nCame back from five years laying and stayed the same\nSaying, \"Electromagnetic feeling blocks all logical, Spock\"\nAnd G-Shocks her biological clock\nWhen I hit it, slit her to the shitter,  thought I killed her goose\nHer Power U was pure Brita water, filtered juice\nKeep a pen like a fiend keep a pipe with him\nGentleman who lent a pen to a friend who write with him\nNever seen the shit again but he's still my dunny\nThe only thing that come between us is krill and money\n\n[Chorus]\nWe sell rhymes like dimes\nThe one who mostly keep cash but tell em bout the broke times\n\n[Bridge: Sample]\n\"In your arms tonight\nShe'll reflect\nThat she owes you the sweetest of debts\nIf she wants to pay\"\n\n[Outro: Cucumber Slice]\nCheck it out, y'all! Ya don't stop! Keep on, to the sure shot!\nHuh-ha! Uh, uh, uh, uh, oh!\nYeah, you're listening to the buttery slickness\nThe Land-O-Lakes from my man MF DOOM!\nHa ha ha ha! Yeah!\nRock-shocking the house, with another nugget\nUh-uh-ah, eh, oh, ah, hoo-wee!\nYeah! Yeah!\nRegulation status, right here\nFondle 'Em Recordings, 1999\nYeah!\nNow what are you 'posed to say on the end of records?\nI don't know! Yeah! Woo! Yeah!\nMashed potatoes!\nApple sauce!\nButtery... biscuits!\nAnd I get lost\nA yes, yes, yes, yes y'all\nYou don't stop\nKeep on, a' to the break-a-dawn\nSay what?\nUh!\nYeah!\nYou thought it all was over!\nYou thought the song was over!\nAh! We tricked you! We tricked you!\nHa ha ha ha... Woo!\nYou listening to www  dot hairline dot com\nMF DOOM, Kool Bob Love...", "That’s That": "[Verse]\nAlready woke, spared a joke, barely spoke, rarely smoke\nStared at folks when properly provoked, mirror broke\nHere, share strawberry morning, gone an more important spawning\nTorn in, poor men sworn in\nCornish hens switching positions, auditioning morticians\nSaw it in a vision, ignoring prison\nIgnoramuses enlist and sound dumb\nFound 'em drowned in cow's dung, crowns flung\nRings a Tinkerbell, sing for things that's frail as a fingernail\nBring a scale, stale ginger lingers\nSeven figures invigor\nNigga, fresh from out the jail, alpha male\nSickest ninja injury this century, enter plea\nLend sympathy to limper Simple Simon rhyming emcees\nTrees is free, please leave a key\nThese meagre fleas, he's the breeze\nAnd she's the bees knees for sheez\nG's of G's\nSeize property, shopper sprees, chop the cheese\nDrop the grease to stop diseases, gee wiz pa!\nDOOM rock grammar like the kumbaya\nMama was a ho hopper, papa was a Rolling Stone star like Obama\nPull a card like oh drama\nCivil liberties\nThese little titties abilities riddle me, middle C\nGive a MC a rectal hysterectomy\nLecture on removal of the bowels, foul technically\nDon't expect to see the recipe\nUntil we receive the check as well as the collection fee\nMore wreck than Section Z\nWhat you expect to get for free?\nShit from me, history\nThe key, plucked it off the mayor\nChucked it in the ol' tar pit off La Brea, player\nThey say he's gone too far\nDOOM'll catch em after Jumah on cue lacka!!\nDo whatcha gotta do, grarrrr\nThe rumors are not true, got two ma\nNo prob, got the job, hot-barred heart throb\nScotchguard the bar with cotton swabs, dart lob\nBake a cake, sweet\nJamaica trade in treats on the beach\nMake her skeet til her feets meet\n\nCan it be I stayed away too long?\nDid you miss these rhymes when I was gone?\nAs you listen to these crazy tracks\nCheck them stats then you know where I'm at\nAnd that's that\n\n[Audio Clip: Unknown, Kathleen Turner, Christopher Lloyd]\nLook, there's Doom now!\nI followed him to the studio, but I was too late to stop him\nThat's right! You'll never stop me! You're dead! You're all dead! Doom!", "Books Of War": "[Verse 1: MF DOOM]\nIt ain't nothing like a fistfull a cash or a bliss fulla the hash\nThat twist like a mustache, from end to end, spread it like a rash\nFrom talking through your walkman or at your disco bash\nGimme the Timbs Rumplestiltskin brown\nA metal face mask with a built in frown\nA mic to tilt down, a hundred thousand pounds\nAnd see how kilt sound like spilt milk clown\n\nCocoa butter on very ashy day fam\nWith Ray-Bans out on the islands of Cayman\nOr i'll break it down for the layman\nBain de Soliel, for that St. Tropez tan\nA can a ole gold too cold to hold, slow ya roll\nKeep on moving like Soul II Soul, hold the dough\nLike a fool who stole pity y'all\nFrom tryna go up against city hall titty bar\nThe black mic is like a red violin\nOk, everybody back to the lab, try again\nBloody rap game like leviathan\nLeave a bad taste, killin my high like niacin\nStop kiddin middlemen need Ritalin\nHit me with the full tin of gin and im a kid again\nKeep the bong lightin straight through the song writin\nThe Supervillain AKA the thong bitin, thats inviting all\nTo the recitin thats dope and raw\nHoping all yall come in peace and its open bar\nTear the roof off this bumba rasclaat\nBy the end of the night spazz like shazbot\nSpilt a shot made the pen lines runny\nA ill plot thats ten times Ben Stien money, funny\nHow he rips the scripts with a straight face\nWith more rhymes than is lines in ya database\nPlacing rappers in endangerment, who's reckless\nWith this food for thought sorta like breakfast\nYou could mark it off as wreck on the checklist\nWear gold fronts, can't afford no necklace\nShit, that there, could go to help them daycares\nSomebody say yeahh.. (yeahhh!)\nPay ya fares,... give the Herbalizers his shares\nAnd y'all could pay DOOM in beers; cheers!\n\n[Verse 2: RZA]\nI came to the shores of America disguised as a pillar\nThe alpha and omega and the home of the beggars, the black sellers\nWho been beaten, raped, lynched, robbed and stoned\nAnd caused to roam the earth in service cause they couldn't maintain at\nHome\nThis dates back to 1555\nWhen they captured the first tribe of men\nAnd piled them in a pen\nFifty feet high\nThey took em all on a 9000 mile ride\nAnd landed on the shore of a place they never seen before\nBut read about this inside the ancient books of war\nBonded in stainless steel, stripped of their language\nStill survived the anguish of slavery but still remained nameless\nSeparated to portions and tricked by John Haughty Hawkins\nAnd sold on the auction, taught birth control and abortion\nRulers of the first part became slaves of the worst part\nThe devils cursed God and reversed God\nAnd turned God into dog and made people search hard\nNo relief came to the prophet of W.D. Feraud\nTo a trauma, dropped our mommas off in Bahamas and Barbados\nTobagos, separated us from slave boats\nMade our own brothers hate us\nFrom Virgin Isle to Jamaica\nTrinidad, Honduras, Haiti, Grenada\nBermuda to Cayman, mental enslavement\nYou black gods become awaken", "Vomitspit": "[Verse]\nIt's the beat, he hear it in his sleep sometimes\nBlare it in your jeep so your peoples can stare at them rhymes\nReal rhymes not your everyday hologram\nEven when ribs was touchin', never swallowed the ham\nHe'd rather eat a sand sandwich salad\nIt might need salt like your man's bland ballad\nA lot of stuff happens that the news won't tell you's\nBlues on L juice, snooze, all hell loose\nRake it, take it like the good, the bad, the ugly\nBreak it, rollin' through ya hood in the caddy buggy\nButter softly, leather flossy, fatty juggy\nAlways threw me off when she told me, \"Daddy, funk me\"\nI'm like, \"Anywho's\"\nSeeds walkin' all out in street with out any shoes\nI guess it's better than some funky socks\nYou need to get her some skips before she catch the monkey pox\nInstead she wanna hear the beatbox\nTake pills and make fake krills as sheetrock\nSing it, bring it, back to your laboratory\nWhile he's in his oratory, glorious like a horror story\nThe mask is like Jason\nThey told the place not to let the basket type case in\nHe could be some kind of wacko\nWaitin' for the chance to heat the pipes like a crack ho\nHe busted in, blessed be the Lord\nWho believe any mess they read up on a message board\nIf so, I got bridges for the low low\nSame bitch a-go dry snitchin' to the popo\nHere, orange peel stogs for the whole tier\nFeel like I've been gone over a year, came home to old gear\nIt was the shit when I first scooped it\nAt least I get to sit out in New York and curse stupid\nPlead the fifth, sip wine stiffly\nPatiently come up and be spiffy in a jiffy\nGift for the grind, criminal mind shifty\nSwift with the nine through a fifty nine fifty\nWell edumacated, he heard it when he meditated\nIn deep theta, let her hate the creep later\nDedicated cheap skata who keeps data\nSay he stay self medicated to sleep later\nSide effects is similar to sugar pill\nWhoever go next on the mic he put a booger, ill\nAnd made his exit on some calm shit\nBegged him on the regular for kegs of more vomitspit\n(\"Doom!\")", "Potholderz": "[Intro]\n(Hot shit) (aww shit)\n\n[Verse 1: Count Bass D]\nI strive to be humble, lest I stumble\nNever sold a jumbo or copped chicken with its mumbo\nSauce, Tyson is a fowl holocaust\nHitler gassed your whole head up with poultry, I'm fed up\nIgnore cordon bleu, stand up, get up\nLunge for your knife, don't forget your potholders\n(Hot shit)\n\n[Verse 2: MF DOOM]\nWhat, these old things? About to throw 'em away\nWith the gold rings that make 'em don't fit like OJ\nUsually I take them off with Oil of Olay\nMCs is crabs in a barrel, pass the Old Bay\nHot as hell and it's a cold day, innit?\nWorking on a way that we can roll away tinted\nSome say the price of holding heat is often too high\nYou either be in a coffin or you be the new guy\nThe one that's too fly to eat shoo pie\nNever too busy when it comes down to you and I\n(Swear to God) A lot of niggas wish to die\nThey need to hold they horses, there's bigger fish to fry\nYou're on the list, if not, pick a number spot\nTen and a half Timbs is made to kick your bumba claat\nI coulda had a V-8\nF-150 quad cab but I'll be straight\nMoney comes and goes like that two bit hussy\nThat night that tried to rush me, Dwight, pass the dutchie\nSo I can calm down so they don't get it twisted\nTake it from the fire side, it won't get blistered\nGot it, what happened? Oh, it's not lit\nThese metal fingers be holding (hot shit)\n\n[Verse 3: Count Bass D]\nWhen I was four, I penned \"God Was Born In New York\"\nBack in '77, still got nan in the crescent\nThe effervescence of God's presence is thick\nUnlike vapor, Esther Rolle, extra raw, word to the baker\nPeace to the hardworkin' gingerbread makers\nLooked her up and down said, \"Hmm, too much makeup\"\nPoor music taste, ten years from being grown up\nRappers don't blow up heads do (aww shit)\nMy name is Dwight Spitz, I'mma Sonic addict\nI use to think it was merely a nagging habit\nBorn under a bad sign, I'm serious about this curse of mine\nI strive to flip it into fine wine\nBarely born a virgin is what the stars said\nBlack not white, red all over though like Elmo\nTwenty-eight years have passed, I feel I'm peaking\nI make music every weekend\nIt's a chore, a fact of life, a labor of love\nI get mad love but I detest the labor\nAnd its wages, you know death\nI'm servin' life from this gift of God\nDon't forget your potholders, my niggas (more hot shit)\n\n[Outro]\nA short time later", "Gazzillion Ear": "[Verse 1]\nVillain, man, never ran with krills in his hand and\nWon't stop rockin' til he clocked in a gazillion grand\nTillin' the wasteland sands\nRaps on backs of treasure maps, stacks to the ceilin' fan\nHe rest when he's ashes\nAsk 'em after ten miles in his ga-lashes, smashes stashes\nChip on his shoulder with a slip on holster\nA clip, a folder and his grip on a boulder bolster\nThey supposed ta know, it show when his aura glow\nGet from out the row, when he get dough it's horrible\nTime is money, spend, waste, save, invest the fess\nThe ten case of cave a chicken chest S\nYes ya'll the dub will get ya trickles\nThe best ballers pitch in and rub to get a nickels\nBut tut tut, he about to change the price again\nIt go up each time he blow up like hydrogen\nVillain here, have em shrillin' in fear\nAnd won't stop top illin' til he a gazillionaire\nGrillin' stare, yeah ya boy had drama\nGot 'em on a mental plane, avoided bad karma\nOnce sold an inbred skinhead a nigga joke\nPlus a brand new chrome smoker with the triggers broke\nI thought I told 'em, \"Firing pins was separate\"\nHe find out later when he tries to go and rep it\nTook a Jehovah money for a Arabic Torah\nCharged an advance to translate it and ignored it, sorta\nOne monkey don't stop no slaughter\nA junkie want ta cop a quarter ton, run for the border\nKnow the drill, it ain't worth the overkill\nFlow skill, still there's no thrill\nVilla bill ya ten K bills in his pilla\nVilla, when it gets realer, split the skrilla with—\n\n[Verse 2]\n—Dilla, (Dilla) mix, mix, mix\nDo a deal for kicks and get rich quick\nSketch lyric, bet 'cha bottom nick on some vic\nIck from the drumstick, come with the dumb shtick\nSick slick, hidden in a book\nThe only way they find it if you're spittin' in a hook\nListen, don't look now, keep walkin'\nTraded three beans for this cow, cheap talkin'\nHawk men stalkin' hear that we hawkin' often\nCoughin' to a coffin, might as well scoff the pork then\nHe's like Worf, some say stronger though\nOff the top Jay Strongbow, play along bro\nWear a mask like yo off the Gong Show\nFlow slow as Mongo, Don Juan thong pro\nFor ya info when he's not practicin' Jim Crow\nOr actressin' and some nympho bimbo\nHe's playin' Ray J the old tape\nDOOM—well what can I say like JJ in a gold cape\nFill it to the rim like brim\nVillain and ya won't find him in no gym\nProbably a foggy bog with the frogs\nWith a dot on the guard as he squat on a log\nHalf cocked and half baked\nUsed to keep a full stock of work, half rocked and half shake\nMy mistake, sign a track agreement\nFor more G's than lines and cracks in the cement\nIn any event it's fake like wrestlin'\nGet 'em like Jake The Snake on mescalines\nAhem, elixir for the dry throat\nTried to hit the high note, Villain since a itsy bitsy zygote\nBy remote, send in the meat wagon\nBraggin' MC's packed in with they feets draggin'\nThese stats are staggerin'\nHad his PhD in indiscreet street hagglin'\nVillain, his agenda is clear\nEndin' this year with dividends to spare, here\nIt's not meant for the seein'\nWent through the ceilin' after enterin' his center bein'\nA new meanin' to sales through the roof\nGuaranteed raw and saw his truth was truth, proof\nIt's the return of the tramp\nWho do a duet jam when Ernest Goes To Camp\nFor the right earn - na'mean like Vern\nWe need some more oil for the machines to burn, learn\nJiminy crickets\nHe gets lucky like winnin' free tickets off SimplyLyrics\nOne man's waste is another man's soap\nSons fan base know the brotha man's dope\nA real weirdo with a bugged rare flow\nAnd the way his hair grow was ugly as a scarecrow\nHe wears a mask so the charge won't grab\nOn a rooftop with a large stone slab\nHeads up, talk white and thought niggerish\nRefuse to walk tight and got his off the vigorish\nBlack licorice and equally as yucky\nHow he handled the money was strictly Dan Stuckie\nMonkey hustle, man on fire\nLater for the date than the Hadron Collider\nAnd cost more, it be seemin' like a style\nDOOM leave the competition steamin' like a pile\nSmile, ding! Sparklin' jewels\nIn effect like alternate side of the street parkin' rules\nFools, the roach was never dead\nLive for a week, then dehydrate with a severed head\nInstead it was depicted as flicked in\nSplit, the wicks lit\n(Can you dig it?)\n\n\"We have got to try and find DOOM!\"\n\"Good luck!\"", "?": "[Produced by MF DOOM]\n\n[Intro: Dr. Doom]\nMy servants began to forge what was to become\nThe most dreaded costume on the face of the earth\nThe last thing to fit was the mask\nWill it conform to my twisted features in comfort\n\n[Verse 1: MF DOOM]\nHe cleans his metal mask with gasoline, they after him\nLast seen pulling chicks like a fiend pull a fast one\nCan't put shit past him\nGot niggas on his own team mad enough to blast him\nRetarded in real life, on the mic Rain Man\nStand close to his main man like a chain gang\nWho give a fuck about who or they fancy crew\nThat's no mystery that Hardy Boys do with Nancy Drew\nSaw her with her drawers down, caught her\nThe extorter bring slaughter like \"Well I oughta\"\nI suggest you hand over the formula doula\nA villain in your land, in his land a ruler\nHard hitting like puffing a woola with Lieutenant Uhura\nEvery day feel like it's an off day with Ferris Bueller\nBrother pull heat to prove they not sweet\nNo matter how you spell it, we still got beats\n\n[Verse 2: Kurious + MF DOOM]\nDon't question how we live, question what we give\nTake it to the next leave 'em where they can't see me\nStill they judge, but they be butt ass\nTwist that wig like a muppet, keep it simple, can't truss it\nLight's the fuel, mic is the tool\nDrink Jack, kick back, drop jewel, finish what I start\nMastered the art, living hell can't explain it\nInhale confuse it more, cop the .44\nContemplate, meditate, dictate\nI direct my direct fate, coming of late\nKurious, can I say, \"Shit?\"\nDo it for CottleRock, do it for K.Nit\n(RIP)\nK-N-I-T, Sub R-O-C\n(Eternally for M-I-C)\nOnly we save we\n\n[Interlude: MF DOOM]\n\n[Verse 3: MF DOOM]\nBy candlelight my hand will write these rhymes 'til I'm burnt out\nMostly from experience, shit that I learned about\nTopics and views, generally concerned about\nWith different ways to come up and earn clout\nI take a look at my life and pace the trails\nFrom Tablik and savage females with fake nails to face veils\nYou out your frame but still bagging 'em too\nYou know I know, these hoes be asking me if I'm you\nLike my twin brother, we did everything together\nFrom hundred raka'at salats to copping butter leathers\nRemember when you went and got the dark blue Ballys\nI had all the different color Cazals and Gazelles\nThe \"SUBROC\" three-finger ring with the ruby in the \"O\", ock\nTruly the illest dynamic duo on the whole block\nI keep a flick of you with the machete sword in your hand\nEverything is going according to plan man", "Kon Karne": "[Verse: MF DOOM + sample]\nDarker than the East river, larger than the Empire State\nWhere the beast who guard the barbed wire gate\nIs on the job—not my fate, tired of the wait\n'Til the Villain bring deliverance from the dire straits\nFire at a higher rate why'd they make the liars?\nFliers scatter, buy a plate—isolate the wires\nTry the straight pliers, if not—the vice grips\nA real price-saver way to acquire nice whips\nWhat a steal for real on wheels of steel\nStunner, a funner summer number-one meal deal-bummer\nA bizarre phenomenon—is your armor on?\nTake your cash, Karma, or break your fast—Ramadan\nTransaction drama—aw, come on, Barney\nClack, clack—pardon me, wack rap con carne\nHe came to feed the childrens like Sally Struthers\nAfter that, he's going back to Cali, where's the—(\"—love is—\")\nWilder than the Nile, hold power like the great pyramids\nOf Giza, and stay leanin' like the tower of Pisa\nGive him something he can feel that's soft to squeeza\nRaw with the pen, and on the mic—off the hezza\nGet shot off that wide-eyed talk\nIf he had a pot—he'd still piss on the sidewalk\nCan't take the street out the street-person\nLookin' for the perfect beat, coercion into heat-burstin'\nThey couldn't spot him on the spot date\nGot the only tape that come with a free hot-plate\nWhoever do get to see me sing\nWith the 3-D ring, sittin' stationary like B.B. King\nCan see how it really sting—it ain't no front row\nStanding room only at the motocross stunt show\nThe ruckus ain't up to Snuffleupagus\nMe and Sub' is like the brown Smothers Brothers (\"My love is—\")\nVaster than the seven seas, bigger than Mount Kilimanjaro\nIf they don't know, fill 'em in tomorrow\nOn the horror show, a mental note: return Bob’s record\nSwear to God, before he gets a job, he robs Eckerd\nBlessed with a hot flow—tested—it got dough\nInvested in stress, the best to finesse an opto\nAs I reminisce, never forgot when I was very broke\nShot the Henny straight, couldn't afford to cop the Cherry Coke\nOr should I say, broke with wealth?\nTo know enough to give them just enough rope to yoke they self\nPlan B before I take the ring and pawn it\nThe long arm of the law couldn't even put they fingers on it\nDog-gone it—do the statistics\nHow he bust lyrics—it's too futuristic for ballistics\nAnd far too eccentric for forensics\nI dedicate this mix to Subroc, the hip-hop Hendrix\n\n[Outro: Sample + [?]]\n\"In my pocket, a note. \nIt's—from my father.\"\n\"—from the guard's whip. Is this a trick?\nWhy would I resort to trickery? You're already a prisoner. What do I gain by deceiving you?\nYou can't blame me for being suspicious.\"\n\"No.\"\nHehe\n\n[Produced by MF DOOM]", "Kookies": "[Verse 1]\nIt's horrible, one little evening alone, home\nEnd up with carpal tunnel syndrome\nAnd here I am, known for giving heavy back aches\nGrown and living off of Little Debbie snack cakes\nSupposed to be checking emails\nAll I got is messages from ass naked females\nI don't know a Jenny\nShe said it's free and I won't owe her a penny\nAnd that's the last time I saw her\nBut thousands of more horrors on online Gomorrah\nAnd Sodom, they got 'em with they curls out\nAnd they got a better sales pitch than the Girl Scouts\nI wonder what I owe her\nFor a whole box of caramel coconut samoa\n(\"Nite nite!\"), Uh, ok honey, sweet dreams\nNow it's time to get serious like Peek Freans\nA metal handful, wipe it on the quilt\nWife wake up and I'm kill't over spilt milk\nLocked in, looking at your picture\nFully clothed winter and I right there with ya\nThinking about the last time I split your wishbone\nA man could only wish you do the same 'til he get home\nFat chance, at least he get snacks\nThat'd have to do 'til a brother get back\nUntil then smack One-Eyed Jack\nAnd hope one of his peoples can hook him with a tri-pack\nThat's three different flavors\nChocolate, vanilla and strawberry wafers\nActing all hard, 'bout to get beat up\nI'll show him what time it is once I get this sheet up\nSoon as he fell off the beat down\nAll I hear is, \"13th cell, put the sheet down\"\nDamn C.O.,, what the hell do she know?\nBesides the fact she wanna get dug out on the d-low\nA workaholic with a fountain in the ink pen\nOut in the mountains and I stopped drinking again\nIn the wee hours, he's gotten farther\nNeeding three showers, being hot and bothered\nThe wiz with her legs bent, pregnant\nGod bless the day she wondered where her egg went\nI need a L, it's hard to drink without it\nAnd could use some kookies but trying not to think about it\nWatching \"BET\" on jazz for knowledge on file\nEvery other commercial, college hoes gone wild\nSoft batch, I prefer the other bunch\nLike we got for lunch, chocolate fudge butter crunch\n\n[Instrumental Break]\n\n[Verse 2]\nHe don't mess with the Ritz Bits\nWheat Thins, Saltines or Triscuits\nMatzos or Cheez-Its\nCatch sugar fits every time that he sees\nChips Ahoy, double chocolate chunk\nSomething with the bubble and the junk in the trunk\nEven the Oreos, no matter what weather\nAlways kept 'em dipped in milk and stuck together\nIn the game he's shameless\nEven uses a code name: Famous Amos\nIt's cheaper than a short stay at the Day's Inn\nAnd good like 25 cent oatmeal raisin\nGive a hand to who invented the camera\nSkip past the gram animal in Grandma’s\nShh, make sure she don't wake from her dream chill\nOr get caught with a handful of cream fill\n\n\"Oh, honey! What are you doing? That's so nasty!\"\nIt might seem ill\n\"Ew! Go wash your hands!\"\nKookies\n\n[Outro: Samples]\n\"DOOM is master of the world.\"\n\"I'd sure hate to see that ugly mug in my history book.\"\n\"You've disturbed me for the last time.\"\n(Voice 1): Hey, y'know something gang, that DOOM ain't all bad\n(Voice 2): What do you mean, Ben?\n(Voice 1): Well I gotta admit that I've been having a real good time. Y'know, I mean, between you and me I kinda like being black\n(Voice 3): Well, maybe if we're lucky he'll attack one more time and send you back then, Benjamin\n(Voice 1): Ah-haha very funny, very very funny\n(Voice 2): He must be mad\n(Voice 4): Well, if anyone can do it. Nevertheless let's get out of here, while we can\n(Misc. Voice): Food, we need food", "Kon Queso": "[Verse]\nGive it a sec for the pain to start\nThis wreck right here, it ain't for the faint of heart\nThey thought they saw the worst verse\nFrom the team of G men who seem like nerds at first\nOnce they get to know us people dig us\nLeaders in the fight for equal rights for niggas\nInventor of the more dementeder flow, no bout a-doubt it\nThis go for if you're bout it bout it or rowdy, rowdy\nWhatever's clever, the master fold\nWho every hooker heard of, but now ho know\nIf we see tomorrow, the next day classes\nThe Villain in the back with the x-ray glasses\nHave no fear, the ninja here\nFeel 'em like the tinge in your ear from drinking ginger beer\nWhen it's on, loco head gon' lay low\nAnd heat it like beef patty, coco bread kon queso\nIf you say so lace the whole case load\nThey say he wear a metal mask in case his face show\nHe told 'em they flows is bitch talk and ayo's\nHis whole crew walk with pitchfork and halos\nSay, ho, if you never worked a J-O\nAnd keep more cash in the stash than a peso\nOkay, yo, y'all know who to follow\nTie 'em up in the crib and leave they place hollow\nOh, shoot, the goose is loose\nSo wild you couldn't chase it down with straight fruit juice\nFrown like the first time you taste cous cous\nStash the deuce deuce, troops asking truce, truce\nToday on intense wreck week\nWe have the super villain in his own defense to speak\nIt's all part of my mental techniques\nAvailable to freaks and pencil neck geeks\nTrain a sane brain to an insane train of thought\nOn a campaign trail he came to gain your support\nCharge cash for a autograph\nSay some shit to make your daughter laugh then slaughter the ass\nSee 'em on the big screen like Steve McQueen\nDo something and never be back once he leaves the scene\nKeep more medicated pads than Stridex\nFor his own side wreck with no known side effects\nBefore you press charges use your noodle\nSo what when he grab the mic he crush your cute cuticles\nKeep your mouth shut, everything will be beautiful\nIt would be awfully rude to you, now get back to your hooty hoo\nDamn it, it ain't worth the drama, can it\nFrom the calm bandit eat rhymers like pomegranate\nSoon as he stepped in, he lit the room\nBoom, reschedule my noon with Britt Hume\n(Doom!) In love with Mary Jane, she's my main thing\nPulled her right from that web head, what a lame brain\nMaintain and say it, don't spray it\nYou wanna see your girl again, you might as well pay it\nIf I had a dime for every rhymer that bust guns\nI'll have a cool mil' for my sons in trust funds\nWhen I was broker than a broke dick dog\nI always kept a L to smoke in thick fog\nWhen it rain, it sure do thunderstorm\nI got more rhymes in the summer than musty underarms\nOne, two, microphone checker\nFirst learned to neck off a Home Ec homewrecker\nThis is back when he was like crib age\nWhen he hit the stage, it's like a gauge to the rib cage\nBreak the mic like a rock star, break a guitar\nAnd jump off the stage like, \"Yee haw!\"\n\n[Outro Skit]\n(UN leader): We shall now vote for a new world leader. I nominate, DOOM. All in favor, say I\n(Delegates (In unison)): I\n(Peter Parker): Oh no\n(DOOM): DOOM is master of the world\n\n(Voice 1): We must hurry\n(Voice 2): If you are really with us, prove it. Let me hear you say it. Tell me that DOOM is a tyrant and must be overthrown\n(Voice 1): I-I have spent my life\n(Voice 2): Say it! You have spent your life serving a tyrant. DOOM must be stopped\n(Voice 1): I fear you're right, my friend\n\n(DOOM Cronie): The President of the United States is on the phone\n(DOOM): Mr. President, you're at the mercy of your deadliest enemy\n(President): It is time you learned once and for all, DOOM. The united states does not barter with terrorists\n(DOOM): You never learn, do you?\n\n(Voice 1): Here, this is the address of friends in New York. They'll help", "Gas Drawls": "[Verse 1: MF DOOM]\nBy the way, I re-up on bad dreams, bag up screams in fiftys\nBe up on mad schemes that heat shop like jiffy-pop(pop)\nIn a instant get smoked like Winston Cigarettes\nHo's get ripped off like Nicorette patch\nIn real life the real trife scene\nMight snatch ya life like assault machine\nRifle, dead up setup like bull-fight\nBe blunted how we like couldn't white or in full flight\nThe unemotional call me anti-social\nOn the run off the gun death tally commercial\nDeath valley is like rehearsal to the streets\nTo my peeps G.M MF on the beat\nRhymes is chosen like the weapons of war\nSo keep from steppin on my floor or delivery front door\nI bring it to ya'll motherfuckers master yours\nMy disaster cause: Hell.. in gas drawls\nThe supervillain cooler than a million, I be chillins\nStill quick to slice squares like Sicilians\nDont make me have to hurt them feelings\nI'll ruin you in the dirt that I be doin in my dealings (WHILE I’M)\nSendin spirits through the ceilin', chrome peelin'\nDome blown within the comforts of your own home\nGrown big wheelin' and high rollin'\nI hold the lye, it keeps the sty on my eye swollen'\nHoldin, foldin the pal\nKnown as massive-versatile\nI’d like to big-em-up monster isle\n\n[Break: MF DOOM]\nUummm, Yeah\nI saw you in Hell with them gas drawls\nMhm\n\n[Verse 2: MF DOOM]\nTo my brother Subroc and Black Ju\nI crack brew for, two more, three men, two up\nI hit the brew up like nobody knows how X the unseen feels\nWhen giving crews a brush with death like between meals\nTwo times a day with brothers that's tight like a noose\nWith more rhymes in use than Dr. Seuss or motherfuckin' mother goose\nX the suspicious flirter\nWho every hooker hearda', next to malicious murda'\nA track type vicious fulfillin the pipe wishes\nThe misses may be legal minus the baby eagle\nAny given summer's eve don't breathe\nSixteen shots I do believe and one up the sleeve\nMaster of the O who predict ya last pause\nI told y'all, Hell and gas drawls\nBreakin glass and plastic jaw like federal drastic law\nFed up from fightin' secret war wit' them Fantastic Four (invisible bitch)\nVersus Doom wit' the metal face before I go to state\nThe ho better settle case\nThe flow is at pedal pace steady like tricycles\nBeware all suckas is froze like icicles (bag 'em up)\nAnd baggin' bitches like nickels\nCause I licked 'em where they tickle before I hit the clit though\nI'ma split till I pronounce More hits than a ounce no doubt\nAbout ta bounce, X the unannounced, I'm out\n\n[Outro: MF DOOM\nAnd I like to give a shoutout to the brother Jet Jaguar\nMegalon and King Geedorah\nI call this joint right here Gas Drawls\nIn Hell with yours", "All Outta Ale": "[Sample]\nOne more beer\nAnd I'll take you all\nAll of you\n\n[Intro]\nBanned from all bars\nThe man with seven scars\n\n[Verse 1]\nSmack it up, flip it, pulled out, 'bout to fell\nSunday in the ATL and I'm all outta ale\nLike a bat out of hell, tripped on a cat tail\nMutt drinkin out a pail, who let the rat out the cell?\nGot all the ingredients and recipe, might as well\nSince last week, the bootlegger been in jail\nIf all else fail, inhale the L\nMakin' sure they can't see your sale via snail mail\nMind like a sewer, servin' rhyme on a skewer\nDOOM'll step to a fine dime like he knew her\n\"My black sister!\" She said, \"Step back!\" before he kissed her\nShe did the dipper and the smack just missed her\nThere go a list of politics like Henry Kissinger\n99% of rap's just a friendly listener\nI'm like, \"These dudes must have some screws loose to hate y'all\"\nOr a couple of ounces short of deuce-deuce or 8 Ball\nY'all know it's time for the end when the day come\nBuy a album, get rudely insulted over fake drums\nSame CDs you get for free, you break 'em\nWa-alaikum, make 'em eat they food like Steak-umm\nWhy she wanna ask me if I could pass the paprika?\nOne hand on the mic, the other on the beaker\nEvery week or so, peeked out the lab though, eureka!\nA technique to keep somethin' uniquer in ya speaker\nFor yo' information, I didn't do the beat, y'all\nIt ain't my fault if she didn't move her feet at all\nSkeeter, robbed Peter to pay Paul\nSo he could trick it on Mary so she can play ball\n\n[Chorus]\nShe better have my scrilla\nCut it out with all that funny hand jive, will ya?\nAll this trouble for a tall glass of Olde E\nDrink it all fast and make you haul ass slowly\nRemind me to remember what you told me\nHoly moly, did you get a load of her roly-poly?\nYo, G, remind me to remember what you told me\nWhoever don't feel him, feel balls like a goalie\n\n[Verse 2]\nOne for the money, two for the better green\n3,4-Methylenedioxymethamphetamine\nTold the knock-kneed ghetto queen, \"Get the head fiend\"\nTell him it's for Medellin and use oxyacetylene\nWho needs airplay? It's all just hearsay\nLeave a wig like it was having a bad hair day\nMiracle glide master, asked him what's his secret\nHe said Shasta and turned to formaldehyde faster\nWhen I'm home with my lady, I try to duke her daily\nOne night, she tried to flail me with her ukulele\nPack your heat, the Villain on the cover of Black Beat\nWith a bunch of crackers and some snack meat\n\n[Chorus]\nThey better have my scrilla\nCut it out with all that funny hand jive, will ya?\nAll this trouble for a tall glass of Olde E\nDrink it all fast and make you haul ass slowly\nRemind me to remember what you told me\nHoly moly, did you get a load of her roly-poly?\nYo, G, remind me to remember what you told me", "My Favorite Ladies": "[Intro: MF DOOM]\nMmm, Ladies\nMy favorite ladies\n\n[Verse: MF DOOM]\nMary, you make me wanna eat you\nEverytime I see you, it's like the first time I meet you\nFragrance like a flower, subtle and sweet too\nSeductive and whatever, it might as well be seafood\nLike my genie in a bottle\nMiss could get me rich like a magazine-y model\nBefore you know it, he have her on a stroll\nFresh and ripe, complexion like Acapulco Gold\nIf I had to guess, just right, not a day old\nLike a cradle robber, copped her off, shop a trailer-load (trailer load)\nKnow the right number, you can get her\nAnd hit it while you would've sold to the highest bidder, like\nFruits and berries, bring daddy loot in a hurry\nJust be cute, and don't worry\nType to make a nigga hallucinate and admit it\nThen she started losing weight and letting everybody hit it (Ally)\n\nUnlike Ally (sometimes she gets bitter)\nAlways kept me happy, never had a problem with her\nShe used to let me use her, back when I was looser\nRespect her until to this day and never did abuse her\nI told her I'll be faithful, but she don't believe me\nI probably could've been, if I'd never meet Evie\nShe make me feel all fuzzy inside, it's loco\nYou won't get nowheres near her if you're broke though\n\nKept a shorty, man, find 'em much thinner\nIf caught, I get mad time just for touching her\nKnock wood, so much for hymens\nSo fly, she should be in the sky with diamonds\nLittle young thing, she liked to do the tongue thing\nAt times she would play hard to get, fronting\nOr something, she made me feel like the number one king\nRun into her now, and we still catch a fun fling\nMet her out in Central Park--that's one sign\nHad the God mentally sparked, reflecting sunshine\nShe said \"you need to stop messing with that white girl\nShe fucking with your head and got your heart in a tight curl\" (cookie)\nWe messed around once or twice, but she don't know me\nShe helped me get money at the dunce price OT\nPlus she from Colombia, so she really Spanish\nCookie known to make a cat bank account vanish\n\nAnd Miss Hazy, older woman, mature black\nEverytime she sees me, I end up gettin towed back\nAll she want me to do is blaze it crazy\nThe only one complaint is that she make me too lazy\nSugar-mommy laced me with the butter navy Avi\nJust her way to make up for the headaches that she gave me\nIt's all gravy, when I'm done getting my mack on\nAlly is always there to help me get back on\n\n[Outro: MF DOOM]\nMmm, Ladies\nMy favorite ladies", "Guinnesses": "[Intro Skit]\n(Narrator): Running desperately low on food, they were forced to turn back\n(Interjection): Well I'll be!\n(Interjection 2): What's that villain doing?\n\n(Voice 1): Princess, your voice sounds familiar\n(Princess): Well it should. You see, DOOM wants me to marry him. But after seeing what he has done to our peaceful world, I despise him. He intends to destroy all of us if I persist in refusing him, even now\n\n[Verse 1: Angelika/StaHHr]\nSheitan never came so ill, he got skill\nMet a brother from the grill that gave my spine chills\nAll thirty three nerves controlling my curves\nCommon sense just swerved every time I got served\nStress, frustration, empty rhetoric\nCold as winter in Connecticut, compassion lacking deficit\nThought it was love like, sent from above, you not a soulmate\nMore ways and actions of a primate\nWho by low and census coming faker than extensions\nPissed away all good intentions, outta here sister was missin'\nIntuition, maybe it was me, I couldn't see\nHolding onto fantasy, getting bitten by reality\n\n[Hook: 4ize]\nWar wound, purple heart, love veteran\nMorphine, pain killers, drugs and medicine\nAnything just to forget the hurt\nIncoming! Take cover, hit the dirt\nOn the front-line, there's casualties in the mind\nAnd the POW's get left behind\nMentally scarred for life, love is war\nAnd some chicks are just too hard to wife\n\n[Verse 2: Angelika/StaHHr]\nI shoulda deaded it from genesis instead of hittin' the Guinnesses\nNow I'm free falling, cursing at the street, bawling\nHe ceased calling, no appetite for feast darling\nSo deep all in, I bet he never stop balling women\nForsake God for the scent of a man\nSacrifice a whole life for a slice, overstand?\nMaybe it's a lack of pigment, loneliness imagine figment\nOnly got the car tinted to pull extra G's in it\nDamn Jody, comin with the okie doke, pokie poke\nSteady rockin boats, got me aimin for ya throats\nSniper scope, weren't we supposed to elope?\nPropose then ya froze, I don't think that I can cope\n\n[Hook: 4ize]\nWar wound, purple heart, love veteran\nMorphine, pain killers, drugs and medicine\nAnything just to forget the hurt\nIncoming! Take cover, hit the dirt\nOn the front-line, there's casualties in the mind\nAnd the POW's get left behind\nMentally scarred for life, love is war\nAnd some chicks are just too hard to wife\n\n[Verse 3: Angelika/StaHHr]\nConstant frustration, stemming from a no-win situation\nRushing lust and fornication adding to the complication\nPatience is a virtue, pain run deep when love desert you\nListenin' to whisperin', choosing chaos over discipline\nSimpleton, life should really be a piece of Entenmann’s\nRelationships strengthening, flower essence: Penstemon\nGentlemen, my favorite shit, so I've never forsaken it\nI persevere, make it fit, sculpting and reshaping it\nTaking sips off a fifth of it, passionate, intense\nIncense candles lit, scandalous\nEmotional bandages, why would he abandon this?\nGuess he couldn't handle it, the boss is magnanimous\n\n[Hook: 4ize]\nWar wound, purple heart, love veteran\nMorphine, pain killers, drugs and medicine\nAnything just to forget the hurt\nIncoming! Take cover, hit the dirt\nOn the front-line, there's casualties in the mind\nAnd the POW's get left behind\nMentally scarred for life, love is war\nAnd some chicks are just too hard to wife\n\n[Outro Skit]\n(Interjection): Oh boy here we go!\n(Voice): How come all you college boys wear them faggotty-looking white shoes, the look funny as hell. Ah looks like she got burnt laces\n\n(Bert): You didn't wash your neck. Sometimes we don't wash our necks, but that's ok\n(Ernie): Oh I washed my neck. Take-take a look at my neck\n\n(Misc. Voice): Hold it right there you!\n(DOOM): Where you are going, there are no jokes\n\n(Spiderman): I'm beginning to think that armor plated Gargoyle doesn't like me", "Batty Boyz": "[Intro]\nIf you're waiting for a parade there ain't none\nSharpen up your spirit of adventure\nThe fabulous gay way\nHey what's the big idea\nYeah\nI have no ideas, in fact I'm quite bewildered\nNow don't get gay with me\nGay, sir\nI'm far from gay\nNow listen and keep your shirt on\nGrown men in a rubber suit\nRunnin' around with a young boy\nHomo\n\n[Verse 1]\nOh shoot, get a load of that fruit\nIn thigh-high boots, red tighty-whities and blue cat suit\nHoly homos\nEven the rats know it’s tacky\n'You ever see me slippin' like that bitch, just smack me'\nPosin' Chester, legs open, couldn’t stand worse\nAll was missin' was a bandana and a man purse\nCryin', dyin', laughin' til glands burst\nFaster than a speeding glass, bleeding-ass ran first\nFixin' baby hair, messed up wavy curl\nUnder the cape the back of the S say baby girl\nThe things some people‘ll do for fame\nIt’s an herb, it’s a lame\nIt’s... a Goddamn shame\nVillain willing when them cold streets call\nYou can keep your hero and hold the meatballs\nWorthy title, lock it with pockets on empty\nHe work harder than a steam engine like John Henry\nTurn dirt to dollars like Don Henley\nUgly and still get hollers like Ron Jeremy\nAt least monetarily terribly\nMC's need therapy, it’s like a fairy spree\nHit him with a kryptonite brick\nChildren come and prick his dead body with a stick\nWrote this lyric from in the bed with a chick\nShe had the tightest grip around the head of my\n\n[Verse 2]\n...Bic, now can I get my pen back\nGot no enemy, got no friend, black\nWith the Green Goblin got the Batcave robbed\nBust in Batman’s head bobbin’, slobbin’ Robin’s knob\nY’all already got your belts on the floor so\nKick them shits over here and click off the porno\nAlfred come home and found them both naked\nHandcuffed to each other just as he had suspected\nRed and chrome Batmobile, wheelin‘ and dealin’\nAquaman's sleepin' with the fishes, for real for squealin’\nPss the lo-lo on a seal skin blazer\nIt’s just a little graze from a razor-thin laser\nAmazed at all these so-called wannabe players\nShowin' off they titballs to all the free-gayers\nIt’s like a leotard fest\nHow it got started is any retards guess\nRegardless, that’s they choice, no hate debate\nBecomes a problem when they try an attempt to go straight\nAnd raise the monster rate in the whole population\nIt’s starting to affect the super pimpin’ occupation\nNow, who’s the hater, headline the newspaper\nFate of a fake you out caped crusader\nTied to the tracks, make a damn tram derail\nRap is like scam spam Nigerian e-mail\nThe man with no beard is more weirder than a she-male\nSucker got bagged on a Temazepam street sale\nTold ‘em one of ours set it up, yeah doubt\nDid it like the dirty drawls\nWet ‘em up and air it out\n\n[Outro]\nYou got any money\nWhat\nYou got any money\nMan you gone crazy\nDamn\nBatman's gay\nBhati boys", "Tick, Tick...": "[Intro: MF DOOM & MF Grimm]\nYou know when you're gonna come in?\nNobody will never ever, ever, really, really know\nBecause the more you know, the more you know that you don't know shit!\nNiggas'll never run out of shit!\nSo much shit, so much scripts through here, niggas never run out of shit...\nIt's another roller coaster ride\n\n[Verse 1: MF Grimm]\nWalk the path of Jesus, witness if Hell freezes\nThe mind teases reality, crack the pieces\nNothing eases; being chastise with blood baptize\nGuys revise, acknowledge past lives\nStatements will be made, acknowledge me (Acknowledge me)\nMy mind is Heaven's gate so enter me (Enter me)\nMy mind is the gate to Hell, so try to flee (Try to flee)\nBoth gates look the same, which will it be?\nDemons scream from thought process\nEnter semen, child born, stress\nBody want to sleep but the mind can't rest\nMeasure pleasure through financial progress\nWhen it come to currency, love is nonexistent\nFoes multiply, friends become so distant\nSome hope you die, backstab in an instant\nFoes I despise, disguised as allies\nTo sabotage, camouflage\nLoyalty is lies\nTo see God, look into my eyes\nTo see the Devil, then you look into my eyes\n(As I rise from Hell's equator...)\n\n[Chorus]\nCause I'mma slow it up, speed it up, slow it up, speed it up\nMetal Fingers feed beats, Grimm Reaper eat 'em up\nSpeed 'em up, slow 'em up, speed 'em up, slow it up\nBrainsick, tick, tick, tick, MF blow it up\nSlow it up, speed it up, slow it up, speed it up\nMetal Fingers feed beats, Grimm Reaper eat it up\nSpeed it up, slow it up, speed it up, slow it up\nBrainsick, tick, tick, tick, MF blow it up\n\n[Verse 2: MF Grimm]\nTake air, compress it, bless it\nMix loops like Ku Klux\nMF don't give two fucks\nNigga, quarterback blitz, popped, quickly fumble\nLeave game with concussion, seeing stars and mumbles\nThis happens to any emcee that wants to rumble\nDynasties destroyed like Carringtons and Colbys\nNoise, reduced, MF thinks in Dolby\nChop that ass in half like Obi-Wan Kenobi\nGreatest of all time, God straight up told me\nGreatest of all time, the Devil even told me\nIcicles on surfaces of sun, we livin' coldly\nProphets be phony\nAnd we attack, we switch like the Wu Tang symbol\nStill kill Jack even though quick and nimble, plain and simple\nPick niggas off while they ballin'\nAnd die old like Stalin\nYes, Death, I hear you callin', I accept collect\nHuman sacrifice, must pay respect\nWe catch reck, nigga, we catch reck\nAnd... we gonna... gonna...\n\n[Chorus]\nCause I'mma slow it up, speed it up, slow it up, speed it up\nMetal Fingers feed beats, Grimm Reaper eat 'em up\nSpeed 'em up, slow 'em up, speed 'em up, slow it up\nBrainsick, tick, tick, tick, MF blow it up\nSlow it up, speed it up, slow it up, speed it up\nMetal Fingers feed beats, Grimm Reaper eat it up\nSpeed it up, slow it up, speed it up, slow it up\nBrainsick, tick, tick, tick, MF blow it up\n\n[Outro]\nBoom\nMF Grimm, MF DOOM", "Hey!": "[Produced by MF DOOM]\n\n[Intro: MF DOOM + sample]\nGood evening, ladies and gentlemen\n(\"Hey!\")\nI'd like to thank you all for joining us this evening\nLet me know if y'all with me, y'all\n(\"Hey!\")\nJust a couple of things I wanna say\n\n[Verse]\nI only play the games that I win at\nAnd stay the same with more rhymes than there's ways to skin cats\nAs a matter of fact, let me rephrase:\nWith more rhymes than there's ways to fillet felines these days\nWatch the path of the black one: Supervillian\nHe wrecks clubs for delf in a drunken stupor, chillin'\nReady and willin' to inadvertently foil that\nPlan of any rhymer, whiner or spoiled brat\nWho got more snottier flows than snotty nose?\nAnd holds mics like he knows karate body blows?\nNobody knows the trouble I see\nFrom the MPV fly dirty tailin' the eye bubble eye thirty\nFor the record; this is some shit I just thought of, y'all\nScience fiction that's not admissible (\"Hey!\") in no court of law\nI live to rock mics 3-D\nThe only reason I seek to stop—to snuff the TV\nI heard beats, they sound like karaoke\nWith monkey rhymers on a leash like don't have this fairy choke me\nHit 'em with a penny so we can get these peanuts\nAnd I thought we was nuts, I used to get free cuts\nThey locks Lex Luthor up in Green Haven\nSince when a nigga never really been too clean shaven\nMisbehavin' rap stars need Listamint\nCall me Mista Bent\nI'm at where your sister went\nIntelligent, used to write and be well spoke\nNow all a nigga wanna do is fight and sell—(\"Hey!\")\n—tell a joke\nThis could lead to catastrophe\n'Bout to stop the violence right after these last of three\nShots from the black bat got me at headlock\nHoldin' on to sanity, by strands of that dreadlock\nShe told me, \"Get off,\" I said, \"Bitch!\nLet me set this shit off so I can get rich right quick\"\nThen it hit me like the point of intoxication\nNigga, come out and rock this nation like (\"Hey!\") ox defacin'\nA lot of niggas out is rusty like oxidation\nIn this world's strangest, most dangerous occupation\nBut you could do it, you the Super like in your building\nVillian like trife Kinder is in All My Children\nPlottin' and it sure to pay ends\nWith some real mature womens, and more of they friends (\"Hey!\")\nAnd when bad men roll tight, it's actual true\nLike a pack of Big Bambú, with natural glue\nWho grip necks of Becks to triple X?\nHe just came in 4-D: Follow the ripple effects\nAnd it'll lead you right to him\nOh, snap!\nIt seems you walked into a trap, through rap\nZoinks!\nThis place is filled with pretender willies\nOne false move, and get broke off like end of Phillies\nTrue believers\nAin't nothin new to a\nCrook with special powers like how to tell the future uh-uh-\nRhyme of the month two page long\nBustin' off two gages with my cape on wrong\nSon, it's on, remind me of a Raekwon tape song\nWith a fleet of super bad... Status: Rae Dawn Chong\nLet me know if y'alls with me, y'all! (\"Hey!\")\nNational and geographic down to the titty-bar\nRep Monster Island City, y'all!\nTo all my brothers who is doin' unsettlin' bids\nYou could have got away with it if it was not for them\nMeddlin' kids!\n(\"Over here!\")\n\n[Outro: Sample]\n\"Hey!\"\n\"Hey!\"", "Red & Gold": "[Verse 1]\nI remember when, last past November when\nClown kid got pounded in with the Timberlands\nThey left him trembling, he was not remembering:\nNever tuck your denim in just to floss an emblem\nSome would debate, \"Wait, the fella ate gelatin\nOr he been listening in to what his weathermens was telling him\"\nWhen I could feel it in my melanin, it's compelling\nUs to break them off, no reassembling\nNo science-fiction to no theater near you, coming soon to\nFuck with you frequently like how phases of the moon would do\nYou could gather 'round like it was an eclipse\nJust don't look directly to the bitch, you may be blinded by the scripts\nPass the L, the last to tussle in them shirttails\nAll hail, King Geedorah, the third rail\n700 volts holds rap to a standstill\nFool ignore the rule, fuck up and get his man killed\nTwo bottles of Dom got his hands filled\nAnd so goes the days of our lives as the hourglass sand spill\nAnd built with Passion and a glass of the 'Ze\n(And the lights went down and hey!)\n\n[Hook]\nAnd I knew it was the last day - Wig-Twisting Season\nWhen some could get their wigs twisted back within reason\nMostly with these crimes of treason\nAnd you'll be lucky if there's no squeezing even this evening\n\n[Verse 2]\nFrom how he's feeling, thrilling choice of flow is sick\nHe's the villain with the million dollar voice-throw trick\nHe's like a ventriloquist, with his fist in the speaker's back\nCouldn't think of no uniquer track, nope, sneak attack\nIt don't really matter how big them is. So much as a nipple\nCause you could have a chick with D-Triple\n'Cept the nipple little. Just hot off the griddle\nLike how he do monkey rhymers, like Monkey-in-the-Middle by his damn self\nAin't no average MC ahead of me\nGetting cheddar instead of the probably better pedigree\nWith nicknames, sick games as Rick James\nMessy games, sci-fly such as Jesse James\nBlast, I figure, ass-hawking ass titty licker\nLast one to walk up in, fast-talking city slicker\nGot bagged cause of the dirty chick with make-up\nBail out quick for the 7:30 wake-up\nMy only backup was an A-cup, as far as May\nTo when the leaves turn red and gold to Nimrod earthday\nAll else? Worthless to say\n(And the lights went down and hey!)\n\n[Hook]\nThat's when I knew it was the first day - Wig-Twisting Season\nWhen some could get their wigs twisted back within reasoning\nMostly with these crimes of treason men\nAnd y'all be lucky if there's no squeezing even this evening\n\n[Verse 3]\nIt's like a mosquito, the much sweeter resent the act\nI been bent back since my Physical went back\nSince, Cultured more of my kin\nAnd for them I keep an L rolled in this hellhole\nHold your head, use your head and hold, or be dead and cold\nIn the worsest way, soon as the leaves show red and gold\nTo 'round Nimrod release day\nAnd all else? Needless to say\nWait a motherfucking minute! True facts presented\nThe names was probably changed just to protect who ain't in it\nThe XP was three-quarters tinted, 4/5ths was converted\nThe way his shit was twisted? Ask him if it hurted\n\n[Hook]\nWig-Twisting Season\nWhen some could get their wigs twisted back within reasoning\nMostly with these crimes of lying, and fronting, and cheating\nAll types of different styles of treason", "Cellz": "[Intro: Charles Bukowski]\nBorn like this, into this\nAs the chalk faces smile, as Mrs. Death laughs\nAs political landscapes dissolve\nAs the oily fish spit out their oily prey\nWe are born like this, into this\nInto hospitals that are too expensive that it is cheaper to die\nInto lawyers who charged so much that it is cheaper to plead guilty\nInto a country where the jails are full and the madhouses closed\nInto a place where the masses elevate fools into rich heroes\nBorn into this, walking and living through this, dying because of this\nCastrated, debauched, disinherited, because of this\nThe fingers reach toward an unresponsive God\nThe fingers reach for the bottle, the pill, the powder\nWe are born into this sorrowful deadliness\nThere will be open and unpunished murder in the streets\nIt will be guns and roving mobs\nLand will be useless\nFood will become a diminishing return\nNuclear power will be taken over by the many\nExplosions will continually shape the earth\nRadiated men will eat the flesh of radiated men\nThe rotting bodies of men and animals stink in the dark wind\nAnd there will be the most beautiful silence never heard\nBorn out of that\nThe sun hidden there\nAwaiting the next chapter\n\n[Verse 1: MF DOOM]\nDOOM from the realm of El Kulum smelly gel fume\nSeparating cell womb to Melle Mel boom\nRevelations in Braille respiration inhale view\nNations fail and shaking of a snake tail make due\nBlazing swords trace the haze praise the Lord\nSaving Grace, lace your broad she say she bored\nA crazy straw, ink and stale dry paraffin\nCandy corn crap rappers pale by comparison\nA Bad Samaritan averaging above average men\nRancid rants having rambling savages scavenging\nFor scraps, perhaps road kill if that\nGift of gab and he flowed ill chrome stiff hat\nKnown for writing lightning tight lines\nChief and beefing being off deep ends divine bright shines even\nDimes quiet as mimes by design mighty fine\nSlight rewind tightly bind blind lead blind\nNeed mines now that was this is then, listening\nTo sizzling officialtons whispering, \"Him again\"\nMetal Face Finster playing with the dirty money\nSinister, don't know what he saying but the words be funny\nMajor vet spaded through the vest with a bayonet\nSave your breath gave a F pay your debt they forget\nMake her sweat bullets crime pays no benefits\nThen it gets wilder with more childisher degenerates\n\n[Interlude: Sample]\n\"Three thousand years ago Moses said\nEvery human being is responsible for his actions\nOr thy being is still thy beast, not yet human!\"\n\n[Verse 2: MF DOOM]\nYou ought to let your uncle flow my motorcyle trunk fulls\nFrom 2 1 2 1 lose crumbs to trunks in bundles\nHands down, better than what your mans use to get\nStanding around from where the translucent looses spit\nMissing wheel you don't listen you're a feel head\nSitting in the kitchen pissing twitching kissing steel lead\nCrime pays no dental nor medical\nUnless you catch some time in county, state or federal\nYou heard like roaring waters in a seashell\nIf a tree fell you couldn't tell from 3 cell\nBe real careful, they tell him by the earful\nKids doing skid bids acting out is terrible\nWord is bond, fix your clothes put a shirt on\nPants sagging back when you use to meant you had a skirt on\nSquirts posing as thuggers and hustlers\nEl Eloh closer then y'alls ball huggers and jugglers\nMotherfuckers\n\n(Voice)\nDOOM is transmitting a message to you\nSuper fools\nI need to use more power", "The Finest": "[Intro: MF Doom]\nAs the life cycle goes on ... goes on\nAnd you learn to hold on (hold on)\nTo things like the mic ... the mic\nAnd you learn to appreciate who is the nicest on said device\nBut who is (The finest)\n\n[Verse 1: Tommy Gunn + MF Doom]\nTommy Tashuma, too much drama, blind behind the rumor\nTime and time and time, my mind, I'm trying to find a tumor\nTommy Tashuma, no time for humor\nAs soon as one of ya' men's dead in Hempstead, you trying to find Pumas\nSooner the better, even knitted a sweater already\nKeep your leather, we coming through the brutal weather\nWe ready to do whatever, yo' Doom you with it?\nYou know it like a poet, my brother\nHey, Gunn you wit it? Whatever... [the finest!]\n\n[Verse 2: MF Doom]\nI know about going paid to broke, to next day well-off\nTo bust a shell off, to dick-riders: \"Get the hell off\"\nMade a call to a client, he must've had his cell off\nA show-off, he has the same bike Puff fell off\nI tell off the bat, from science to pure facts\nWhich niggas is wack 'til they last two tracks\nMatter fact, y'all could wait for the rep to tell\nThe tall-tale, how he escape from out the depths of hell\n\n[Verse 3: Tommy Gunn]\nWhen die, he gon' die like a soldier die:\nHolding a swollen eye, drinking Olde Gold\nSmoking a stog, watching po-po patrol the beach\nBlowing my high, rolling by, when Gunn die\nHe gon' try to preach the streets then go to the sky\n\n[Verse 4: MF Doom]\nYup! That hold water, like drizzle in a paper cup\nThis one etched in stone, the chisel with the paper up\nI need a cut: a taper-up, edge-up\nNiggas can't measure up, I'm here to get the treasure up\n\n[Verse 5: Megalon]\nStands up and hold 'em high, do or die\nHe got heat, no surprise, stop the beat, close your eyes\nGot the weed, rolling lah\nNot sweet, so no demise, all the guys drops seeds so multiply\nWithin the prophecies hold the lie\n\n[Verse 6: MF Doom]\nHe bled my mother and my father, but can't bleed me, OD\nGhetto misery, he bled my brother, my sister, but can't bleed me\nA OG, ghetto misery, bled my mother, my father, but can't bleed me\nSci-Fly, whole style stuck up\nUsed to talk to myself, I told him, \"Shut the fuck up!\"\nBuckle up, cause it's about to be rough\nHe said, \"Keep talking that shit, you 'bout to be snuffed\"\nThen we squashed it, I let em know: \"Watch it --\nWe only met a time to join these rhymers in the mosh pit\"\nGosh, it feels great just to increase the chance\nFor a pussy nigga face to hit the dance floor\n\n[Verse 7: Megalon + MF Doom]\nI pull ya' top up, got clout, crack rock, what?\nNow it's all good business, and so this bitch is locked up\nOn the dance floor: you got knocked out, your bitch got knocked up\nBaby-face, and hey can you brand you, brand new machete\nDamn, I just shook your hand and can't stand you already\nCan't stand you, understand you deadly\nBut my hammer's like a band, my man, it's Brand New and Heavy\nYo' Doom, you ready?\nYeah! Yo' Gunn, you with it?\nWhatever\n\n[Verse 8: MF Doom]\nCome on stay, I wrote this rhyme on my born-day\nRemind me of the same style I flipped on \"Hey!\"\nYikes! Who can fuck with the likes\nOf one such who scores touchdown and spikes mic's\nMetal grill, with many styles, better still\nFeel like number 26 on a roulette wheel\nAnd deal, and run rings around rhymers\nAnd run rings like number runners whose old-timers\n\n[Verse 9: Megalon]\nShorty in the all black, she think she all that\nI called her, she said, \"Don't call back!\"\nShe called me, now what you call that?\nLet's go back, I sold crack\nHold gats, smoke that, drink that, toke that\nFuck! Where that ho at? Where that dough at?\n\n[Verse 10: MF Doom]\nSuffering succotash! This hooker broke into his last buck of cash\nHe love her, motherfuck her ass\nMetal feet dented your car fender\nMy agenda up in the basement party tipping the bartender\nIs unbeknownst to you -- who could get body blown?\nMF like Mike Fran Corleone\nAnd got it sown, maricon, like to know what you staring at?\nAn invisible cat, who pull off a disappearing act\nRaised by a pack a wild womens like Sweetback\nFront? I'mma be back! (Like brothers in the street act)\n(Surrounded by a bunch a bad bitches like Sweetback)\n(Fuck with me I'll be back)\nLike niggas in the streets act (streets act!)\n\n[Outro: Sample]\nOf black misery\nThe finest", "Dead Bent": "[Produced by MF DOOM]\n\n[Verse 1]\nGoddamn it\nSuper motherfucking villain goddamn it\nAbout to get these millions, stacks and shit\nYo, his dip tried to tell him\nOoh, you're like the sun\nChasing all of the rain away\nWhen you come around, you bring brighter days\nShe told him\nYou're the perfect one\nFor me and you forever will be\nHe told her\nI will rock this microphone ... always!\n\n[Verse 2]\nI hold the mic, like niggas hold their girls tight\nBut I ain't after her, probably your Acura pearl white\nThe hooker? Nah, as many times as I done hit it\nTo be specific more times than dimes in a briz-nick\nWhen you broke North, I crashed the barbecue like Riddick\nAt the Garden, true, that's the God in me, pardon you\nJeepers! I was tore back, the ho gained access to my beeper\nCalled back my secretary gatekeeper\nLike I ain't peep her, I said, \"Darling you was stupid though\nYou know the Super Villain, (He is a super) ho\"\n\n[Verse 3]\nI had this style ever since I was a child\nI got this other style I ain't flip in a while, it goes\nPure scientific intelligence, with one point of relevance\nEmcees whose styles need Velamints\nAnd once the smoke clear, tell 'em it's\nThe Super motherfucking Villain, nigga came through raw like the elements\nOn 99 plus one of them\nAnd with a flow to pull a fraud nigga file from out in front of him\nWhen we with y'all, we had tons of fun\nMe and my duns and them\nActual true and living sons of them\nDead planets and God-U's\nThrowing divine rules to come through, we will over charge you's\nFool, and won't feel remorse for shit\nExcept for one time, once I had took my fronts out and lost them shits\nScientific going berserk like Red Alert\nI really went to pick up wiznork for cheddar dirt\nTo fund these experiments is where I went\nObviously dead bent, and spent every red cent\nTo rule you, and still drop more jewels than schools do\nOr even TV news that's designed to fool you (who?)\nYeah you, who hear the most grimy suggestions\nFrom brothers with fly names and I.D. questions\nThat's a Secret like Victoria teddy sets that's edible\nThem's not ready yet for the incredible\nTeam of MC's who broke all fakes\nWho thought they were slaughter proof\n\n[Outro]\nStomping through like North Face waterproof\nTat-tat, that's the end of that\nAfter hit the bar where baby girl bartender at\nI told her more wine, mingling with no single mentions of\nStay tuned for more spine tingling adventures of ...", "MF DOOM’s Mask Through The Ages (Feature)": "Zev Love X (1988 ~ 1993)Villain's first step into the spotlight was under his nickname 'Zev Love X' at the age of 17. He was part of the group KMD with his younger brother (DJ Subroc)  and third member Rodan, who was later replaced by Onyx the Birthstone Kid. After his brother DJ Subroc's death and the group was dropped from their label, DOOM went off the grid for half a decade.\n\nDuring his time with KMD DOOM didn't wear anything to hide his face from the public. Unless you count cap and his glasses of course...\nPre-MF DOOM (1997 ~ 1999)\"Dumile began freestyling incognito at open-mic events at the Nuyorican Poets Café in Manhattan, obscuring his face by putting a women's stocking over his head.\"\n- Wikipedia\nBefore even picking up the identity of MF DOOM, Dumile had already made the decision to cover up his face when he returned to the hip-hop scene. The quote above states he was wearing women's stockings over his face while 'KEO', who worked with DOOM on his first 2 masks, has stated he also wore a bandana over his face to conceal his identity. No real pictures of this era are spread publicly.\nPrototype DOOM mask (1999)Worn in videoclips from the 'Operation: Doomsday' album; for instance in '?'  & 'Dead Bent'\n\nDumile took on the identity of MF DOOM, based of Marvel villain Doctor Doom, and started with wearing a 'real' mask instead of stockings or a bandana.\n\n\"He cleans his metal mask with gasoline\"\n- MF DOOM on '?'\nBy the time DOOM spitted the line above, his mask wasn't even made of real metal yet. It was still just a plastic altered WWF Kane mask, also known as 'prototype'. Cleaning his mask with gasoline is for that reason probably not a good idea.\n\nExtra: Make your own MF DOOM prototype mask! ✂️\nOriginal DOOM mask (2000 ~ 2004)Worn on the album cover of Madvillainy, also in the music video's for this project and is the base for all further iterations.\n\"We went out and found the whole helmet from the movie 'Gladiator'\"\n~ Blake 'KEO' Lethem\nThe first real iteration where the mask was made out of metal. This was made shortly after Operation: Doomsday as he was seen wearing this during his performances at this point in time.\n\nThis mask, which is basically just the face plate from a dissmantled roman helmet replica from the movie 'Gladiator' enriched with construction helmet webbing, is considered to be the face of MF DOOM ever since.\nOriginal DOOM mask + Side spikes (2005 ~ 2010)Started to appear around the time DOOM collaborated with Danger Mouse as DANGERDOOM.\n\nIn 2004 DOOM was still seen with his original mask; for instance on the cover of 'Madvillainy'. 2005 was the year his album 'The Mouse and the Mask' came out. Even though the mask illustrated on the cover of this album doesn't have any side spikes, there are in fact pictures of the duo DANGERDOOM with these on the side of his face.\n\nThe overal aesthetics of the mask are identical to the original mask; only there are now two spikes located on each temperol bone.\nOriginal DOOM mask + Jewel & Side spikes (2011 ~ 2014)Can be seen in the music videos for his collaboration with Jneiro Jarel, where he appears as part of JJ DOOM. Also worn during the RedBull Music academy interview which took place in Madrid, 2011.\n\nIt basically is identical to the original mask with the side spikes, The biggest change however is that this mask has a small mostly red jewel in between the eyebrow area. On some occassions the jewel was seen in other colors, for instance cyan blue. It also looks more chrome-ish since the mask reflects more light than the others normally did.\nGolden DOOM mask (May 2014)First appeared in an announcement video DOOM made for 'Check the Rhyme' festival in France where he had a show.\n\nThis mask was the first iteration which changed the primary color of it, being gold instead of metallic/silver. Another unique detail about this mask is that appart from the earlier described masks there is a color difference in the hardware; The side spikes are still the chrome/silverish color while the rest of the mask is in fact gold.\n\nNehruvian DOOM mask (Oktober 2014)Started to appear around the time DOOM formed the duo NehruvianDoom with Bishop Nehru.\n\nWhile wearing the golden mask on the NehruvianDoom album artwork, DOOM has been seen sporting a transparent red mask around Bishop Nehru. the same color difference, just like on the gold one, between the spikes and the rest of the mask is also featured on this iteration. A new unique feature which isn't been spotted on other variants but does appear on the Nehruvian DOOM mask is that the jewel inbetween the eyes seems to be missing, even though the socket for the jewel is there.", "Go with the Flow": "[Verse: MF DOOM]\nBig up all the Monsta Island massive\nAnd beware before I triple dare you like the last kid\nWho asked me what we don't got that you got son\nFor one flow that's elementary, my dear Watson\nSecondly, ever since I was little\nNot so much to riddle, least rhyme to the syllable\nKeep tracks that make a Arab thief clap\nWith no hands, I chopped these drums off, truly yours, G Rap\nActual fact, relax\nIn this land of lyrical lost, black, I'm not the cool sleestak\nThe one who might stop and talk to you\nPoisoned a few, niggas who be biting styles I'm like pork too\nOoh, what you got to lose? Let mud fly\nWhen I got blues I chew whole crews that's bud dry\nSo I ask why the styes from the cess\nShit be fucking with my eye as I pull it to the chest\nThe super motherfucking villain grip the mic with an iron hand\nThrowing MCs to the fire from out the frying pan\nIt ain't no use in trying, man, son stop crying\nFronting like you death-defying, you need to stop lying\nSpeak your piece only once you're spoken to first\nNow let me hear your verse while I'm choking you\nWith well refined rhymes like a editor\nThrow them to my collections of skulls and spines like Predator\nFuck around, the only niggas who could hear the same sound (Who?) was Jet Jaguar and James Brown\n(yeah yeah, only them two)\nAin't you glad I took the time to write their names down to big 'em up (True, true)\nI'd like to say, \"Hi, it's Sci.Fly the odd Merlin\"\nThat's quick to whip up a script like Rod Serling\nWho eye on bad bitch who used to whip the Sterling\nWho see God toke but never see God hurlin'\nMy man Grimm had his little monkey like Space Ghost\nMe myself I got flavors that out-taste most\nWith numb gums, some rhymers is lactose\nBack to you MF DOOM, you late show host\nS to the U to the P E R-uh\nWho chronicle these times in a 3D horror\nThriller porno co-starrer in a realer drama\nWho break bread with stingy kin-men, indian borrower\nLone gunman who candidly flip fly flows\nSingle-handedly with one eye closed\nIn a fly pose, no shirt Alayé\nMay see me stack the quarter-mill cash pay\nThat's that n a smash way how he did it\nMotherfucker probably couldn't peep it past a minute\nExquisite scripts, that quick shit, go with flow\nThat's how we do it though", "Ballskin": "[Verse]\nHMMMM\nThe flow is toe in, precision as an afro trim\nAll big letters but isn't no acronym\nSmack the thin grin off a chin for crack smoking\nDDT the first bar, leave this track back broken\nChrome grown man doing business with anglo-sax'n'them\nLacking swing but that banjo's so relaxing\nAs the wax spin, hacking axes in the wind\nPretend it's just a pen, see if you can pencil 'em in\nTense, mention men of honor fenced in\nCensus is tens, the wheels fall off then it's the end\nDon't get keelhauled in\nVillain always been, feel real genuine ballskin\nNot to call the whole crowd out\nIt's just a few chumps, and you know who you are like a shoutout\nPlace 'em in your loud mouth and taste 'em like a pastry\nWaste of space face hastily bow out gracefully\nDisappear, reappear and disappear again\nVillain not his hair, he's no afro-american\nIf that's the case he be a bald-headed African\nTaking all the credit and jetted, astro travelling\nTurn a man into a mannequin for AFLAC'n\nAnd being tough acting Tinactin bluff jacking\nHe wears a mask so when he dogs his face\nEach and every race, could absorb the bass\nIn the place to be, don't believe the hyperbole\nIt's like a murder spree, get sniped verbally\nOr beat in the head with lead pipe languages\nFor street cred leave him for dead in anguishments\nThe slang suggest it was the guy in the glasses\nWho came to help the people with they minds and they asses\nYou set trip and get a grip like Spalding\nThese walls is thin, feel genuine ballskin", "Absolutely": "\"Things take a turn for the worse\"\n\"Send him back where he came from\"\n\"We got shots fired down the street\"\n\n[Doom]\nBa-di-yahhhh\nAlright, steady\nBa-di-yah, ba-di-yah\n\nAbsolute power corrupts absolutely\nIf they get the Villain surrounded then {*AHEM*}\n\nGood to the last drop niglets\nHood 'til the blast pop them bigot-ass piglets\nGo for the bosses' dicks or higher\nBeatwalkers still get caught up in the crossfire\nGet at the sarge, he give the orders\nThe rest of them punks'll quit the force or get slaughtered\nUse stealth, play alleys, jet\nWe'd rather not alert them nosy federalies yet\nKeep the local random cases in each state\nEscape to the beaches for the season and be straight\nYou on call, keep your Nikes on tight, no white\nAnybody tell get lighted on sight\nThe ringer's on a need-to-know basis\nNo persons, places, things and no faces\nGet bagged, you're on your own, acted alone\nBack home your fam'll be provided for while you're gone\nIt's a price on all snitches\nIf you nice bring back eyes, fingers, toes and pictures\nSend copies to those who singin' the blues\nMothers and fathers who's unjustly accused\nOur species is in danger\nWear gloves and strike in a city where you a stranger\nThat'll let them fools know\nAnd send them a message, let them P.O.W.'s go\nAbsolute power corrupts absolutely\nNow you have your orders, do your duty\nA new way to let the shots spray\nA few drops a day, double espresso, D.A. latte\nNo smell nor taste, hardly traceable\nWait to waste a prosecutor paid to get the case pulled\nLearn 'em a lesson for givin' bros mad stretches\nA long list of C.O.'s names and addresses\nA fake judge with many years on the bench\nThat sent some good cats to the chair, was aired in a trench\nThey say her tongue was teared out, smeared and drenched\nThe whole system scared in doubt with a fear stench\nAnd she was tortured, some say post-mortem\nThe suspect took his own life before they caught him\nIt's real spooky like a real trife movie\nRemember the part when Terminator killed Tookie\nAbsolute power corrupts absolutely\nIf they get the Villain surrounded, son, then shit\nShed blood, some'll be shooken\nJust look with they head in the mud, red flood\n\n\"Villain\"\n\n[Outro]\nOne of the things we ran into the unknown\nWe we couldn't get at the door pulled as quick as we wanted to\nAnd once we did, finally pull the door and breach the interior door\nThere's a man trapped inside of it\nBasically that man trap is a cage\n'Fore we run in, we're stuck in there and they can shoot us\nWhile we're just, we're stuck in a cage", "Untitled A.K.A. Change the Beat (Bonus Track)": "[Part I]\n\n[Intro: Samples]\n\"And so—Viktor Vaughn hid from the world—\"\n\"A fascinating story, but it changes nothing.\"\n\n[Interlude: Thunderstorm]\n\n[Outro]\nOh, oooh\nNah, dude—change that beat\nThat's a'ight, but—the other shit—other shit was iller\n\n[Part II]\n\n[Intro]\nWord, word\nYeah, that shit is dope right there\n\n[Verse 1]\nA modern day marvel, but terrible—better—horrible\nWhen he grab the mic from son, he crushed up all his metacarpals\nHe said he ain't mean it—totally by accident\nAfter the show, he didn't follow where y'all taxi went\nWill this be available on wax? Ask Max Mill\nThey on the opposition to his ass-wack tax bill\nBut will it pass the senate? Slum lord tenant\nAnd super like 1-A, have a fun stay\nOne day, he plan to put in a runway\nWith enough land for his own projects and gun play\nSection 8 penthouse, maid look like Faye Dunaway\nAlotta y'all ass out like gay runaways\nIt's how they say \"semi-risque\"\nAll day everyday, give out Emmy's the quick way\nHave the average MC say, \"Gimme a sick day!\"\nThey really ain't got shit to say like Timmy McVeigh\nGet a hunch, a real rag tag bunch\nIn school, he kept a doo-rag in his bag lunch\nJust to eat heads on some breakdance shit and spit\nHe writ this skit in Sanskrit\nIf the pants fit, sport 'em, but rock 'em low\nYour man like Rollo on the slow, can't knock it though\nIt's like the same hustle, bro, two knuckles glow\nTucked-in Le Tigre—just let the name-buckle show\n\n[Part III]\n\n[Verse 2]\nGood googly moogly—see that loogie?\nYeah—but keep it on the D.L. Hughley\nYou don't watch her, he might house her like Doogie\nJust to cut her loosie like, *swoosh*—Mitsurugi\nGooey gum drops—who he got his style from?\n—his pops—you gotta give the bum some props\nAsk ya sister—her beat box is more-thicker\nDOOM that nigga detox with more liquor\n\n[Part IV]\n\n[Verse 3]\nVillain for hire—admire the sound\nMake sure the price is right before he come on down!\nRappers be on some \"You, you, you!\"\nForgot who they talking too, too much pork stew\nThey need to not come out with nothing new\nBlew the whole shit up on some \"What this button do?\"\nDoom cheat the game like walk-thru\nRun 'em, son 'em like Mr. Rourke do Tattoo\nThe way alotta clowns get down is unnatural\nThis flow flip like oranges, apples\nRhymes like limes to a Lemonade Snapple\nLeave her at the chapel, don't eat scrapple\nFirst thing they notice when they come to is they bling is gone\nThen they start remembering the Klingon with the rings on\nIn came the Villain with their own gear like, \"Hi, there\nY'all play the rear, this whole year—my year.\"\nMetal face beard like Brillo pad\nY'all know his steelo so don't feel so bad\nSeed call him, \"Ol' dad,\" the one the ol' ho had\nKnew he was a winner since a swimmer in the gonads\nOkay pal, pay him like Paypal\nSo we could be A-OK not OK Corral\nI think today I'll make the ladies say, \"Ow\"\nAnd maybe fuck around take a bow, now\n\n[Part V]\n\n[Verse 4]\nWho made his first mill and still carry razor blades\nUsed to be straight A's and still made the grade\n'Tarded ass, how he get cash so fast?\nYear after last, left back in the retarded class\nShoulda went to Boces\nWatch him all closely, who he think he supposed to be\nVillain who always win, at least he stay consistent\nFind out where that bitch went, get a room, pitch a tent\nYo—yo, Max—yo, change the beat, yo\nYou got another one?\n\n[Part VI]\n\n[Outro]\nNah, yo", "Who You Think I Am?": "[Produced by MF DOOM]\n\n[Intro: Megalon]\nWho you think I am, but who you want me to be?\n\n[Verse 1: King Ceasar]\nWhen I rock, jock niggas in shellshock\nDon't watch the birdie watch the clock go tick tock\nI rip shop, I make ya girls bottom lip drop\nYo word to the truckers at the pit stop I'm hip hop\nI hold heat, never forget what niggas told me, they showed me\nOther emcees trying to fold, me they owe me\nYo, plus them niggas mad slow G\nI got my \"Get U Now,\" so I'm comin with my homie\nHere's the plan; stick 'em up, I enter, through the window\nStoop down so we can't see our crescendo\nPass the indo, yo we used to be our friend though\nYeah but thats the reason I don't really like to lend dough\n\n[Verse 2: Rodan]\nFrom the corners cylindrical triangle hats\nSays dunce. Lyrics precise like forensical science leave you entangled for months\nTryin' to figure who done it, you fronted\nGot cha shit stunted, didn't have to be that way\nSome saw the light comin' in, they shunned it\nFor the wickedness to those whose despise life and worship death\nThe established matched at eye for eye, tooth for tooth, breath to breath\nThese are the last days of the countdown, shit is just that drastic\nWrite journals, like they use the prophets, study math like a Aztec\n\n[Verse 3: Megalon]\nLoved not for who you think I am, but who you want me to be\nA true thuggin emcee, true thugs, with no strings attached\nI wanna give you my slugs and don't wanna take em\nBox sprays, but with my box cutter in my boxes\nShots sprayed, who on cops high says we rastas\nRock away boulevard, got love and obnoxious\nBout five cops today, my rock away\nNiggas and rock rage, got paid\nA rock, you know why I rock, meet me at the Lobster's\nI suggest I should dress proper\nCopped a buzz, I copped a dutch\nI got a lotta love, with no strings attached\n\n[Verse 4: Kamackeris]\nRhymes, rhymes, rhymes, we got plenty\nDimes, dimes, dimes, too many\nSparked up and chat, you keep countin\nI do my thing, jealous niggas keep doubtin\nRock 'n' roll, lock 'n' load\nEmcees out for pots of gold, we stop 'em cold\nIn they tracks an take all they chips-eses\nAll they dats, all they bullshit mixeses\nGive 'em a credit, not debt it\nWe just flipped the calistetic\nToss the Andy Pettitte, you said it\nWe grandslam in the never boss stand\nAny pussy emcee's we abandon\n\n[Verse 5: King Geedorah]\nFlew in from Monster Island just to rag shit wit jet lag\nWith brothers specializin ways how us not to get bagged\nEgads! I bring confusion like roll call\nTo emcees so-called, hoes be like \"yup I told y'all\"\nSo socialize my bio so I dip dip dive\nMemorize like I-omega zip drive\nGo to the bar to drink to get soberer\nKing Ghidra eat the head of a king cobra like ginkoba\n\n[Verse 6: Kong]\nKong get a cut like Kobe, now hold heat\nSo sweet, roll deep but no beef\nThose that doze deep, close sheets\nPo chose to speak with, reach over to reload the piece\nSlip from freak to deak, keep concrete\nParallel to body til the next male\nShotties and hotty, still waitin to exhale\nSmell the blood bath a slug's caught\nSlugs passed and bloodsport\nBugged laugh, a bugged thought\nCaught some eyes make the case last stack a locker\nBocker, drink a vodka, hit note, like Sinatra at a opera\nDrop a flocker, Orville Redenbacher\nGet you, got you, shot the two L's without the proper\nFor the albums knocker\nHit the liquor, quicker than a quicker picker upper\nGirl and stick er, I leave more nuts than a snicker\nKick er to the curb, punk a bitch, stomp a chick\nFor now call me Kong, Monster Isle, Monster Click (Bow!)\n\n[Outro: Megalon]\nLoved not for who you think I am, but who you want me to be\nTrue thuggin emcee, true thugs, with no strings attached\nI wanna give you my slugs, and don't wanna take 'em back", "Microwave Mayo": "[Verse]\nChain-smoking beedies 'til his brain's broken completely\nGet back on his feet, work out and eat some Wheaties\nGreedy for the cheese, please, most couldn't fathom\nHad him in the cobra clutch when he spat the mad hymn\nGems, collection of *brrrrrrat*'s, Timbs and hats\nHad no time for the pitty-pat, I'll give him that\nThe rhythm hit him back with a right hook\nShook it off, caught a shiner, thought it was an aight look\nDepends on the shades, the end of days fades\nPretenders lay in dazes on stages, Du-malaise\nEat it up, microphone, microwave mayonnaise\nHis own way was strange but it matters not\nTuned into a frequency tone that shattered rock\nHold it down like Shatner do Spock\nRapper jocks need to put a sock their chatterbox\nThe block got light of Vioxx stock\nFolks gather round, it's no joke like \"Knock, knock\"\nIt's them, they came home to roost y'all\nAnd watch 'em transform the game to the rules of foosball\nShe's too small, any questions?\nHim could squeeze blood from a penny in the recession\nKeep guessing, it gets deeper than depression\nThe power of suggestion wake a sleeper, peep the lesson\nDig that beat\nRipped it with Metal Fingers and stomped it with big fat feet\nAnd you know what they say, cut the hay\nResistance is futile, you will be assimilated\nBut today it's all grey metallic with a ruby stone\nRude like the type of dude you could write a movie on\nHardcore porn, did his own stunts\nWrit his own rhymes and split his own blunts\nOnce in a while, every other minute\nEyes pop out, Popeye, heavy on the spinach\nSteady on his business and ready with an ill pitch\nKeeps a bad bilznitch like Denny Kucimilznitch\nNo hitch, just a shit-load of spit and sneeze\nStrictly G stacking up off a rack of hidden fees\nRap is like the gay club strip tease\nWith hippies on the yip saying \"Hey bub, grip these\"\nThey screaming for attention\nBeaming at the mention of a scary demon convention\nYou could cut the tension with a switchblade\nAnd serve it on the same plate of hors d'oeuvres a witch made\nFilleted, persuaded the chambermaid\nTo bet her paycheck on a get-naked game of spades\nStraight up, no chaser, no layaways\nCaution, faint taste of microwave mayonnaise\n\n\"Doom has taken over every continent\"", "Angelz": "[Intro: Ghostface Killah]\nYea, that's right\nIt's not a Hardy Boy mystery neither\nThis is real shit\nThis shit come on right after Hart to Hart y'all\nNo doubt, 7 o'clock Fantasy Island\nThis episode is \"Death to a Brooklyn Man\"\nThis is Tony's Angels\n\n[Verse 1: Ghostface Killah]\nIt was three white bitches who worked for Tony Starks\nUndercover agents, far beyond narcs\nAmazed by their beauty marks, Wonder Woman bracelets\nKnee-high boots that was made by Clarks\nMy dick got hard at how they spoke and shit\nEvery language was music to the kid as if\nI was modern day King Midas, Doreen, Skye and Kelly\nStarky's Angels, Shaolin's finest\nThough it happened in the streets of Brooklyn\nPlus I played the whip real low cause my face was woofin'\nMy Angels jetted out of Albee Square\nGun out, wrap in their hair, kinda crowded so they clap in the air\nChased a nigga down block for block, squeezing Glocks\nThese mommies real angels took one off his top\nHe's a rapist, murderer, convict, burglar\nThe more they ran the more their skirts got dirtier\nSending shots like check day, Fed Ex expressway\nBoom bow bing, you heard the gunplay\n\"Who shot that duck out the window\", Mr. Lee said\n\"Three pay now, you fucking weed head\"\nWe can stop the finest suspect, he's dead\nThen I pulled up, \"Come on girls to Club Med\"\n\n[Interlude: MF DOOM]\nStay tuned for the conclusion\nThree's Company Family Jewels\n\n[Verse 2: MF DOOM]\nTwo brown sisters assisted the Villain, DOOM\nHe woke up stoked like they was still in the room\nFreed his right arm and leg, it was more like a sweep\nRelease his other leg, arm, head and rose to his feet\nStaggering except for the socks and mask, naked\nThrew on the boxers, searching for the Treo\nCheckin' for the keys, the dough\nA robbery expected, yet nothing obvious is missing\nRecollected now why Hollywood hotties stepped in Giuseppe Zanotti's\nPersonnel nurses, Chanel purses, CLK shottie\nChasing Patrice with Thai iced teas\nShe drive while nice to veggie fried rice spicy\nTold them both, I don't feel so well, my belly\nSpin me down Melrose, drive me to the telly\nY'all go head and get the dutches, be back copy\nFeeling woozy, no uzi, who's he see in the lobby\nPeace, Peace, pizza man, change a hundred, stopped and looked\nWhoops, left the knot in her pocket book\nWasn't the juks but too careless fearless\nGot to the room and fell flat out on the terrace\nThe question remains who bound and gagged him\nThat's when they found the empty pack of black Magnum\nVillains skied a gram on the street, fifty G\nThe part of Mr. Roper was played by Mr. T", "The M.I.C.": "[Hook: Pebbles the Invisible Girl]\nFeel the magnetism between us (The mic)\nGrowing stronger and stronger (The mic)\nWhy don't we do it? (The mic)\n\n[MF Doom]\nI was in a case out of state\nShe was thirteen and good, we had a hotter date\nIt was just a number, she never told she was knocked up\nBy the end of the summer chick almost had me locked up\nMy aunt came and got me, and steadied the block\nWe bounced to the yeti, and I'm ready to rock\nWith no attachments, feelin a little loose\nBlowin up in every spot, we had a little juice\nProbably the Dom or the Afghani bud in me\nWe played the stage standin by the speaker and suddenly...\nWho tapped me? I'm bout to get real ill\nAlready ripped the whole club with Metal Face's steel wheel\nWhat a sweet surprise her with the fly eyes\nAnd fine, she pulled me to the sidelines\nThe mystery shot up with strong words\nShe was an intelligent wisdom and a songbird\nI met her last week at the same place\nShe stepped to me, the same way at a no shame pace\nI'm off guard, her game had me choked up\nCheckin me, play testin me, till I spoked up\nSeven whole days and nights and not a word from you (not a word)\nI was worried, I thought I woulda heard from\nStranger, you know I never get enough of you\nHow you be comin through...\nMyself and two a alikes had ran through this crew of three\nIn my earlier days they showed me things new to me\nSo we knew mad brothers who they had hit off\nThey even used to watch each other just to rock they shit off\nWhen slovenly two smile and I'm scopin her\nSwitchin off three times a night made them more opener\nSo you could love Allah, or leave him the hell alone\nMessage from my godfather, solid gold telephone\nMany of my men went up in smoke\nWhile trickin with these chickens, and ended up broke\nYou find out who's ya mans when you broke\nLike a bad joke, it's funny, when you on you got mad folk\nI played the middle man in every little scam\nSome as complex as a hip hop album riddle jam\nI find it's quite intriguing as I think about rappers\nWalk upon me speaking with they stinkin mouth (About what?)\nAbout this and that from sneakers to hats to gats\nFreak chicks with the cooty cat raps\nAnd it's that cool the dice at that\nI'm at a black tie affair with a diva with the fatty fat\nI play the back, steady on the humble\nBut be right up front when we get ready to rumble\nI gave her breath control, ask her who she learned off\nCoulda took her back to the crib, somehow was turned off\nMe and you... was overdue\nFrom gettin together baby\nI always knew our love was meant to be\n\nFeel the magnetism between us (The Mic)\nGrowing stronger and stronger (The Mic)\nWhy don't we do it", "More Rhymin’": "[Verse]\nMore rhymin', pure diamond, tore hymen, poor timing\nRaw lining, Paul Simon touring, I'm in\nBoring typing, snoring pipe when hyper than four hype men\nExcited writing, trifling times ten\nLong stay, songs play, gone haywire, wrong way\nOn the interstate, integrate all day\nIt's just a small phase, that's what them all say\nThen fall prey in a mini-mall hallway\nMeant to be sold, not told to friendly enemies\nRemember these intentionally, empathy please\nSilent moment, violent prone atonement\nMiles a minute on a microphone, own rent, loan spent\nNo debt, has bet, fast get, cash jet\nMaster McSmash, Asterix stashed it last\nNot least, pass the pot of hot grease\nGeese shot, not easily spotted plot, cease snot release\nHold your insulting tongue and mark his words well\nOr end up to the curb and shocked by third rail\nGet the message by bird mail or turds flail\nVillain man, best nerd male you heard wail\nAn absurd tale of books, nooks and crannies\nBefore she look, he have his fancy hooks in them granny panties\nOr plan B, when in Rome go back home\nAnd get real dome from a well-known crack gnome\nHe talk to himself when he need someone to hate on\nThe black-McCain campaign, negative debate-a-thon\nGone wrong on the song, who's zooming who?\nKnew it was you DOOM all along\nEver since he first started the art, it's been worth it\nSoon to charter a stint on part of the Chitlin' Circuit\nWord kid, get your ticket from the telepath\n\"Wicked, wicked, wicked\" on electroencephalograph\n\n[Outro]\nVillain, nice to meet you\n{​​*snore*}​​ You born like this?", "Operation: Greenbacks": "[Produced by MF DOOM]\n\n[Hook]\nM-O-N-E-Y\nNever did a thing for L-O-V-I-N\nNever understand what people's heads are in\nAsk me what I need\n\n[King Ghidra]\nA fly tramp, that's what she called me\nCause I don't wear no Stetson hats like Paul C\nAs y'all see, who give a fuck? Who know what is it?\nThese styles will be flipped to the absolute exquisite\nIt's like a blizzard, soon as I got home from ATL\nLooked into my baby's face, my boo was like ... \"Well!\nI know your types of clientele! Thoughts, needs\"\nAs I held her firmly, yet gentle as the soft sea\nShe said, \"The one with the horse weave? The pretty one?\nAll crazy, had to touch the tattoo through the short sleeve\nWhich one you want?\" I'm like, \"If there was comp?\nFuck around, a nigga like me probably run up in all three!\"\nKing Geedorah what they call me, either caesar or baldy\nProbably have moved since last y'all saw me\nOn the D-low, I slaughter solo emcees, they paper-thin\nIn they Polo, Nautica, or DK men\n\nAmen! It's funny how significance make a difference\nNotice parables of three in every other inference\nFor instance: \"Who wanna battle? On the real?\nChoose your weapon: microphone, beats, or the wheels-of-steel\"\nI own a crown in all three for getting down without a doubt\nI'd like to give a extra special out to Jet Jaguar, the sun, moon and star\nThe Monster Island Czars - y'all know who you are\nGet that!\n\n[Hook]\nM-O-N-E-Y\nNever did a thing for L-O-V-I-N\n\n[Megalon]\nComing straight from the black lungs\nI rip tracks for all players that pack guns\nStack ones in packs, done and doing back-to-back runs\nTo my peeps that close, so's ya' knows what's up\nY'all know the dough's quick, hoes that mess with 5-O shrimp like, \"What?\"\nLike they wanna shmoosh us, just to packing the pushers\nI'm packing gat then bust a cap at po-po\nIf they catch us and try to push us\nSince when a MINY nigga don't be taking no shit?\nI be that drug dealing nigga that be fucking ya' bitch!\n\n[King Ghidra]\nWhat a fella! Like Salt, Pepa, Spinderella\nI came to spark the deaf, dumb and blind like Helen Keller\nIf I'm not with George of the Jungle, if he not with Stella\nOr either Priscilla, I'm doing dips on Godzilla\nThough y'all know he don't play, right?\nTNT throws a nigga out a moving van in broad daylight\nAnd he was shackled by hands and feet\nThen they say he tried to escape, once his face scraped the concrete\nNear the curb on Monster Island, 103 Street\nWhere brothers run the risk of getting swallowed once the Beast eat\nI'd rather lay in the cut, collect cash pay\nOnly TNT I see is Gilligan's castaway\nWith Mary Jane and Ginger\nOh, from which you spent the night by accident, I creep like a ninja\nWhen the mack is bent, who can give one fuck?\nGet bucked, get broke up like three-piece nun-chucks\nY'all sun struck, sick to they head-piece\nThree-headed beast brings the drama to a dead cease\n\n(Get that money, god)\n\nSick to they head-piece\n(Get that money, god)\n\n(Get that money, god)\n\n(Get that money, god)\n\nGreenbacks ... the meanest green stacks\n\n[Hook]\nM-O-N-E-Y\nNever did a thing for L-O-V-I-N\nNever\nAsk me what I need, I need your\nM-O-N-E-Y", "Lightworks": "[Intro]\nWhat is the magic that makes one's eyes\nSparkle and gleam, light up the skies\nThe name of the game is lightworks\n\nI see you're peein' in your pants little sissy boy\n\n[DOOM]\nJerks...\nWelcome to the Octagon\nLay a player flat before the trainer felt his clock was on\nKeep your socks torn, it's a box-a-thon\nWith hard rock Black, Rock & Ron's goin' Barbizon\nCurled up beggin, layin on the canvas\nInstead of in the ready position like praying mantis\nScissors, Lanvis, grand fist sandwich, stance switch\nSlammed on, stitches twitch, hands itch, damn snitch\nAny street corner could be the platform till we defeat gone and wander\nWatch your mouth jaw, southpaw, outs floor\nDoubt your clout more, bout roar, outscore boy\nOff the leash like UFC\nOff the beat, off ya feet like two lefties\nFUB's, heffer please, lost a few to stew beef\nNew referees, what a remarkable team, show your teeth\n\n[Hook]\nThe shine that sparkles and gleams\nLight up the signs the name of the game is the lightworks\nLight up the spliffs the name of the game is lightworks\n\nWipe off slight smirks\nThe match was mapped out\nGet jabbed and crap-slapped out, tapped out\nEither the lunch bin or choke hold time\nMunchkins get punched in like vocal rhyme\n\n[Hook]\nThe shine that sparkles and gleams\nLight up the signs the name of the game is the lightworks\n\nLight up the spliffs the name of the game is lightworks\n\n[Outro]\nThe right hurts", "I Hear Voices Pt.1": "To my Metal Face bros with stomachs of cast iron\nWho been in to win and blast to the last siren\nOn the slow-mo the calm artist with the so-so chick\nChased them all like how he did to Slobodan Milosevic\nAnyhoo, how 'bout them Yankees?\nOnce I leave off-stage the party people thanks mee's\nIf I may speak freely nasty like the freaky-deeky\nAt your local sleazy speakeasy\nFor any fan of the limelight\nIn the mic stand was left a lit stick of dynamite\nIt's risky business like hand-to-hand crack sale\nWith rappers who's better off on the cover of Black Tail\nJumpin Jehoshaphat, who's that?\nWho cats who do magic like \"Tell me how you do's that\"\nHeck no, especially those who cop pleas like gecko\nThought I might do techno\nHa ha, betcha bust out laughing at the vet\nFor no reason he get cussed out like Tourette's\nYet tight flow to make her bad ass stutter\nOr even crack a smile from a mad fast cutter\nBut uh... word play since third grade age\nBack when we used to play \"Bang! Open bird cage\"\nHip hop Benny Hill, Sip Henny straight\nGet every penny, wait, then he chill, at any rate\nMy metal face hoes with tongue or 'least eye ring\nDo yourself, I will continue to do my thing\nLike Kung-Fu fighting everybody was biting\nThen the super-villain struck again like lightning\nIn the same spot (bzzz!) now what's the chance of that?\nAnd a name drop like pick the name out the hat\nThat's a known drop from the, liver conniver\nWho vote player out the rap game like Survive while I\nDrop degrees like a nerd cat wheeling ten speed\nSo way back spin your back and then freeze\nWhile I play high-ball, low-ball, to zero\nSo called rhymers, go call Cleo\nWhile I, steal the show like \"thought so, try hikin\"\nSuper-duper stars need Ortho Tri-Cyclen\nSometimes the men, mostly from the women\nI hear voices saying that's the super-villain\n(Uhh, I hear voices)\nMostly from the women, I hear voices... super-villain", "Yessir!": "Live! In stereo\n\n[Intro: Raekwon]\nYessir! This what I wanna hear my nigga, yeah\nYeah yeah\nYou don't even know that's the official word up in the town\nYou heard? Ha ha ha\nGet that swing, yessir! Get it in man\nThat's the official shit kid, mmhmm\nWord up, we gon' take it back to the big park 'n shit\nYeah, when niggas was rhymin hard and comin crazy\nElectrifying and vivid, yo\n\n[Verse: Raekwon]\nI'm like a rabbi, fresh new mag and I'm mad high\nStolen black Jag I brag fly, yeah\nYo a project thug, political gangster, starving Langston Hughes\nThe Jews want the crib when the God dies\nI'm deadly, metaphors'll dog you while I'm in the Forbes\nFirst 500 niggas who raw live\nYo B, the nigga Shallah, he low-key\nBut he O.G., half of his niggas gone or in hidin\nFederallis'll sneak, police, holdin my old piece\nHeard the young policeman died\n58 carats of glass, the Aston—blueberry black\nWhere I keep my ices and knives at\nOne of the force rawest, yo we're British aware\nWho get money shoot dice in his fortress\nMocknecks and stragglers, eightball jackets the hagglers\nOf the rap game, post up surprise\nI want that spot, coolin with the Supervillain team\nAll you other playboys is twats\nNiggas be down for the murder game\nRun in the church, grab the rifle, put one in a nigga frame\nI'm thirsty, hungry like a Somalian\nPolly with them niggas with the waves in they dome like tsunami\nAll we do is get fresh and fuck ma\nProbably yo' baby ma gave me head in Barney's while I calmly\nAnd I got giants in armies\nWhile we rock mean colored clothes and don divas\nYeah Chef back, some call him Louis Smith\nSlash Lex Diamond and his chick sell crack\nWe rep bananas, beat this, legend of Stan Smith\n700 dollar jeans, keepin your man distance\nYeah son, gimme your ear son\n\nYo yo yo, yo yo get the fuck away from the ropes man\n\n[Outro]\n{*beep beep beep beep beep beep beep beep*}\nDoom, the warning signal again\nSomebody approaches!\n\nWhat manner of creatures are these?\nThere they are again, FIRE!\n\n\"A gunshot from inside the house, forces a change of plans\"\n{*monster roaring*}\n\"A straightforward entry, has turned into what appears to be\"\n\"A barricaded standoff\"\n\n\"POLICE DEPARTMENT! COME TO THE FRONT DOOR!\"\n\"Anything you say, cracker\"\n\nAs the funky beat continues..", "Rap Ambush": "[Intro]\nSo we're gonna stand on perimeter\nWe did have some shots fired right down the street on us\nWhile this was goin on, so we gotta set up a tight perimeter\nWe got the streets blocked off\nTo make sure we don't have any drivebys on us\nOther than that, the operation went, fairly well...\n\n[Verse 1]\nWho told you that? Rolled through, BRRRAT\nOld to the new, knows who holds the hat\nCustom tailored fitted, head stayed same size\nBig since first born, well spitted game wise\nSame guy, same disguise, sick aim eye stare\nAt thick dame thighs, click claim prize\nAnd the lucky contestant was sent\nA whole year's supply of buckets of yucky excrement\nDigital format, provide the ROM\nRide calm, flow was like a roadside bomb\nFlipped the Humvee, impact was limb-numbing\nCameraman wig back, gunner screaming INCOMING\nRPG, rhyme propelled grenade\nTime to yell, scramble for cover in the shade\nBright as the midday sun, then it fade\nDarkness come quick, some run and get sprayed\nRot dead, hot lead, it's rainin\nLeft 'em with they brains kicked in with they trainin\nDragged the remains into the open by the bootstraps\nDogtag attached to explosive human booby traps\nWhere's air support? Ears ringin, mortars whistlin\nBloodshot vision, afterthought: abort mission\nToo little too late, as the last man gush\nTook no prisoners mush, rap ambush\n\n(MURDALIZING SUCKER EMCEES~!)", "Poo Putt Platter": "I tripped a lot out here in the woods lately\n\nThis is a platter of, this makes an, an exceptionally good late night's snack and also a dandy fly swatter\nAh, my eyes are going, I can't hit it\n\nNothing comes between me and my masters\n\n(What is it father?)\nThese footprints were by, by the flying monkey men\n(But they've been restrained in the Valley since we made the pig feet)\nYes, that is what disturbs me\n\nHe'd probably get indigestion\nYou will go\n(I don't think so\nTake them)\n\nThis jungle is dangerous Trapper\nYou will need assistance\n(I know what I'm doing)\n\nYou risked your life for us, thanks\n\nI lost an arm\n(Good)\nStop it father\n(Stand back\nReturn to the house)\nNo\n\nWhat the?\nNow Trapper, perhaps you will listen", "Gumbo": "Gumbo!\n\nYou gotta watch your gums on this\nBut it's, it's very good, it's very healthy\n\n(Not perfect for every situation but edible wrappers could actually beef up your next meal)\nYou would only want to use the wraps when there's no food associated with the use of the wraps\nSo, uh, some potential uses include, um, wrapping bolt packed in a larger package\nAnd in that case, the, the wrap will actually form into a sauce when you cooked, cooked your meats\nUm, there's also been interest in, um, development of using the wrap and then actually rip up the wrap in case you will get weary the next day\n(It's hoped edible wrappers will do a couple of things\nCreate a new demand for produce\nStop throwing out as much garbage as they do\nAnd eat more chitlins)", "Supervillainz": "[Posdnuos/P-Pain]\nWhat rhymes with shillin, villain\nWhat rhymes with shmillain, villain\nHe's a villain..\nYes, he is..\n\n[Kurious] + (Doom)\nSet it off adrenaline rush, the boys way beyond a pen and the dutch\nStronger than hen a bag of the dust, you need to watch how they acting with us\nNow time to get it in gear, get it in right here\nRevenge is better than beer, Yo Doom, it's been a minute think they getting it clear (Yeah!)\nWhen brothers reunite, make sure we party right\nWe rock it all night long even beyond the morning light\nIt's hard to see him in the light, even harder to see him on the mic\nA black Benz beats being on a bike, and he can talk a gay chick outta being a dike\n(New Kurious, y'all) Like that y'all, freak freak y'all (At a store near you)\nTo the beat y'all (Go get it)\n\n[Doom]\nKeep it on click fully auto, I won't stop the rock until pockets thick and gordo\nMore so a risk of sounding poor, bro\nNo tux  who needs tickets to the award show\nNormally cordial, more or less, less is more or no\nHock spit out the cockpit, stuck to the window 'till it's solid as a rock hit\n\n[Posdnuos/P-Pain]\nYes, he is..\n\n[Mobonix]\nHe grabbed the mic like two money bags\nWaiting for the getaway to count what he had\nThought he was a spaz, but dude kept wrecking\nThe crowd remote control, keep 'em all guessing\nFunny man gave 'em nuttin like a bummy dare\nTaught him how to fight wit' a mic and the hottest stab\nBut that's the life of a villain, and you know after that, chilling\nWent places got Gracie don't follow, the big joke ain't no Cola in the Coke bottle\nWriting rhymes till the pen go hollow and been flow hotter than the sunshines of Marrow\nAnd get the villain and scheme, if it's not real life it's still in yo' dreams\nLike that y'all, like that y'all, like that a like that and like that y'all\n\n[Posdnuos/P-Pain]\nWhat rhymes with thrillin, villain..\nWhat rhymes with stealin, villain..\nHe's a villain..\nYes, he is..\n\n[Prince Paul/Filthy Pablo]\n..That's right, I'll smack the black off of ya, punk!\n\n[Slug]\nVillain..\nPushin' on the couch cushion, south side Minneap never lived out in Brooklyn\nKept the faith forget the fame\nIf they sweat the name let it set the lane\nHeld mind, cold and hard, had no regard who the chosen are\nWho, you? Oh no, you played the Oboe, keep it on the low low\nRappers are candy butterscotch, I'mma let their baby mothers watch\nShe loves the ock, I touch the spot\nBitch, I'm the itch, that must've got up her crotch, heh\nNow stop, fill the buildings\nAnd leave some pills for these little villains\nHey shorty, share the flask\nLet me explain why I wear this mask..\n\nVillain!\n\"I want you to call me at that address if I'm still there\nGonna make sure you get cracked!\"", "Fig Leaf Bi-Carbonate": "Well anyway\nYou may be saying about now\n\"How in the world is that old fella eat all of that crazy stuff\nAnd not get sick to his stomach?\"\nHaha, well, don't worry about that\nYou see, whenever I make a pig of myself on the filet\nOr the pudding or something\nI mix up some herbs and\nI come up with a dandy glass of this\nBicarbonate of fig leaf\nThat'll set me free, I'll tell you\nUgh\n\nEdible wrappers may be in grocery stores as soon as months from now\nYou've heard of good to the last drop\nWell your food could soon be good to the last bite\n\nWow! That was loud!\nGot to ya, huh?\n\nHere's an interesting note: artificial colors\nYellows or Reds\nLet's focus on the red\nIn addition to FD&C Red Number 40, the FDA has approved certain food coloring additives, some are actually POISON!\nIf you aren't sure of the additives or colorings in the products you've purchased, LEAVE IT ALONE!\nPOISON!\nBAD NEWS!\nTHAT'S RIGHT!\n\nThank you\nWell, I think that about covers all of the natural foods out here\nNow then, I have to go take my dessert here\nI have to go\nI'm conducting a cooking class today\nGood health to you all!\nUh, over this way\nLook out!\n\nAlright Pops, still feel like charging me for that meal?\n\nOne look at his feature-less face\nOne look was enough to ensure his safety\nAs years passed, he became even more bitter and angry\nBurning with vengeance against the world\nFinally, amidst hidden scrolls, he found what he'd been seeking\nThen, clothed in a suit of invulnerable armor, and possessing the worlds greatest secrets of science and magic, he returned to his homeland\nAnd there he has remained\nScheming, dreaming, planning\nPlotting his mad campaign to conquer the entire world\n(I can't believe it!)\n(Alright, don't make a big deal about it)\nI warn you Doom, you've gone too far\n(Yeah!)\nThat'll do it Doom, get your machine", "Hero vs. Villain (Epilogue)": "[Intro]\n\"And that ended Doom's plans for world destruction!\"\n\"And how did you manage to stop him?\"\n\"Simple, I [..] rearranged the circuits\"\n\"Once he threw the switch\" {*bang*}\n\"My ability to attack is faster than the cobra...\" {*dialogue fades*}\n\"Very helpful.\"\n\"And I will be careful, not to make the same mistakes as Doom!\"\n\n[Verse: E. Mason]\nWhat's the hero, who's the villain?\nDead or livin, killed or killin, who the fuck should remain chillin?\n(Doom) Webster says, wicked and evil, but yo who's Webster?\nNihilation and outcast, equals freedom that's so fast\nCulture in chains, that be the rolls villain plays\nAll these are just metaphors, they describe symbols in folklore\nBut who knows why it's like this?\nHero? Hit or old miss? Maybe it's all good\nReally of God, but who should, determine the real\nEvil, what's the deal\nFools rush in, they don't know the yin, from the yang\nAnd are ashamed to deviate, or act sane\nFrom the norm, they are slaves, forced to conform\nTo really find your essence, take this as a lesson\nBreak away from the rest of them\nGet from the form ending, like the villain in the song\nFind truth, who determines wrong\nFrom right, without a fistfight\nDifferent from day than from night {Operation... Doomsday}\nIt's just a simple play on words\nDelete all these punks ass herbs\nWho's the hero, what's the villain?\nThe question still remains chillin\nListen to the music, try very hard to use it\nOpen up and research, and that's the end of this verse\nBut y'all niggas keep y'all minds open out there\n\n[Outro]\n\"So like fuck you, fuck the newspaper, fuck all that shit man!\"\n\"I'm leavin\" {\"Good evening\"}\n\"Yo why you want to be leaving man?\"\n\"Man don't worry about that sucker, yo man listen\"\n\"Yo I'm not gonna finish my piece man, not with this lady around man\"\n\"Yo what the fuck is this shit man?\"\n\"I don't like that shit man, I don't want no fuckin pictures taken of my shit man\"\n\"Yo relax!\"\n\"Nah man, that shit is fucked up man, that shit can get us busted over here man!\"\n\"Relax man it's for the paper\"\n\"NAH NAH I'm not gonna relax, I'm gettin the fuck out of here\"\n\"Look, we got a car! She's got a car parked right over there man!\"\n\"Let's get the fuck out of here!\"\n\"Well come on let's go then!\"\n\n\"Doom, wears body armor to conceal his own mangled form, right?\" \"Yeah\"\n\"So like fuck you\"\n\"Do yourself a favor.. do yourself.. trust me\"", "The Time We Faced Doom": "[Produced by MF DOOM]\n\n[Phade]\nWhen this reporter babe get here, she gon' be on our tip, man. You know she gon' wanna write about me and my man here, all kind of long articles and stuff.\n[Robot Voice]\nFlash Message Top Secret Ultra\n\n[Union Crew]\nYeah, and when she does, and she puts his picture in the paper, that's gonna be the end, secret exposed, his face, for everyone to see man. That's the wack, you know.\n[Robot Voice]\nEars Only\n\n[Phade]\nYo, man, what the fuck you talkin' 'bout, man? That's gon' get my man big fame, man, cash money too.\n[Robot Voice]\nArrange Temporary Transfer This Agency\n\n[Raymond 'Zoro']\nYo, but what about money? Yeah. If I do this interview, will, you know, will I get paid for it?\n[Robot Voice]\nMetal Face DOOM\n\n[Phade]\nHell yeah, man! You gon' get G's!\n[Robot Voice]\nYour Concurrence In The Above Is Assumed\n\n[Union Crew]\nYo, where do you get your information from? “You’re gonna get paid,” you don’t get paid for an interview and shit, you don't get paid for that. Yeah, he'll come out in it, but he's not gonna get money.\n[Robot Voice]\nNotify MF, KMD, GYP, CM. Effective Immediately\n\n[Raymond 'Zoro']\nYeah, but that's true, what he said, man. I don't, I don't want my pictures in the papers\n\n[Phade]\nLook, man, I know how the publicity machine works. You're gonna get cash money for this. You might not get the money, like, right now, but you gon' have money like Barry White, man! You can do all kind of crazy shit you wanna do when you get this publicity, man.\n[Robot Voice]\nTop Secret Ultra End Of Message\nUm\nHuh\n\n[Otto Von Lenz]\nNow, who will be the first to tell me of a past adventure?\n\n[MF DOOM]\nI ain’t sayin’ nothing\n\n[Reed]\nWhy don’t you tell him about the time we faced Doom?\n\n[Sue]\nAlright. Well as I remember, Doom had threatened the world leaders with destruction of every major city on earth. *Telephone Rings*\nHeadquarters\n\n[Dr. Doom]\nGood evening\n\n[Sue]\nWould you believe it? It’s Doom on the phone!\n\n[Reed]\nWhat’s on your evil mind?\n\n[Dr. Doom]\nHold your insulting tongue and mark my words well. I have plotted my revenge on you. Now I shall have it! Bid farewell to your friends!\n\n[Reed]\nDoom hates us all, but in his warped mind, he has a personal score to settle with me\n\n[Robot Voice]\nOperation Doomsday", "Fillet-O-Rapper": "Whenever I'm expecting a lot of company\nHaven't had a lot of company in a long time\nBut if I were expecting some\nI'd whip up a really (ugh) substantial meal\nYou see how strong I am? (heh)\nIt's from eating all this stuff\n\nGood healthy meal like the...fillet\n\nNow that's what they call...soul food\nNow you got black-eyed peas\nCarrot greens\nCollard greens\nCornbread\nWatermelon\nAnd for dessert\nPork butts\n\nEat heartily gentlemen\n\nI got a really stressful day and I really really needed some food\nSomething healthy like beets\n\nShowed you how good it is\nWell you may say \"I don't think I'd care for that\"\nSo you could also fix yourself a...", "Trap Door": "[MF Doom]\nHe moves the crowd like a cursor on zoom\nNo curse words, DOOM the worst church nerd verse heard\nAppeared blurred to a million true believers\nHe's the supervillain arm dealer to the divas\nCatch, amongst other world scandals\nButter pearl handles to match your girl's sandals\nPlan was hatched by a pack of old vandals\nWhose flag was a black and gold patch with bloody anvils\n\"Hit 'Em to the Head\" was the motto\nAnd one more time to make sure them dead, BLAKKO\nWhen you throw blows in a knife fight, Paco\nThat's how it goes in this Modern Life like Rocko\nClock dough 24-7 cycle\nWhen it comes to flows he got more than a mic full\nPull a broad like a dyke bull on a long bid\nYou're messin with the wrong kids Michael\n... it ain't Jack-son\nFor him to flip scripts like camera, action\nVillain! Raw by the laws of attraction\nFor future generation's information - the black one\n... Move the crowd like a buddha cloud\nThe purple, puff puff pass 'round the circle\nA jerk well renowned for his work skill\nHe's out, the proof is the computer's down Urkel\nMC a show via wi-fi\nAnd paid way before we wrap it up like tie-dye\nHip-Hop sci-fi you can see\nHe had the eye of the tiger through the mask like the Fry Guy\nJust made a baby Olmec dome check\nLeft some folks' ancestors home wreck\nWith blown backs these lesser known facts thwart evil\nIt got no reason, like short people\nNo offense, his feet was burnt brass\nWhenever he walked on the street it turned glass\nOn his lucky rat's paw in the crap drawer\nAll the world's a stage, where's the trap door, slackjaw\nLogic, to keep your mind in the project\nDrop the check, his job is to chop necks\nThat's just payback for noses there's no psych though\nWhat they don't know like Bo\nWon't hurt Diddley squat\nGot to be kiddin me, not\nSeriously plot, to put a hit out on a G-spot\nGypped like Egypt out their kettles and they teapot", "Still Dope": "[Verse 1]\nI'm still dope even if the bag ain't Coach\nEven if I don't smoke till the hydro roach\nI'm still dope, rock a thrift store coat\nAnd a fresh pair of moccasins\nComfortable for walkin' in\nNo A&R marketin'\nThis is my reality\nStill dope, power walk, burning off the calories\nFact and not fallacy, Metal Face family\nImminent fatality, taking us too casually, I--\nGot it, it's cool, just\nPart of the school, and I'm\nAcing the lesson, it's time, so quit stressin'\n\n[Bridge]\nStill dope, vibrant, natural game:\nNo ring, no chain, still bringin' the pain\nStill dope, got no choice but to cope\nListen, take notes, I'm showin' you the ropes\nStill dope, very high dosage\nMy approach is lights out, \"Buenos noches.\"\n\n[Verse 2]\nHold my glasses so I can get Riddick\nSend 'em home tail tucked, holdin' they fitteds\nCold as a Guinness--\"One pint miss!\"\nYo Chill, watch the table a fish might flip!\nCrack jokes spit--\nPop mad shit--\nThat's what it's made for, cop that quick\n\"Drop that, vic!\" Butterfingers, oopsie\nSigned away your publishing for Jordans and a loosie?\nThe old one-two, see; solo not groupie\nAll over they ass like sweats by Juicy\nCats is puss like Sagwa and Morris\nStay spittin' lines, there is no chorus\nDeploying the troublesome, sleep in bubblegum:\nThat's a double dumb, hum if you feel where I'm comin' from\nDo it till ya lips are numb, you gotta go for it\nI stay moving forward; I'm baby bear porridge\n\n[Verse 3]\nKnick-nack paddywack, fuck ya'll critics\nThis dime on the grind when it come to the spinach\nConquered the Id, Vicious like Sid flow\nNot a nympho, IMpress Official!\nShe rock mikes; you wait to exhale\nShe rock shows like DMC rock Cazals\nShe rock shells, manicured nails\nRock for every belle with a spliff to inhale\nHoldin' she own cone of homegrown shrubbery\nWon't go hungry: the flow too lovely!\nLeavin' grills dented on a SUV rented\nClassic as vintage Impalas that's all tinted\nRaw bidness: like how them wifeys get hitted\nAuthentic, the track is so love, I'm all in it\nAww quit it, of course I'm inclined to shine, did-ick\nLine for line wit it, climbin' infinite\n\n[Verse 4]\n¿Tu no sabe? Yo soy una bien mala madre\nConfident aren't we? Playin' it smartly\nWord to Dios, Estrella is lethal\nFlow muy frio, roll the dice chico\nLive crazy decent insanely frequent\nStrangely sleep wit' one eye open not jokin', outspoken\nProvokin' and chokin', ego strokin' is lame\nWord bonder than James, four alarm wit' the flame\nWay ahead of the game, still playing the same\nRoyalty in my veins, it'll always remain\nForever doin' my thing, solo or crew I can hang\nLike ylang and ylang, bring the Yin to the Yang\nThey got placenta for brains, testing my venomous slang\nFools get fitted for bangs and rented for change\nSome people think I'm deranged, others a little bit strange\nJust trying to rattle my cage, cause I'm way outta they range", "I Hear Voices": "[MF Grimm]\nTossing, turning, dreams of murder, someone's killing me\nOf changes, there's nights I'm on a killing spree\nAll done cold blood waking up in cold sweats\nThis is such a cold world unconscious getting death threats\nShadows choking me, my last breath lets out my body\nIt's a conspiracy, my mind and my body's not really down with me\nMe against the whole world? It's a little deeper\nMe against my self, I fight the Grim Reaper\nSwing sickle, I got my Glock bust rounds off\nDemented, schizophrenic, I know this sounds off to you\nI do not lie, when I doze off spirits hope I die, whatever\nAngels waste the time, they work together\nScheme and plot on me, cause I'm the son of man\nI hear voices from a dog like Son of Sam\nDon't give a damn if the bullets fill me\nI don't wanna live, I hope they kill me\nPut me out my misery, I live in misery\nI kill all my enemies, cause I love company\nThose who seek me, are called wise men\nOr either wise-guys I pray you comprehend\nAnd realize I'm condemned\n\nNo rest, homicidal dreams\nMy cellmate, all he do is scream\nOut loud how he wants to go home\nThat's funny, I'm here all alone\nLocked, in a single cell\nHis back's bleeding, he's cold as hell\nAnd I'm hoping, they turn on some heat\nI call the C.O. to bring some extra sheets\n\"Where'd he go?\" he walk through walls, run halls, I pray \"teach me\"\nThey don't see him at the health they try to reach me\nI said \"please see how he feels\"\nThey said, \"He's alright but he's not real\"\nEvaluations say I suffer from depression\nHallucinations, self-creations, what they're guessin'\nI'm here doing years, I'm stressin'\nMedicate me, sedate me want me to rest an'\nDon't take it cause he said that won't be best an'\nHe said I need his help and he needs me\n\"Nigga you walk through walls, go home you're free\"\n\nHome, that was far and he was turned off\nCause his wings was burned off\nA lesson was learned, communicate with one\nI was chosen cause I'm God's son\n\n[MF Doom]\nAnd I'm the retarded one!\n(*sings*) Out in the streets\nYou won't survive with, wack-ass beats (\"We can see that!\")\nThese days and times\nWatch as we get ours with rhymes\n\nTo my Metal Face bros with stomachs of cast-iron\nWho been in to win and blast to the last siren\nOn the slow-mo the calm artist with the so-so chick\nChased them all like how he did to Slobodan Milosovik\nAnyhoo, how 'bout them Yankees?\nOnce I leave off-stage the party people thanks mee's\nIf I may speak freely nasty like the freaky-deeky\nAt your local sleazy speak-easy\nFor any fan of the limelight\nIn the mic stand was left a lit stick of dynamite\nIt's risky business like hand-to-hand crack sale\nWith rappers who's better off on the cover of Black Tail\nJumpin Jehosaphat, who's that?\nWho cats who do magic be like \"tell me how you do's that\"\nHeck no, especially those who cop pleas like gecko\nThought I might do techno\nHa ha, betcha bust out laughing at the bet\nFor no reason he get cussed out like Tourettes\nYet tight flow to make her bad-ass stutter\nOr even crack a smile from a mad fast cutter\nButter, word play since third grade age\nBack when we used to play \"Bang! Open bird cage\"\nHip hop's Benny Hill sip Henny straight, get every penny weighed, then he chill, at any rate\nMy metal-face hoes with tongue or (at) least eye ring\nDo yourself, I will continue to do my thing\nLike Kung-Fu fighting everybody was biting\nAnd the super-villain strike again like lightning\nIn the same spot (bzzz!) now what's the chance of that?\nAnd a name-drop like pick the name out the hat\nThat's a no jiver from the, liver conniver\nWho vote players out the rap game like Survivor while I\nDrop through greens like a nerd cat with intended speech from way back\nAnd spin on your back and then freeze\nWhile I play high-ball, low-ball, to zero\nSo called rhymers, go call Cleo\nWhile I, steal the show like thought-so-try-hiking\nSuper-duper stars need Ortho-TriCylin\nSometimes the men, mostly from the women\nI hear voices saying that's the super-villain\n(Uhh, I hear voices)\nMostly from the women, I hear voices... super-villain", "Bells of Doom": "Who got the most whips gats and cash?\nIf you ask the villain, he say who gives a rats ass\nCan't take it wit'choo you when you breathe ya last\nIn the meanin in between pass that grass\nGive thanks, his rank is that of big stank dank\nHe often'd time drank by the river bank\nAn kept a silver shank, for a calm cat\nAlways stayed strapped for hand to arm combat\nFor DOOM the bell tolls\nLet them fools know ain't no more room in these hell holes\nIt's filled up to the brim wit sold souls\nCrackheads dope fiends an 40's of ol' gold\nHold up, the boldest who ever sold it\nWhoever dare roll up, prepare to get folded\nLike holly hobby, gosh golly gee\nThe back of hector hoskerish's trolly red wash me\nDag nabbit, the mask is like a chick magnet\nSome'll let you stab it for a nic' of the babbit\nThey say he talk slick like Dick Cavett\nA fiend for the mic an can't kick it like a sick habit\nGive him a hero's holla\nAlong wit more free dough than Creflo Dollar\nHoly toledo how he make base on the today show\nThey say he wear a mask in case his face show\nIt's better than a stocking bird brain\nFind him on the corner rockin mockingbird lane\nHe's a odd man grandma\nAnd she's a bad mamma-jamma either squeeze the damn hammer\nOr stop complainin, on the top he's remainin\nA lot of pop sensations need more proper home trainin\nThe people say he's the nicest\nHe only wants to be left alone to his own devices\nIf the price is right he might sing a new smash\nThen laugh an twist his Rollie Fingers moustache\nTear ya crew a new.. gash\nAn prepare a new batch, of his own special herb goulash\nVillain, the dork who talk funny\nAn he'll put one in ya, so watch where you walk money\nLike Semy say, do more boomers, they cure tumors\nAnd beware of the Doomsta", "Hot Guacamole": "[Verse: MC Paul Barman + MF DOOM]\nI'm old school\nThis mic is my ProTool\nI'm three apples high\nI live in a toadstool like a smurf\nEveryone at birth is given x-ray specs\nBut they under-use them to undress the opposite sex\nHoly guacamole!\nLet's get this rap cash\n'Cause art right now is on some slap-dash, flapjack-crap trash\nLeave me here\nSave yourself!\nOkay—pass me your wallet, I'll send help\nMmm—now who drank the last brew?\nThey turned off my cell again\nThe bill was way past due\nGosh, tell a friend\nBut don't let 'em gas you\nIt's all just hogwash\nNow back to the castle\nWhere's that?\nParts unknown\nWhen I'm home the seeds throw darts at the throne\nNo tart taste to the ho cakes\nNo jakes\nAnd first place\nIn the go-cart race goes to—\nNo brakes! Teach peace to the babies\nWe're all the same\nAt least for the ho's sake\nStepped on an undisclosed rake\nCatch a nose-ache...\nY'all flows is fake\nYodle-eh-hee-who wants to be my protege?\nMe—me too!\nSo parrot-back it\nI'm an underlined caret bracket\nGreater than or equal to\nBut greater than four stars\nGreater than straight-A report cards\nGreater than poor sports in divorce courts or sports bars\nWhat's your mission?\nMaking hundreds\nShaking blunders in this self (inaudible) taking on fun-filled until—\nDone—chill\nIt ain't all about the dollar bill\nYou could be dead broke and be a scholar still\nThat's true\nWhat question should I ask you?\nUh—\"What type of ill-type of tricks do the mask do?\"\nOkay; what type of ill-type of ill tricks do the mask do?\nThe face plate remove and I give chicks tattoos\nBut then they can see your face!\nI make 'em look the other way\nI almost caught a case off that same shit the other day\nIn Grady's truck is where I first got lucky\nIn the 80s, now I make the ladies say, \"Yucky!\" like Sandy\nBollocks, that old mustache is bull-snot\nOn your bald spot\nNow that's what I call hot!\n\n[Produced by Prince Paul]", "Hooks is Extra": "He walk around town with a frown like Homey the Clown\nShelltoe Lee crown, well blow me down\nBlow! hell no, he sound funny\nOutta bounds tryin'ta cop a pound with brown money\nKeep the change, peep game, the Range\nInches on the fringes of a deep steepa' strange\nWhen he met a dread at the swine roast\nFind him in the zone up ahead near the sign post\nFollow the beat, you won't stumble\nShut your mouth, swallow your feet, or try'an rumble\nIn discreet they lie and mumble\nCatch 'em in the street they as humble as Bryant Gumble cryin' fumble\nDon't let him get the call\nKeep a stack a diss rhymes, one-size-fits-all\nTries ta' avoid the pitfall\nOr else get hit in the eye with a old dry spitball\nYou must be crazy out ya mind\nEven on the days he feel lazy he shout rhymes\nNo chains, no bridge, does get outshined\nWhen he come blaze it people say it's about time\nThe old God with the old gold gold card\nWhen he's on the road it's no-holds-barred\nNo lard, in the record game on some bull guard\nSo many nekked dames he might blow his whole wad\nHe learn somethin' new everyday\nGo ahead and burn, they ain't nothin' to do anyway\n'cept sell tracks out the Cheverolet like lemonade\nAnd go gold in the hood so he can get ghetto paid\nNow that's usin' the ol' cranium\nLike the jewelry cat who sold him fake plat uranium\nGuaranteed to turn necks green like the Hulk\nHave it manufactured by machine in bulk\nThey rock 'n roll like: 'Stop, Drop . . .'\nAnd if they got soul, then welcome to the sock hop\nHip-be-bop at ya block mom 'n pop shop\nTime it when when it comes to rhymin' is chop-shop\nKeep it lit till the last stroke'a the pen\nAnd ya don't quit like ya quit smokin' again\nThey said he keep his lyrics poked in a tin\nAnd his secret recipe, soak it in some gin\nBrings the heat like a radiator\nStays on beat with the mask like a gladiator\nSword is the mic cord\nAnd he came to turn it out like a dike broad out the psych ward\nI recollect when he first took the sector\nHe use the connect-the-dot styles as a mic checka\nTold him give the deposit, book the lecture\nThe crooked look wrecka, HOOKS IS EXTRA!!!", "Somersault (Danger Mouse Remix)": "[Chorus]\nYou put my feet back on the ground\nDid you know you brought me around [Somersault]\nYou were sweet and you were sound\nYou saved me\n\n[Verse 1]\nShe wondered would it hurt again, a scary new setting\nA Mary Lou Retton perfect 10 -- was it worth it then?\nWould have made the clique switch way back\nFor a quick pitch in the haystack\nWith a bad bitch like Payback with interest\nUsed to keep her nice coo trimless\nFlipped it for a high school gymnast\nShe was thicker than the kick off \"Supersonic\"\nSicker than the bubonic, to Vik it was platonic\nWow, found a new playmate\nAt this late stage in the game he couldn't get the name straight\nTold her \"it was all up in your calf muscle\"\nShowed her how to pull it off, all laugh and tussle\nAt one point she thought he was a lame cat, with game for the rats\nA dog to claim the blame at\nTold her \"Maybe it's your momma fault, for giving you the shaker\"\nSummi-summi-somersault\n\n[Chorus]\nYou put my feet back on the ground\nDid you know you brought me around [Somersault]\nYou were sweet and you were sound\nYou saved me\n\n[Verse 2]\nButterflies at the very mention\nThe flutter of her eyelashes help to clear the tension\nThen went and tripped and fell head over heels\nV, and got dirtier than Red Rover's wheels\nNo matter how high-stake the price\nThis good-luck charm on his arm shake the dice\nIt's gymnastics, practice makes nice\nShe's not the type to be enticed by fake ice\nAah -- the stench of first love\nThe quench of the thirst made it worse\nTruly the burst of upper-thrust motion\nTrust, devotion\nLust is like the sand where the beach meets the ocean\nSoaking, felt joy in the whirlwind\nNever ever did he ever mention boyfriend/girlfriend\nDemanded her respect\nThen ran and did a handspring, almost landed on her neck\n\n[Chorus]\nYou put my feet back on the ground\nDid you know you brought me around [Somersault]\nYou were sweet and you were sound\nYou saved me", "Back in the Days": "[Mister Fantastic]\nIt was back in the days when I met a brilliant student named DOOM\nHello? Anybody home?\nWow, look at that equipment\nI wonder what DOOM is working on\nNow I'll just rearrange a few of these circuits\n\n[Dr. Doom]\nWhat are you doing in my room?\n\n[Mr. Fantastic]\nYou're even more stupid than I thought\n\n[Dr. Doom]\nGive me those papers\n\n[Mr. Fantastic]\nI just came by to say hello\nBut you'd better recheck those equations\nYou're off a few decimals\nAnd that means big trouble if you use this material\n\n[Dr. Doom]\nGet out of here", "The Hands of Doom": "[Dr. Doom]\nI'll have to go ahead with my experiment right now\nLower the dome\nAre you ready, Costez?\n\n[Costez]\nAll set\n\n[Dr. Doom]\nMy moment of triumph is at hand\nContact\n\n[Raymond 'Zoro']\nIt's messed up\n\n[Rose]\nIt doesn't look bad\n\n[Raymond 'Zoro']\nYou're crazy, it looks bad\n\n[Rose]\nOkay, then at least tell me what this thing that you're doing\n\n[Raymond 'Zoro']\nThis figure in the middle, it’s not even coming out right\nI’ve already got like the hands like on the side, like the hands of doom, and they’re like representing the city, and the environment around this artist\nAnd he’s like, like, he’s like by himself in his own world and what not\nHe don’t care about nobody around him, and that’s what the hands are, everybody around him\n\n[Rose]\nYeah, who is this character?\nThat's you\n\n[Raymond 'Zoro']\nWho told, what gave, what gave you that idea?\n\n[Rose]\nC'mon man, I've been knowing, I've knowing for a long time that was you\nNah nah", "Doomsayer (Young Guru Remix)": "In lak'ech planetary kin\nRed overtone dragon make your barathary spin\nIn the flesh with a band of merry men\nInnocent civilians hari kari over yen\nIs it the end or for pretend?\nI can neither condemn, nor defend\nCats, that's more pussy than a sanitary napkin bin\nVillain ran a scam on his imaginary rapping friend\nAgain, shame on us\nWe in the same game, put the blame on Gus\nStudy til your brain vomit\nJust don't be out getting money when it rain comets\nArmpits of funk, a bomb in the hunk a junk trunk\nMetal palm on your ma's badunkadunk\nIn a park in a rave under three days of darkness\nTell a hater behave and spark this\nWith the fresh banana berry blend\nCounting mad tens 'til when January begin\nThe other hand clutched to a pen, 24/7 much to his chagrin\nUsed to drink gin, now he only drink oxygen water\nMixed with shark fins that cleanse the toxins sorta\nAnd if they ever come get me\nWe were sippin rum on a number one jitney\nI can neither confirm nor deny\nOn account of the sherm all high\nVillain make 'em squirm 'til her perm all dry\nSperm to her eye, to a worm to a fly\nIt's germs, and mad babies to kiss\nWon't stop rockin except to maybe take a piss\nOr soak his feet in a mineral oil vat\nHolding a Rodin coil in his tin foil hat\nStep aside, give him some room playa\nTil the end of days he'll be the ill doomsayer (slayer)", "Is He Ill?": "[Hook]\nIs he ill?\nDo he really fit the bill?\nSpit to kill?\nKeep things real?\nKnow the drill?\nThe ledge edge still?\nCatch wreck at will?\n(Repeat x2)\n\n[Verse 1: MF Doom]\nToday's forecast, a slight chance of flurries\nSlightly slim chance that they might dance to worries\nAnd won't know what to say, break to a cutaway\nDOOM like the rain known to come back another day\nLike this day like now-a-day be right there\nLike I, O, A, gimme half a light year\nSame time it take y'all to drink a light beer\nFeel the wrath of his truth just like the cast from Nightmare\nWhoever got the cash, the mic, they both right here\nWhat more can I say? keep your sights clear\nBare facts, triple naked to bare backs\nHe only came to jack rare tracks for your earwax\nOh snap! You hear that? Naw\nDOOM stay way up in the cut like Ma and Pa\nWhen he come out he dumb out, there he go\nThe villain with the illest flow in all of Mexico\nAll foes on some when he leave out let me know\nJust so's I can breath out before I let go\nRappers is like Satchmo that you best know\nInvest in free dough like Matthew Lesko\nFollowed by hailstorms, snow and earthquakes\nGive out more toothaches than first birthday cakes\nThe more we reverse scripts the worse they fate\nTo beat y'all with dimes and dummy Anbesol shake\nNow you got a rhyme tummy ache by mistake\nCan't call it, can't call Jake, call cannonball face\nDig tapes and stay in great shape\nToday's rap game is like one big date rape\nThe name ring bell like ring ding dong\nHe can never be wrong like Ling Ting Tong\nOnce heard a hit song, sounded like an annoying gong\nIt's so wack, I ain't wanna hit the bong\nNow who get iller with the pen than I do?\nAnd in it just to get the benjamin like Netanyahu?\nLet the god bless you like Achoo!\nGet you like whats that on your chest, got you\nPNS beat good for you it's shredded wheat\nAs well as getting shredded by the metal headed lead feet\nSon 'em and dead 'em like a dad that's dead beat\nBeat him like a dead horse, nasty as red meat\nDOOM memorize rhymes and still forgot\nCall it how he see it and kill a shot, like Willard Scott\nIn the place to be like no iller spot\nTo spill a knot, it's like a chilling thriller plot\nStarring the villain as the black Jesus\nIf it ain't the 'gnac or the Jack it's Grey Goose\nStill could stay loose off grape juice regardless\nNevertheless did his best on the retarded test\nIt's trick questions, always kept a cheat sheet\nOn the microphone, a rep up before Beat Street\nAnd beat meat that MF DOOM he stay true\nIf you online check the site and FAQ\n\n[Hook]", "Doom, Are You Awake?": "[Principal]\nDoom, are you awake?\n\n[Dr. Doom]\nYes, but what do you want?\n\n[Principal]\nYou fool, it's a miracle that you didn't kill Costez as well as yourself. So, before you cause greater harm—\n\n[Dr. Doom]\nGet out of here! This is just a minor disappointment. I shall overcome it\n\n[Reed]\nThe failure of DOOM's experiment did not end his tragedy\nFor a few days later, his bandages were removed\n\n[Nurse]\nThere. Aah! How horrible, that face\n\n[Dr. Doom]\nWhat have I done to myself? My face is...hideous! He made me hurry my experiment! Now I must hide my face from all mankind. But he will pay. Oh, how he will pay!\n\n[Reed]\nSo after his face was ruined, he just seemed to disappear\n\n[Commissioner Robbins]\nWhy did DOOM threaten just to—\n\n[Reed]\nWell, like I said he just disappeared. I'll never forgot that day", "Bookhead": "The lust is show the story, grodier than Mr. Crowley\nFor those embarrassed to know holier than Darrell Morley  habits\nParis to the Gobi bring him up to speed slowly\nOn the low key, Kindles is phony D\nTaste stale, see the world in shades of gray-scale\nRight there in black and white, protected by chain-mail\nToday’s the day, made your way see ya sister'n'um\nTook my little mens with her, told em loved em.. kisseded them\nThese over-sensitive youngins' is on some new stuff\nCan't sit still and focus the time it takes to do enough\nFrom the mean streets of the ‘Can I get a dollar dude?’\nAbove measure the singular pleasure of solitude\nIt’s your poison, if you so choose, absorb it\nVeins to the brain, shoot off into orbit\nHow you know octagon? Or much less Tetragrammaton\nTo get the good stuff you gotta get out to the Amazon\nWith any luck you might just score locally\nKeep it on the hush when you speakin' on it vocally\nThen you gotta be on the in, a known member\nI think I still owe 'em lil something since November, whatever\nWho need credit when cash speak? Forget it\nSweatin' sittin on this package since last week\nWe all got weaknesses, even the functionin' dead\nSome’ll end up fudgin' numbers, buggin' and lunchin' instead\nIt’s Netflix to the head, second best trick to get the chicks in the bed", "Supervillain Intro": "Looks like I hit the jackpot! (Supervillain!)\nThat's the best part of all! I'm working for the biggest group of villains this world has ever known! We're led by the man himself! (The Supervillain!) [Yuh!] Doom's got a plan that's gonna shake the heavens...You wanna get tough punk?! Good! Time to get the feta!", "Bumpy’s Message": "[Bumpy Knuckles]\nYo what's up DOOM, This is Bumpy Knuckles\nJust calling to say that I'm proud of the work you been doing dog\nYou know this whole album and all that that you've been working on my dude\nIt's like, it's like a long time coming man for people to get a chance to\nLook into the mind of a villain, you know like somebody who really has\nA serious outlook on their craft, you know there's a lot of clowns out here\nWith you know, painted faces and when they take the paint off\nIt's just a clown with no paint on their face [DOOM laughing]\nSo please understand my dude I'm watching you man and I see what you doing\nIt's the OG man Bumpy Knuckles straight fly, aight?\nMy motto for 2009 is fuck everybody [DOOM laughing], aight?\nSo when you go on stage and you put your middle finger up to the crowd\nAsk them to put it back up\nAnd when they show respect to the villain they should say fuck everybody [DOOM laughing]\nCause that's what everybody's gonna say when they have to show respect for you\nAhh fuck him, fuck him that's the dinkest shit in the world if they write this\nWell fuck you\nCause everybody wanna be what you are\nYou nah'mean? They can't find\nThemselves\nAight, stay focused my dude I appreciate your work\nAight? Soon come: Bumpy Knuckles, MF DOOM— soon come\nPeace", "Notebook 03": "[Verse 1]\nDOOM get rude with the dude off CHiPs\nThe mood switch, he chewed off strips of a Broodwich\nDanger make a groove off a glitch\nMajor boo booty twitch and a crew rich bitch\nAlways wanted to say that\nEver since the days of hallways taunting a stray cat\nThe one he often frequently slapped around\nAll the while waited and graduated cap and gown\nHated the rap sound, debated the crap\nUntil he felt he had it mapped down\nEnough to have the game trapped and bound\nScratched in the crown was the names of lames who yapped a noun\nOr verb for that matter\nHad no data for a herb who chat chatter\nOh, Erik Estrada\nFat rat, the mask made 'em batty as a mad hatter\n\n[Verse 2]\nKnown for his absurd word choices\nAnd will ignore you if you ask him if he heard voices\nLook, the energy is crazy\nFar as he was concerned the enemy was lazy\nAhem, your attention please\nFreeze, he came to seize the free cheese\nBefore he flees to Belize\nIn case he forgot to mention, squeeze these\nJust keep it on a need to know basis\nThey knew he was a negro so no need to show faces\nBack in the days of no laces\nOn a slow pace they used to say he might could go places\nEhh, whatever their case is\nThe card he played was ace of spades, but no races\nA spastic, some called loony\nWhen he spit a tune sarcastic as Paul Mooney", "Impostas": "MF DOOM - “Impostas”\n[Emcee(s): MF DOOM]\n[Producer(s): MF DOOM and Ill Clown]\n[Sample (Melody): Setsuo Yamamoto, Shun Nishigaki, and Tatsuro Suzuki - “Charlie Ending” (0:31)]\n\n[Intro: MF DOOM]\nThe Supervillian versus the gold-digger\nDOOM mild-mannered old nigga\nSupporter for the daily blues\nReporter for the jewel, drop news, pop Israeli tools\n\n[Verse 1: MF DOOM]\nThe world-renowned master of word game\nWho lay low sometime behind iceberg nerd frames\n(Ayyo, MF) They heard the name, but just couldn’t\nQuite place the rep if they retraced they steps\nNext EP, who to give thanks ta?\nHere lies the pranksta who tried to test a gangsta\nThe last thing he saw was a potato\nFrom the lone NATO who hosts his own late show\nKeep a low lab on Monsta Island like Seinfeld\nWhite-wine clientele connected like Mind Meld\nI can tell they sees these styles as too tricky\nThey’re too picky on this microphone doohickey\nMF, Monday through Friday, get money\nSaturday through Sunday, the brown Al Bunday\nWaiting for the shit you’re kicking as the plot thickens\nHe wrote these rhymes in 3-D with red and blue BIC pen\nAnd to the chickens, only hoes who say, “Let me hold ‘em”\nTake him in their mouth while he’s semi-swollen—semicolon\nI told him words would do a nigga brutal\nFor not using his noodle, F up and get bamboozled\nHe was the one to open to her up, blow her brains\nBack, dope her up or rope her to the train tracks\nOr he would choke her ‘til she collapse, steal/steel\nTo poker/poke her with the wood, and tell her, “Be good”\nHe could take a phrase like “Peter Piper picked a pepper”\nAnd put it where he couldn’t peep a sniper, sicker repper\nNigga poppa, stick a chick proper\nDouble-platinum, Oprah, soap-opera watchers, gossipers\nOn top of her\n\n[Bridge: MF DOOM and (Sample)]\n(I keep forgetting) can’t go\nRaw anymore\n(I keep forgetting) rappers is\nImpostas.  Been a show-stopper since a ho-hopper\n\n[Verse 2: MF DOOM]\nNever came second place in a neck-and-neck race\nTo the naked face who wanna battle: bring a neck brace\nWe supply the insult to injury\nWhoever in the industry getting money is too stingy\nViolate, you might as well smoke me, loc\nRelocate, migrate, or get caught with the okey-doke\nIt’s guaranteed it’s your last step, so step to me\nWith the Uzi, watch that first step—it’s a doozy\nTime flies as the hourglass trickles sand\nOne last thing before I blao this popsicle stand:\nA rolling stone, and that’s that.  At home\nOn the microphone like, “That’s where he laid his hat at”\n\n[Outro: MF DOOM and (Sample)]\n(I keep forgetting)\nKeep making dough\n(I keep forgetting)\nMad Flow, MF, Metal Face hoes\n(I keep forgetting)\nFactual stacks at shows\n(I keep forgetting)\nWorldwide, ‘cross the globe, let the beat rock", "Notebook 02 - Doomsayer": "[Produced by The Alchemist]\n\n[Intro: Sample]\n\"Step aside, boy, I'mma check in that cash register.\"\n\n[Verse: MF DOOM + Samples]\nIn lak'ech, planetary kin (\"Step aside, boy...\")\nRed overtone dragon make your barathary spin (V-Villain!)\nIn the flesh with a band of merry men\nInnocent civilians hari kari over yen (\"Uh!\")\nIs it the end or for pretend?\nI can neither condemn, nor defend\nCats that's more pussy than a sanitary napkin bin\nVillain ran a scam on his imaginary rappin' friend (\"Uh!\")\nAgain; shame on us\nWe in the same game, put the blame on Gus\nStudy till your brain vomit\nJust don't be out getting money when it rain comets\nArmpits of funk, a bomb in the hunk-a-junk trunk\nMetal palm on your ma's ba-dunk-a-dunk\nIn a park in a rave under three days of darkness\nTell a hater, \"Behave and spark this\"\nWith the fresh banana berry blend (\"Step aside, boy...\")\nCountin' mad tens than when January begin\nThe other hand clutched to a pen\n24/7—much to his chagrin\nUsed to drink gin, now, he only drink oxygen water\nMixed with shark fins that cleanse the toxins, sorta\nAnd if they ever come get me\nWe were sippin' rum on a number one jitney (Ya wit' me?)\nI can neither confirm nor deny\nOn account of the sherm—all high\nVillain make 'em squirm till her perm all dry\nSperm to her eye, to a worm to a fly\nIt's germs and mad babies to kiss\nWon't stop rockin', 'cept to maybe take a piss\nOr soak his feet in a mineral oil vat (\"Step aside...\")\nHoldin' a Rodin coil in his tin foil hat\nStep aside, give him some room, player (\"Step aside, boy...\")\nTill the end of days he'll be the ill doomsayer\n\n[Outro: Samples]\n\"Step aside, boy, I'mma check in that cash register.\"\n\"Uh!\"\n*Grunting*", "Operation: Doomsday Album Covers": "", "Notebook 04": "[Produced by Astronote]\n\n[Verse 1: Kool Keith]\nBatman and Robin, head bobbin', no Joker Penguin\nYou see him freezin' up like Mr. Freeze, Catwoman on the mind\nThe Batmobile design, Alfred the butler\nDynamic-duo hustlers\nBurn rubber, Gotham City, I'm spinnin' in the gutter\nLeft the Batcave full of computers, the Mad Hatter\nThe realest, see my boss red like Twizzlers\nI'm so hot like Hot Wheels, color shifters\nDiagonal over Gotham City lookin' pretty\nThe caped crusader continue through the stages like a player\nPullin' up on The Joker while he playing poker\nKing Tut hoppin' out the range rover with brolic shoulders\nGreen Hornet and Kato see the Lamborghini doors open\nSame rims on the BM as the Lotus\nDark blocks and they pop like pop rocks\nYour girl on the cock, she jock a lot, the next episode, reload\n\n[Verse 2: MF DOOM]\nCock the swammy back, don't hesitate, react, believe dat\nThey defecate where they eat at\nMore repulsive than the Boars Head logo\nThe trees had em seein' impulses in slow-mo, whoa\nA whole lot of funk, a whole lot of drunk, who knows?\nCould've did a line of bump with Donald Trump\nHe hear voices in his head, he gotta jump\nNot now, too much lactose, gotta dump\nA wise owl, growl with a mean scowl\nA stand up dude even when he seeing foul, meanwhile\nThe world keeps on spinnin'\nIt seems the forces of evil keep on winnin'\nChange of plans, and I'll take that off your hands\nRetreat back to the cave with your mans\nSuper Vill, salute Milk D, top bill\nTop notch or chop meat and chop krill\nIn the mix of trappin' and gun clappin'\nDOOM, 25 years in, son slappin'\nWrote the key to life down on some napkin\nCan't find it, whoever do is like-minded", "Thank Ya": "[Produced by MF DOOM]\n\nVillain!\n\n(Thank you) Thank ya...", "Coffin Nails": "[Produced by MF DOOM]", "Coco Mango": "Listerine green jars, sick cleans, jallad be a enma\nThick queens, mamma mia robs jalapeno peppers\nClick mean large, brick seen mirage is ours\nQuick mean cause, strict deen Allah\nMake your quota, check your clock shock taqwa\nConcoct the potion, blue liner lotion, call it aqua\nTock you on watch, sure ahk, salaat two rak'at\nFour to roll in extorter mode, loose spot too hot\nHere you go ma, for you boo, that's coco mango\nShe let her hang go, her man said \"yo no tango\"\nBangles jangle, no gangs is tranquil\nBlank grill, real shank steel, bankroll ankle\nF to the N and R, two thiefs are bummin a car\nBut never had no beef so Alhamdulillah\nInshallah any duties, top grillers, no Mercedes sign\nBubble nuggets with the ruby, Cop Killer 89\nOn a line on the third like Lupin\nWord is a bond that's honored don, shukran... afwan\nRam the adhan\nLivin sunnah of the Prophet Muhammad alayhi as-salaam", "Arrow Root": "[Instrumental]", "Pennyroyal": "[Instrumental]", "? (Extended Raw Rhymes Version)": "[Kurious]\n131 years savage generation\nOne recipe enough said\nJack Daniels old number 7 B\nQuality, Tenesse, sour mash whiskey\n\n[MF Doom]\nOoh, so many flows\nShit goes, so many ways down and below\n20-10 thousand leagues under the sea\nMotherfuckers never know it was me\nOh, that nigga' flew so many flows\nIt's like so many fly colors on the hoe toes\nGod dammit, motherfucker ruling whole planet\nGimme' two times, cut no shit, nah, fuck it\nI'm coming through kicked the bucket one day\nMotherfuckers never see a nigga parle\nLike, lay in the cut, like, he never knew\nMotherfucker, Super Villain\nAnd who the fuck is you? Ooh\n\n[Kurious]\nOne two, one two\nIn order TO make a jam, kid\nWe gotta' get it back up in the zone\nMad shit the way we be spittin, when we writing shit is on\nI'm fucking it up cause right now\n\n[MF Doom]\nSee Imma be serious my next verse, Imma just be serious (Yeah)\nI be starting to laugh, that's my problem\n\n[Kurious]\nThat's my problem too, my shit sound like on some funny shit\nYou know what's hot? The way we keep talking\nI'm taking off the headphones  to talk you you\nBut it's dope, cause we talkin' and still doin' it to the music\n\n[MF Doom]\nSo wait, then the beat's too loud?\nI keep the beats kinda low, like this and shit\n\n[Kurious]\nNo, nah I don't the levels are fucked up\nOh you mean to keep the tone down?\n\n[MF Doom]\nYeah, yeah, yeah, kinda like riding like right there, right there, be like yo\n(The sound facts on the whole situation is...)\n(Good things...)\n\n[Kurious]\nNope-a nope, nope\n\n[MF DOOM]\nHe cleans his metal mask with gasoline, they after him\nLast seen pulling a chick like a fiend pull a fast one\nCan't put shit past him\nGot niggas on his own team mad enough to blast him\nRetarded in real life, on the mic Rain Man\nStand close to his main man like a chain gang\nWho give a fuck about who or they fancy crew\nThat's no mystery what Hardy Boys do with Nancy Drew\nSorta with her drawers down quarter\nThe extorter bring slaughter like \"Well I oughta\"\nI suggest you hand over the formula doula\nA villain in your land, in his land a ruler\nHard hitting like puffing a woola with Lieutenant Uhura\nEvery day feel like it's an off day with Ferris Bueller\nBrother pull heat to prove they not sweet\nNo matter how you spell it, we still got beats\n\n[Kurious]\nPeople question how we live, question what we give\nTake it to the next leave 'em where they can't see me\nStill they judge, but they be butt ass\nTwist that wig like a muppet, keep it simple, can't truss it\nLight's the fuel, mic is the tool\nDrink Jack, kick back, drop jewel, finish what I start\nMastered the art, living hell can't explain it\nInhale confuse it more, cop the .44\nContemplate, meditate, dictate\nI direct my direct fate, coming of late\nKurious, can I say shit\nDo it for CottleRock, do it for K.Nit\n(RIP)\nK-N-I-T, Sub R-O-C\n(Eternally for M-I-C)\nOnly we save we\n\nYeah, ? (word up)\nAll ya'll punk motherfuckers get schooled\nSlammed on sight\n\n\n[MF DOOM]\nBy candlelight my hand will write these rhymes 'til I'm burnt out\nMostly from experience, shit that I learned about\nTopics and views, generally concerned about\nWith different ways to come up and earn clout\nI take a look at my life and pace the trails\nFrom Tablik and savage females with fake nails to face veils\nYou out your frame but still bagging 'em too\nYou know I know, these hoes be asking me if I'm you\nLike my twin brother, we did everything together\nFrom hundred raka'at salats to copping butter leathers\nRemember when you went and got the dark blue Ballys\nI had all the different color Cazals and Gazelles\nThe \"SUBROC\" three-finger ring with the ruby in the \"O\", ock\nTruly the illest dynamic duo on the whole block\nI keep a flick of you with the machete sword in your hand\nEverything is going according to plan man", "Lavender Buds": "(x3)\nI just lie awake and think of pleasant nights we'd spend\nUnder summers magic spell\nBut when autumn came her love did not remain\nAnd made my world a living hell", "Licorice": "[Instrumental]", "Saffron": "[Instrumental]", "Gazzillion Ear (Thom Yorke Remix)": "Villain man never ran with krills in his hand and\nWon't stop rockin' til he clocked in a gazillion grand\nTillin' the wasteland sands\nRaps on backs of treasure maps stacks to the ceilin' fan\nHe rest when he's ashes\nAsk em after ten miles of his goulashes, smashes stashes\nChip on his shoulder with a slip on holster\nA clip, a folder and his grip on a boulder bolster\nThey supposed ta know. It show when his aura glow\nGet from out the row, when he get dough it's horrible\nTime is money spend way save invest the fess\nFrom ten case of cave with chicken chest S\nYes ya'll the dub will get your trickles\nThe best ballers pitch in to rub and get a nickels\nBut tut tut, he about to change the price again\nIt go up each time, he blow up like hydrogen\nVillain here, have em shrillin' in fear\nAnd won't stop top illin' til he a gazillionaire\nGrillin' stare, yeah ya boy had drama\nGot em on a mental plane, avoided bad karma\nOnce sold a inbred skinhead a nigga joke\nPlus a brand new chrome smokin' with the triggers broke\nI thought I told em \"firing pins was separate\"\nHe find out later when he tries to go an rep it\nTook a Jehovah money for a Arabic Torah\nCharged an advance to translate it and ignored it, sorta\nOne monkey don't stop no slaughter\nA junkie want ta cop a quarter ton, run for the border\nKnow the drill, it ain't worth the overkill\nFlow skill, still there's no thrill\nVilla bill ya 10K bills in his pilla\nVilla, when it gets realer, split the skrilla with...\nDilla, (Dilla) mix, mix, mix\nDo a deal for kicks and get rich quick\nSketch lyric, bet 'cha by the nick on some vic\nIck from the drumstick, come with the dumb shtick\nSick slick, hidden in a book\nThe only way they find it if you're spittin' in a hook\nListen, don't look now, keep walkin'\nTraded three beans for this cow, cheap talkin'\nHawk men stalkin' hear that we hawkin' often\nCoughin to a coffin, might as well scoff the pork then\nHe's like Warf, some say stronger though\nOff the top J strong bow, play along bro\nWear a mask like yo off the Gong Show\nFlow slow as Mongo, Don Juan thong pro\nFor ya info when he's not practicin' Jim Crow\nA actress and some nympho bimbo\nHe's playin' Ray Jay the old tape\nDOOM - well what can I say like JJ in a gold cape\nFill it to the rim like brim\nVillain and ya won't find him in no gym\nProbably a foggy bog with the frogs\nWith a dot on the guard as he squat on log\nHalf cocked and half baked\nUsed to keep a full stock of work half rocked and half shake\nMy mistake, sign a track agreement\nFor more G's than lines and cracks in the cement\nIn any event it's fake like wrestlin'\nGet em like Jake The Snake on mescalines\nAhem, elixir for the dry throat\nTried to hit the high note, Villain since a itsy bitsy zygote\nBy remote, send in the meat wagon\nBraggin' MC's packed in with they feets draggin'\nThese stats are staggerin'\nHad his PHD in indiscreet street hagglin'\nVillain, his agenda is clear\nEndin' this year with dividends to spare, here\nIt's not meant for the seein'\nWent through the celin' after enterin' his center bein'\nA new meanin' to sales through the roof\nGuaranteed raw and saw his truth was truth, proof\nIt's the return of the tramp\nWho do a duet jam when Earnest goes to camp\nFor the right earn - na'mean like Vern\nWe need some more oil for the machines to burn, learn\nJiminy crickets\nOne mans waste is another mans soap\nSons fan base know the brotha man's dope\nA real weirdo with a bug rare flow\nAnd the way his hair grow was ugly as a scarecrow\nHe wears a mask so the charge won't grab\nOn a rooftop with a large stone slab\nHeads up, talk white and thought niggerish\nRefuse to walk tight and got his off the vigorous'h\nBlack licorice and equally as yucky\nHow he handled the money was strictly Dan Stuckie\nMonkey hustle, man on fire\nLater for the date than the Hadron Collider\nAnd cost more, it be singin' like a style\nDOOM leave the competition steamin' like a pile\nSmile, ding! Sparkling jewels\nIn effect like alternate side of the street parkin' rules\nFools, the roach was never dead\nLive for a week, then dehydrate with a severed head\nInstead it was depicted as flicked in\nSplit the wig, slit", "Hydrochloric Acid": "Keep your mind on your mask, kid\nHoller for my classics, it's drastic\nVillain the hydrochloric acid, splashed it\nPull the Nine, reached then he blasted, Pow!\nPin stripes on a basket\nNew York style wild\nCheddar grab easy\nIt's only entertainment though, when thought out completely\nSad demeanor, could get him the drop and bag cleaner\nMaster schemer\nExpert in that arena\nPuffin' Pasadena\nYou read the grass was greener\nBlack beamer\nI8 she gyrate\nRubbing shoulders with pigs don't fly straight\nJust ate, causing indigestion\nWill soon regurgitate, into profits, no question\nNosy agent sniffing around, pay attention\nYou could take that to the bank\n\"Thanks\", don't mention\nPleasure's all mine, ain't mad at y'all\nClear advantage like playing paddle ball on adderall\nBe brief, that is all\nAight, one more rhyme\nSelf-snitching rappers who's lines is pure pork rinds\nIt's yours, it's his, and mine\nYour homework space cubical, smirk face crucible\nSuper luminal, (???), loose pull\nNeed to re-roll that, he sold stat old hat\nAnd Dungarees, new shoes for baby\nFood, clothing and shelter, no if ands or maybes\nMaintain the gravy train, laid claims of slavery\nBad investment banking, the best went blanking\nShitting, stanking\nWitnessing the slang king, hypnotist ranking\nAnd don't quit\nKeep your mind on your mask, kid\nHoller for my classics, it's drastic\nDOOM, hydrochloric acid, splashed it\nPull the Nine, reached then blasted, Pow!", "Notebook 06": "[Intro]\nLooks don't count better off judg—\n\n[Verse 1]\nI wanna, I wanna, I wanna—\nMotherfucker, it's my goddamn honor\nTo eat a sucka MC like a hot lamb döner\nRespect rook check dope blind dialectic\nTook the perspective of open-minded skeptic\nWhere your skeptical's looks don't count\nBetter off judgin' by rhymebooks and sheer amounts\nAnd work backwards from there\nAngle of attack on a track was like a spear through the clear air *tongue-click*\nWhat's your status? It's don status\nReserved for those who chose to go beyond madness\n'Cause we like \"Villain you must be out your taboggin' hoggin it's a horror\"\nEatin' MC's like there's no tomorrow starvin'\nWelcome to the club registration\nWe be waitin' right here collectin' off our nations revelation\nSensations of latter day saints\nImmortalized in black splattered spray paint, Faint\nAin't live and direct and kept his eye on the game\nLike SpyTec\nMic check\nVillain get booted out your online school\nStudent got straight-up A's in divine rule\nQuicker than a sleight of hand like, \"Damn\"\nTelepathy and telekinesis faster than InstaGram\nSee what he said, layin' his wood, get paid is at\nFrom the States to your estate flat, ain't that", "Datura Stramonium": "[Instrumental]", "Mash’s Revenge": "[Intro: MF DOOM]\nHe wants to get his girlfriend? Go get your girlfriend\nAy! And now...you is 'bout to dance, like you ain't never danced before\n\n[Verse 1: MF DOOM]\nThis one'll have you get the trash hash out the stash, as they say, \"Ash to Ash\"\nJewels free rash fools ask the mask\nNeed me? I'll be peeing in the pool, ka-splash\nYou may feel a slight drizzle\nVillain'll give a squealer a candlelight vigil\nCouldn't find a healer with a whistle and a line of sight\nAnd he hold the mic like a fistful of dynamite\nThey wonder how he built his C-note tower\nAll before zero hour it's tree grow power\nThen he go shower to scour off the funk\nAnd watch his soul call comp cower soft punk\nThe god is the oddest fella you'll find\nPaid to speak his mind like father jealous and vine\nHe came to rock the banquet, rank it\nAlong with two of the baddest broads to act stank wit, blank spit\nDilla raise the beat like a anchor banker\nOverstand (?) plays the heat\n'll shank a wanker\nDrank a tank of angst, thank ya\nGuess what? Chicken head butts\nHit a rhyme on time, I kicked him dead in the nuts\nOh, the victim had guts\nPrepare to stick 'em, I'll slick 'em in the cut\nGo. Sell a spear chucker voodoo\nGot it her off wholesale male smug lou spew\nSo. Sell a bear a truck of doodoo\nFoes go to hell in a seersucker muumuu\n\n[Verse 2: Guilty Simpson]\nDoom!\nGuilty!\nDilla, Dilla!\nGrind for the paper, hot like Sanka\nTop notch ranker, clock my banker\nDead Presidents, sick dudes - I'm the medicine\nStorming in your residence when I'm in my element\nNo contest, I get hot and go unconscious - ya boy is automatic\nNow go play in traffic, the flow is graphic\nWith no theatrics, still rock sold out shows for practice\nCall it a walk-through. Def. The wrong one to talk to\nBeef ain't nothin I can't stick a fork through\nWe break bread, eat good, and pour brew\nCheers!\nCome toast to the one with respect to the utmost on more than one coast\nGS, check the style I splash, to make the listener wanna pile my cash\nKing of the Hill, money is the issue\nIt's all on me tell 'em bring me the bill\nDaddy Warbucks, shift gears in the armored truck\nLike Big Daddy Kane when I warm it up\nFans scream for the two man team\nDoom and Guilty - Hip Hop supreme\nThe denim is blue but the pockets green\nBig knots in jeans, you can't stop the kings", "Lemon Grass": "[Instrumental]", "Checkmate": "[Intro]\nIn the year of 1994\nA motherfucking earthquake just hit New York\nYou know what I'm saying\nEarthquake is here\nStraight up\n\n[Verse 1:Earthquake]\nI'm wrecking niggas like pencils on a piece of white paper\nWhen I fuck up I can just use my eraser\nDeck em, rub em' out and have much clout\nLike Damon Wayans Bruce Willis on the Last Boy Scout\nMy pockets rollin' thick like a milkshake\nI overflow the party cuz that shit says earthquake\nI get on stage, start to rake em, I bake em\nI use A-1 sauce and eat that nigga like steak-um\nEarthquake is up when they come to [?]\nI eat em' out like stuffin' on my microwave oven\nI get the nack when I pack\nA 3-5-7 in my sack\nCuz I'm short of a new jack\nAw heck, here's a peck on yo' cheek\nI fold em and roll em' and dunk em like Dominique\nI get the inspiration\nWhen I see the girls in jubilation\nRacing to my place and\nWanna touch my face\nAs I start to pace and race\nBrush em' off like toothpaste\nSo think twice if you wanna step to this miss\nI'll have ya burnin' like [?]\nHey up ya can't leave without no say so\nIf we were [?] I take all yo' pace so\n[?] this is earthquake on yo stereo\nFuck with me I leave you soggy like yo' cereal\nI'm gone, checkmate\n\n[Hook]\nMake a move like chess then checkmate\nI make a move like check, nigga then checkmate\nMove like chess, nigga, checkmate\nI make a move like chess, nigga\nThen I yell checkmate\n\n[Verse 2: MF Doom]\nBack as the invisible killer up on yo' screen\nSo get yo neck thumpin' between my guillotine\nChecking magazine for x the unseen\nMad niggas know what I mean\nI come clean as a whistle\nOr filthy as my last pistol\nMine get you now- BUST\nI get down to the bristle and burn em'\nLike from up under the mistletoe\nWith the ho and she ain't even\n[?] like a flow tec\nSwitch, i'm the suspicious, viscious X\nSo shit i'm a mission got this punk like a\nYo probably [?] I say like a fish\nBut bust a how I front punk\nPunk I get em' like a blunt\nAnd my middle finger index\nA thumb [?] a bum nigga\nA son of a gun\nSqueeze the trigger hallelusa\nLooser than the bullshit ya used to\nI jam like a tec' I am the [?]\nMaster of the zero harrasser of yo' zip code\nDisaster to the superhero, flipmode\nIn 93' I heard mad emcees that annoyed me\nLike DTs on CDs\nCheckmate\n\n[Hook]\nI make a move like that, then I yell checkmate\nMakin' moves like chess, nigga, checkmate\nI make a move like chess nigga then I yell checkmate\nMakin' moves like chess, kid, checkmate\n\n[Verse 3:?]\nI cremate, dominate\nThen sell some lemonade\n10 cents a cup, little kid\nThen I terminate like Arnold\nSchwarzenegger\nI am a little bigger\nTen shades darker than that\nWith the itchy finger\nMy whole game is a bible\nI kill a nigga dead\nWith some lead\nAnd put my head on his [?] bible\nI swear to God I didn't do it\nIt's just another day of my life\n[?] i'm sick and you niggas knew it\nI'm crossing criss cuz i'm pissed\nTime to diss\n[?] for doing a motherfucking twist\nI hid the body now it's over\nThe cops are havin' a really bad time finding that ass like a four leaf clover\nSo before you check me and try to do me\nQuaka' kick ya ass just like Hong Kong-Fui (CHIKA)\n\n[Outro]\nCheckmate\nI just crossed the board and I got checkmate\nI just crossed the board and I got checkmate\nI just crossed the board and I got checkmate\nI got the checkmate I got the checkmate", "Styrax Gum": "[Produced by MF DOOM]", "Charnsuka": "[Instrumental]", "Burdock Root": "[Instrumental]", "Blunt Drunk (All Outta Ale Remix)": "[MF Doom]\nSmack it up, flip it, pulled out, 'bout to fail\nSunday in the A-T-L and I'm all outta ale\nLike a bat out of hell, tripped on a cat tail\nMutt drinkin out a pail, who let the rat out the cell?\nGot all the ingredients and recipe, might as well\nSince last week the bootlegger been in jail\nIf all else fail, inhale the ale\nMakin sure they can't see your sale via snail mail\nMind like a sewer, servin rhyme on a skewer\nDoom'll step to a fine dime like he knew her\nMy black sister, she said \"Step back\" before he kissed her\nShe did the dipper and the smack just missed her\nThere go a list of politics like Henry Kissinger\n99% of rap is just a friendly issue to\nI'm like these dudes must have some screws loose to hate y'all\nOr a couple of ounces short of deuce-deuce or 8 Ball\nY'all know it's time for the end, when the day come\nBuy an album, get rudely insulted over fake drums\nSame CD's you get for free, you break 'em\nWa-alaikum, make 'em eat they food like steak'um\nWhy she wanna ask me if I could pass the paparika?\nOne hand on the mic, the other on the beaker\nEvery week or so peaked out the lab though, eureka\nA technique to keep somethin uniquer in your speaker\nFor yo' information, I didn't do the beat y'all\nIt ain't my fault, if she didn't move her feet at all\nSkeeter, got Peter to pay Paul\nSo you can drink it on Mary so she can play ball\n... So let her have my scrilla\nAnd cut it out with all that funny hand jive will ya?\nAll this trouble for a tall glass of Olde E\nDrink it all fast, make you haul ass slowly\nAnd rhymin to remember what you told me\nHoley moley, did you get a load of her roley poley?\nYo G, remind me to remember what you told me\nWhoever don't feel him build walls like a goalie\nOne for the money, two for the better green\nThree for methanine-dioxymethamphetamine\nTold the knock kneed ghetto queen get the head fiend\nTell him it's for Medellín and use oxyacetylene\nWho needs airplay, it's all just hearsay\nLeave a wig like it was havin a bad hair day\nMiracle glide master, asked him what's his secret\nHe said Shasta, and turned to formaldehyde faster\nWhen I'm home with my lady, I try to duke her daily\nOne night she tried to flail me with her ukelele\nPack your heat, the Villain on the cover of Black Beat\nWith a bunch of crackers and some snack meat\n... You better have my scrilla\nCut it out with all that funny hand jive will ya?\nAll this trouble for a tall glass of Olde E\nDrink it all fast, make you haul ass slowly\nRemind me to remember what you told me\nHoley moley, did you get a load of her roley poley?\nYo G, remind me to remember what you told me\nAnd if you don't feel him build walls like a goalie", "Sarsaparilla": "[Produced by MF DOOM]", "White Willow Bark": "[Instrumental]", "Benzoin Gum": "[Instrumental]", "Agrimony": "[Instrumental]", "Vervain": "[Instrumental]", "REIGN.. IN THE SUBWAY": "No friendly warfare, this ain't wrestlin'\nThere's nothin' staged over here, you're trippin' Mescaline\nDrinkin', coulda got smacked for what he thinkin'\nCoulda said the word, then whack! Abe Lincoln\nAnd still spend stacks off crack, stay crinklin'\nThis game's built to get got while blinkin'\nRappers do big up jail like a recruiter\nLet 'em tend ta hit a boy, said he was a shooter\nTold him \"Man up, or keep it pushin' like a scooter\"\nThen said nuttin' and didn't pass the Buddha\nLo and behold, police shows up\nSpit his shitty sixteen and got his self froze up, up\nHis story had a moral, it's buried in the soil\nVil put it in her back like the epidural\nKids: eat, sleep, stay away from creeps\nSpit it from the heart, this game's for keeps\nSo peep\nYeah, saga of a true B-Boy\nBeware any likenesses or imagery is a decoy\nSho nuff, yo fluff, force like Bruce Leroy\nBring trouble up and get double cut— keloid\nBubble up, run 'em up, destroy\nAnd anything else you see— void\nRightful ownership\nGot a bone to pick with the phoniest colonialist\nWho own a ship\nThe loneliest known to rip\nKnown to sip pine and ripple\nFind yourself in a bind and pickle\nDon't bite the hand that feeds you, bite the nipple\nIn this land of black and brown, ain't no backin' down\nAs foul as that sound, it's hard to find a cap and gown\nBut it's always like a MAC around\nB-r-r-r-r-at!! Man down\nMetal is empowered, devil is a coward\nIt all smells of high hell like no one ever showered\nScrub behind ya ears, shed the final tears\nRemember what the world was like in the final years\nJust a speck of dirt in the universe, snap fingers\nJust like that— assume the worst\nBack in business, guzzle beers, track and fitness\nLaps get faster, could've missed Christmas\nWhat is this?", "Eucalyptus": "[Instrumental]", "Vinca Rosea": "[Instrumental]", "Safed Musli": "[Instrumental]", "Hey! (Original 12\" Version)": "[Intro]\nHey there boys and girls!\nLet me know if y'all with me y'all\n\n[Verse]\nI only play the games that I win at\nAnd stay the same with more rhymes than there's ways to skin cats\nAs a matter of fact, let me rephrase\nWith more rhymes than ways to fillet felines these days\nWatch the path of the black one, Super-villain\nWho wrecks clubs for delf in a drunken stupor\nChillin, ready and willin' to inadvertantly foil that plan of the rhymers they be whiners like spoiled brats\nWho got more snottier flows than snotty nose\nAnd holds mics like he knows karate body blows\nNobody knows the trouble I see from the MPV\nFly dirty tailin' the bubble eye thirty\nFor the record this is some shit I just thought of y'all\nIt's science fiction that's not permissible in no court of law\nI live to rock mics in 3-D\nThe only reason i seek to stop, to snuff the TV\nI heard beats, they sound like karaoke with monkey rhymers on a leash like \"don't let this nigga choke me\"\nHit 'em with a penny so we could get these peanuts\nAnd I thought we was nuts\nI used to get free cuts\nThey lock Lex Luthor up in Green Haven\nSince when a nigga never really been too clean shaven\nMisbehavin' rap stars need Listament\nCall me Mr. Bent, I'm at where your sister went, intelligent\nUsed to write and be well spoke\nNow all a nigga wanna do is fight and sell-\nTell joke\nThis could lead to catastrophe\n'Bout to stop the violence right after these last of three shots from the black bat that got me at headlock\nHoldin' on to sanity by strands of that dreadlock\nShe told me get off, I said \"Bitch, let me set this shit off so I could get rich\"\nThen this shit hit me like the point of intoxication\nImma come out and rock this nation\nLike ox defacing\nA lot niggas out is rusty like oxidation\nIn this world's strangest, most dangerous occupation\nI could do it\nI'm the super like in your building\nVillain like trife Kinder is in All My Children\nPlottin', and it's sure to pay ends\nWith some real mature womens and some more of they friends\nAnd when bad men roll tight\nIt's actual true, like a pack of big Bambu with natural glue\nWho grip necks of deuce to dukes to triple X\nHe just came in 4-D, follow the ripple effects\nAnd it'll lead ya right to him\nOh snap!\nSeems we've walked into a trap through rap\nZoinks! This place is filled with pretender willies\nOne false move and get broke off like end of Phillies\nYes true believers\nAin't nothing new to a\nCrook with special powers like how to tell the future uhhhhh...\nI picture rhyme of the month, two page long\nI'm in it with two gauges and my cape on wrong\nSon it's on, it's like a Raekwon tape song\nWith a fleet of superbad bitches, status: Rae Dawn Chong\nLet me know if y'all with me y'all (HEY!!!)\nIt's national and geographic, down to the titty ball\nI represents MI City y'all\nTo my man Wiz doing his unsettling bids\nYou woulda got away if it was not for them meddling kids\n\nM'er F'ers", "Doomsday (Mister Jason Remix)": "MF DOOM - “Doomsday (Mister Jason Remix)”\n[Emcee(s): MF DOOM]\n[Producer(s): Mister Jason]\n[Scratches: Mister Jason]\n\n[Verse 1: MF DOOM]\nI used to cop a lot, but never copped no drop\nHold mics like ponytails: tight and bob a lot\nStop, stick around, come through and dig the sound\nOf the fly, brown, sickled, sicko psycho who throws his dick around\nBound to go three-plat, came to destroy rap\nIt’s an intricate plot of a b-boy strapped\nFemstat cats get kidnapped, then release\nA statement to the press, let the rest know who did that\nMetal Fist terrorists claim responsibility\nBroken household name usually said in hostility\nUm... what is MF?  You silly\nI’d like to take “Mens to the End” for two milli’\n“Doo-doo-doo-doo-doo!”  That’s an audio daily double\nRappers need to fall off just to save me the trouble. yo\nWatch your own back.  Came in and go out alone, black\nStay in the zone, turn H2O to Cognac\n\n[Hook: Samples with Scratches by Mister Jason]\n“On Doomsday” - Sample from MF DOOM - “Doomsday”\n“Operation: Doomsday”\n“MF?  You silly” - Sample from MF DOOM - “Doomsday”\n“Operation: Doomsday”\n\n[Verse 2: MF DOOM]\nI wrote this one in B.C.D.C. O-section\nIf you don’t believe me, go get bagged and check then\nCell number 17, up under the top bunk\nI say this not to be mean, wish bad luck or pop junk\nPop the trunk on C-Cipher Punk, leave him left scraped\nGod forbid, if ain’t no escape, blame MF tape\nDefinition: “Supervillain,” a killer who love children\nOne who is well-skilled in destruction as well as building\nWhile Sidney Sheldon teaches the trife to be trifer\nI’m trading science fiction with my man, the live lifer\nA pied piper holler a rhyme, a dollar and a dime\nDo his thing, ring around the white collar crime.  Get out\nMy face, asking ‘bout my case.  You need toothpaste\nRefresher mint, monkey-style nigga the Dentadent\nAnd dope fiends still in their teens, shook niggas turn\nWitness, real mens mind their own business\nThat’s the difference between sissy-pissy rappers that’s\nDouble Dutch, how come I hold the microphone double-clutch\nC.O.’s make rounds, never had ox found\nOn shakedown, lockdown, wet dreams of Fox’ Brown\n\n[Hook: Samples with Scratches by Mister Jason]\n“On Doomsday” - Sample from MF DOOM - “Doomsday”\n“Operation: Doomsday”\n“MF” - Sample from MF DOOM - “Doomsday”\n“Doom”\n“Operation: Doomsday”\n“MF” - Sample from MF DOOM - “Doomsday”\n“Doom”\n“Definition: ‘Supervillain’” - Sample from MF DOOM - “Doomsday”\n\n[Verse 3: MF DOOM]\nSome M-er F-ers don’t like how Sally walk\nI’ll tell y’all fools it’s hella cool how ladies from Cali talk\nNever let it interfere with the Yeti ghetto slang\nNicknames off nibbling tip of nipple: Metal Fang\nKnown amongst hoes for the bang-bang, known amongst\nFoes for flow without no talking orangutans\nOnly gin and Tang guzzled out a rusty tin\nCan.  Me and this mic is like yin and yang\nClang!  Crime don’t pay.  Listen, youth\nIt’s like me holding up the line at the kissing booth\nI took her back to the truck, she was uncouth\nSpitting all out the sunroof through her missing tooth\nBut then she has a sexy voice, sound like Jazzy Joyce\nSo I turnt it up faster than a speeding knife\nStrong enough to please a wife, able\nTo drop today’s math in the 48 keys of life\nCut the crap.  Far as rap, touch the mic\nAnd get the same shit a Arab will do to you for stealing\nWhat the Devil?  He on another level\nIt’s a word!  No, a name!  MF the Supervillain!\n\n[Outro: MF DOOM]\nDoomsday!", "Arabic Gum": "[Instrumental]", "Valerian Root": "[Instrumental]", "Dragon’s Blood": "[Instrumental]", "Emblica Officinalis": "[Instrumental]", "Kava Kava Root": "[Instrumental]", "The.Green.Whore.Net": "The Green Hornet\n[Instrumental]", "One Beer (Madlib Remix)": "[Intro]\nI get no kick from champagne\nMere alcohol doesn't thrill me at all\nSo tell me why should it be true?\nI get a kick out of brew\n\n[Verse]\nThere's only one beer left\nRappers screaming all in our ears like we're deaf\nTempt me, do a number on a label\nEat up all they MC's and drink 'em under the table\n\"It's on me. Put it on my tab kid.\"\nHowever you get there, foot it, cab it, iron horse it\nYou're leavin on your face, forfeit\nOf course the mic, hold it like the heat, he might toss it\nTold her tell him they stole it - he told her he lost it\nShe told him, \"Get off it,\" and a bunch of other more shit\nGettin money, D's be gettin no new leads\nIt's like he eatin watermelon, spittin seed after seed\nIt's the bleed, give me some of what he's droopin off\nSoon as he wake up, chokin like it was whoopin cough\nThey group been soft\nFirst hour at the open bar and they're troopin off\nHe went to go laugh and get some head by the side road\nShe asked him autograph her derriere, read\n“Too Wide Load, this yard bird taste like fried toad turd\nLove, Villain.” Take pride in code words\nCrooked eye mold nerd geek with a cold heart\nProbably still be speakin in rhymes as a old fart\nStudy how to eat to die, by the pizza guy\nNo he's not too fly to skeet in a skeezer eye\nAnd squeeze her thigh, maybe give her curves a feel\nThe same way she feel him when he flow with nerves of steel\nThey call the super when they need some back... uhh... plumbing fixed\n\"How it's only one left? The pack come in six!\nWhatever happened to two and three?\"\nA herb tried to slide with four and five and got caught\nLike, \"What you doing G?\nDon't make him have to get cuttin like truancy\nMatter fact, not for nothin, right now, you and me!\"\nLooser than a pair of Adidas\nI hope you brought your spare tweeters\nMC's sound like cheerleaders\nRappin and dancin like Redhead Kingpin\nDOOM came do the thing again, no matter who be blingin'\nHe do it for the smelly hubbies\nSeeds know what time is it like it's time for Tellie Tubbies\nFew got it, even fewer can sell it\nTake it from the man who wear a mask like a 'tarded helmet\nHe plot shows like robberies\nIn and out, one, two, three, no bodies, please\nRun the cash and you won't get a wet sweatshirt\nMic the shotty: nobody move, nobody get hurt\nBring heat, like your boy done gone to war\nHe came in the door, and \"Everybody on the floor!\"\nA whole string of jobs, like we on tour\nEvery night on the score, comin to your corner store", "Jasmine Blossoms": "[Instrumental]", "Fenugreek": "[Instrumental]", "Zatar": "[Instrumental]", "Bergamot Wild": "[Instrumental]", "Mighty Healthy / That’s Me (MF DOOM Special Blend)": "[Produced by MF DOOM]\n\n[Verse 1 : Ghostface Killah]\nBoth hands clusty, chilling with my man Rusty\nLow down, blew off the burner kinda dusty\nThe world can't touch Ghost, purple tape, Rae co-host\nMonty Hall expo, intellect, you read pro\nSon trifling fuck, wildflower on the cycle and\nPicked up the broom thought I was Michael-in'\nWest Brighton Pool, now I'm into Iron Duels\nTurn Nuns to Earths Whoopi, she at Allah school\nInhale break beats of hell A-Alikes propel parallel\nDuracell knot, you flash a burnt cell\nSnap out of CandyLand kids, the old rumor is\nBlacks become immune and shit, we never did\nLike eating dead birds, trust the pharmacy over herbs\nMen marrying men, ill they got the urge, pulsar\nScissor hand wig vanished in the winter, living off land\nYou god damn right I fuck fans, king me\nCheck checkmate props like the micro chip founder\nNeck to neck stock with Bill Gates now\n\n[Bridge]\nWhen we hug these mics we get busy\nCome and have a good time with G-O-D\nMake you snap your fingers or wiggle\nScream, shout, laugh or just giggle\nShake that body, party that body\nDon't fuck with Ghost you'll feel sorry\nThat's word, I'm not the herb\nUnderstand what I'm saying, saying, saying\n\n[Verse 2: Ghostface Killah]\nHit mics like Ted Koppel, rifle expert\nLet off the Eiffel, burn a flag in your grass, spiteful\nRingleader set it off, rap Derek Jeter\nCulprit, prince of the game wish you could see us\nWe lay low glitter wax full bangles\nPriceless ropes, lay around the God get tangled\nWoolly hair, eyes fiery red, feet made of brass\nTwelve men following me, it be the God staff\nMove, every script's like Miramax\nSmash the big boy, totalled it, Wilshire and Fairfax\nSon beaming wifey on the beach, sipping Zima\nWu 'binos, to latinos, we love Selena\nOvernight, God schedules, Fed-Ex\nPretty soloette velvet nice DNA scroll genetics\nToo hot, to handle one thought from scrambling the mandolin\nHundred game Wilt Chamberlain, smack 'em, say when\nHe rolling up, face wrinkled up, hands is on his nuts\nYo kid stop fronting on the ground 'fore you get touched\nIt's Canada Dry sess with Allah, son\nWe want rye, we want it so bad we might cry\n\n[Verse 3 : Cam'ron ]\nYo, I don't understand how these cats sip daiquiris\nLike it's all good down at the hit factory\nBe on 54th, whole clique backing me\nAll that click clackery takes your wrist wrappery\nI ain't no rapper, b, I skeet Uzis\nAnd I can't act, turned down 3 movies\nSo gimme your chain, your jewels and your cash\nAnd your fast food, I'll eat your food fast\nMy rude ass, carries 3 weapons\nAnd I'll give your face a c-section and keep stepping\nWho else in a hurry to mirk\nWe kill girls, rape em', bury their skirts\nImagine me wake up 7:30 for work (what?!)\nI'd rather run the streets in a 730 with work\nBut met this knucklehead, thought he want a order\nCame and asked me stop pitching to his daughter\nY'Serious? This man can't be\nBe glad I'm not in her damn panties\nGot a damn handy\nHow you going to ever ask stop carrying candy\nI'm going to sell to anybody in your damn family\nYour Uncle Tom, your Aunt Tammy, your Grandmammy\nYour right hand man Randy, understand me\nIn Atlanta I got an outlandish land piece and a matching land\nDesert-colored: Sandy\n\n[Hook]\nYou know the one with the whips, THATS ME\nThe one with the chips and the chips, THATS ME\nThe one with the toast, pants saggy, yelling out get at me\nGet at me, nigga, THATS ME\nThe one that be running and dodging, YOU\nThe one that be sucking mad dick, YOU\nThe one that's scared of some yay yo\nAlways wanna lay low, cause your girl say so, YOU, biatch\n\n[Verse 4 : Cam'ron ]\nI could show you some ice\nThrow you advice\nYou not that good dog, who told you you're nice\nAy, yo your crew, switch siders\nWhen I come through, hey Cam\nDick riders\nBut I only mess with Navigators 528\n6 drivers, big buyers, where you live we live liver\nCome through, stick your suppliers\nMack so many hoes, dick in saliva\nGash her up, ma, put it on you mouth\nThen I grab her neck and try to take her tonsils out\nAnd I don't got beef, I don't play those games\nIf I did though believe me I would say y'all names\nGo to your house, red dot scope your crib\nSmack your earth, snatch your seeds, choke your wiz\nMy crew split it was my mistake\nBut to my nigga Duke we all make mistakes\nI'm going to get shit right if I spend my cake\nJimmy, I'm a get you up out of 5h\nThis is for my niggas that load the pipe\nSaying I'm the best just not promoted right\nYou know my life\nDrink, smoke, roll some dice\nControl the hiest\nKnow I'm a patrol your schiest\nWe all get schiest", "Elder Blossoms": "[Produced by MF DOOM]", "Red #40": "[Instrumental]", "Podina": "[Instrumental]", "Coco Mango (Y Society Power Outage Mix)": "[DOOM]\nListerine green jars, sick cleans jalla be a emma\nThick queens, mamma mia robs jalapeno peppers\nClick mean large, brick seen mirage is ours\nQuick mean cause, strict deen Allah\nMake your quota, check your clock shock taqwa\nConcoct the potion, blue liner lotion, call it aqua\nTock you on watch, sure ahk, salaat two rak'at\nFour to roll in extorter mode, loose spot too hot\nHere you go ma, for you boo, that's coco mango\nShe let her hang go, her man said \"yo no tango\"\nBangles jangle, no gangs is tranquil\nBlank grill, real shank steel, bankroll ankle\nF to the N and R, two thiefs are bummin a car\nBut never had no beef so Alhamdulillah\nInshallah any duties, top grillers, no Mercedes sign\nBubble nuggets with the ruby, Cop Killer 89\nOn a line on the third like loop on\nWord is a bond that's honored, don shukran... afwan\nRam the adhan\nLivin sunnah of the Prophet Muhammad alayhi as-salaam\n\n[Insight]\nMarvelous orchestras summoned the forces of power that orbited us\nDune cloud smoked orifices, Sight endorses what is glorious\nRelive the first feelin of euphoria, power is in all of us\nNotoriety is notorious, words scatter prefer (????)\nBros mad with first data like a dagger, slice of minimal maestro\nA little nice yo, well look at the price though\nSmooth rules that ooze as few as complex chemistry\nAnd bitch and use and fizz and use with rhythms of recipe\nLesser fuse the energy to increase equity\nSo cinematic thoughts create a beautiful entity, envelope telepathy\nAnd freaks the format, chop your garbage into 4-track\nRecorded more facts to a stack\nOnly pour the pure tour back later\nYears ago I stopped checkin for anyone on a major\nI smack a hater with a tractor trailer use a paper", "Orris Root Powder": "[Instrumental]", "Mandrake": "[Instrumental]", "Calamus": "[Produced by MF DOOM]", "My Favorite Ladies (Latina Remix)": "Mary, you make me wanna eat you\nEverytime I see you, it's like the first time I meet you\nFrangrance like a flower, subtle and sweet too\nSeductive and whatever, it might as well be see through\nLike my genie in a bottle\nMiss could get me rich like a magaziney model\nBefore you know it, he have her on a stroll\nFresh and ripe, perplexin like Acapulco Gold\nIf I had to guess, just right, not a day old\nLike a cradle robber, copped her off, shop a trailer-load\nKnow the right number, you can get her\nAnd hit while you would've sold to the highest bidder like\nFruits and berries, bring daddy loot in a hurry\nJust be cute and don't worry\nType to make a nigga hallucinate and admit it\nThen she started losing weight, lettin everybody hit it\nI like Ally, sometimes she gets bitter\nAlways kept me happy, never had a problem with her\nShe used to let me use her, back when I was looser\nRespect her to this day, and never did abuse her\nI told her I'll be faithful, but she don't believe me\nI probably coulda been, if I never meet Eevee\nShe make me feel all fuzzy inside, it's loco\nYou won't get nowheres near her if you're broke though\nKept a shorty, can't find 'em much thinnner\nIf caught I get mad time just for touchin her\nKnock wood, so much for hymens\nSo fly, she should be in the sky with diamonds\nLittle young thing, she likes to do the tounge thing\nAt times, she would play hard to get, grunting\nOr something, she made me feel like the number one king\nRun into her now, and we still catch a fun fling\nMet her at Central Park this one time\nHad the God mentally sparked, reflectin sunshine\nShe said, you need to stop messin wit that white girl\nShe fuckin wit ya head and got ya heart in tight curl\nWe messed around once or twice, but she don't know me\nShe helped me get money at the dutch price OT\nPlus she from Columbia, so she really Spanish\nCookie known to make a cat bank account vanish\nAnd Miss Hazy, all the women mature black\nEverytime she sees me, I end up gettin pulled back\nAll she want me to do is blaze it crazy\nThe only one complaint is, she make me too lazy\nSugar-mommy laced me with the butter navy Avi\nJust her way to makeup for the headaches that she gave me\nIt's all gravy, when I'm done getting my mack on\nAlly is always there to help me get back on", "Lovage": "[Produced by MF DOOM]", "Apple Tree (MF Doom Special Blend)": "[Produced by MF DOOM]\n\n[Verse 1 : Erykah Badu]\nOh my my my I'm feeling high\nMy moneys gone, I'm all alone\nThe world keeps turning\nOh what a day, what a day, what a day\nPeace and blessings manifest with every lesson learned\nIf your knowledge were your wealth then it would be well earned\nIf we were made in his image then call us by our names\nMost intellects do not believe in God but they fear us just the same\n\n[Hook]\nOh on and on and on and on\nMy cypher keeps moving like a rolling stone\nOn and on and on and on\nAll night till the break of dawn\nI go on and on and on and on\nMy cypher keeps moving like a rolling stone\nOh on and on and on and on\nGoddammit I'mma sing my song\n\n[Verse 2 : Erykah Badu]\nI was born under water\nWith three dollars and six dimes\nYeah you might laugh cause you did not do your math\nLike one, two, three\nDamn, yall feel that\nLike one, two, three\nThe world keeps turning\nOh what a day, what a day, what a day\nThe man that knows something knows that he knows nothing at all\nDoes it seem colder in your summertime and hotter in your fall\nIf we were made in his image then call us by our names\nMost intellects do not believe in God but they fear us just the same\n\n[Verse 3 : Erykah Badu]\nI am feeling kinda hungry cause my high is coming down\nDon't feed me yours cause your food does not endure\nI think I need a cup of tea, the world keeps burning\nOh what a day, what a day what a day\nYou rush into destruction cause you don't have nothing left\nThe mothership can't save you so your ass is gon get left\nIf we were made in his image then call us by our names\nMost intellects do not believe in God but they fear us just the same\n\n[Chorus]\nOh on and on and on and on\nMy cypher keeps moving like a rolling stone\nOn and on and on and on\nAll night till the break of dawn\nI go on and on and on and on\nMy cypher keeps moving like a rolling stone\nOn and on and on and on\nMad props to the God JaBorn", "Mugwort": "[Instrumental]", "Blood Root": "[Instrumental]", "Mullein": "[Produced by MF DOOM]", "You’re Playing Yourself (MF Doom Special Blend)": "[Produced by MF DOOM]\n\n[Verse 1 : Jeru The Damaja]\nNow, I don't push a Lex\nOthers had their turn to flex, Jeru is up next\nAll these so called players up in the rap game\nGot brothers on the corner selling cooked cocaine\nIt used to be LaToya and jim hats\nBut now it's Uzis, Macs and G-packs of cracks\nEverybody's psycho or some type of good fellow\nBut me I keep it real that's all swine like jello\nDon't drink Cristal, and I can't stand Mo\nNever received currency for moving a kilo\nOr an ounce, make em bounce to this fake-pimp-free flow\nI never knew hustlers confessed in stereo\nOr on video get caught you'll know who turned state's\nEvidence, murder weapon, confession and fingerprints\nMama always said watch what comes out your mouth\nTight case for the DA from here to down South\nKnowledge wisdom understanding like King Solomon's wealth\nYou're a player but only because you be playing yourself\n\n[Hook 1]\nWith all that Big Willie talk, hop, you're, playin' yaself\nWith all that big gun talk, bop, you're, playin' yaself\nWith all that rah rah rah, you're, playin' yaself\nYou're, playin' yaself, you're, playin' yaself\nWith all that rah rah rah, you're, playin' yaself\nWith all that big gun talk, bop, you're, playin' yaself\nWith all that Big Willie talk, hop, you're, playin' yaself\nYou're, playin' yaself, you're, playin' yaself\n\n[Verse 2 : Jeru the Damaja]\nNow these ladies is looking pretty from city to city\nI refined a few I met, around the country\nThe nitty gritty, it's all reality, no question\nActual fact like tight jeans cause yeast infections\nAnd sisters with good minds, get no respect when\nTheir ass is all hanging out, playing the bar section\nOf the club shake what your mama gave ya, back to the lab\nI drop the truth, cause rhyming is more than just my craft\nOr a way to get ass, or fast cash, or blasted\nBlack women, make sure you're respected\nWhen niggas is kicking that old off the wall shit, let em know\nFrom jump: \"Dead it\", you're not ignorant\nKnowledge wisdom understanding is the key to wealth\nPut some clothes on that ass if you respect yourself\n\n[Hook 2]\nWith those hooker type wears hon you're, playin' yaself\nWith those skin tight jeans baby you're, playin' yaself\nEverything all exposed you're, playin' yaself\nYou're, playin' yaself, you're, playin' yaself\nEverything all exposed you're, playin' yaself\nWith those skin tight jeans baby you're, playin' yaself\nWith those hooker type wears hon you're, playin' yaself\nYou're, playin' yaself, you're, playin' yaself\n\n[Verse 3 : Jeru the Damaja]\nNow, I don't bust a Tec, bubble drugs\nIn the projects, or use mics to sell sex\nNiggas, nowadays is all about this\nSo much ying yang, it's ridiculous\nIf you got so much cheese where are the black distributors\nAnd these record companies shake em down like mobsters\nBut impostors, like commercial locks are not rastas\nAlways faking moves, never, making moves\nAsses shake, bottles pop, the government is breaking down you fools\nYou work all week and give the devil back his loot for jewels\nAnd the steak on your plate is filled with chemicals\nStill, brothers leave brothers all battered and bruised\nOn the streets, won't see snakes on my feet\nThe race is on, but I won't compete", "Warriorz (MF Doom Special Blend)": "[Produced by MF DOOM]\n\n[ Verse 1 : Lil' Fame ]\nWhy y'all niggas is sis' to fuck with Lil' Fame\nI analyze the streets, spit real game\nI'll blast on you as you pass on through\nCatch you right where you stand put your ass on you\nI remind niggas with that blue steel that you rip\nAnd the rush that you felt from the nigga that you hit, now\nHow many niggas wanna ride with me, collide with me\nBe accesoires to homicide with me [ First Family! ]\nWho I hang with, bang with, spit flames with\nThe hand full of niggas that I came with\nI ain't tripping, I know you got a hell of a plan\nFor the man if you ever caught me slipping\nYou will stop me, won't you, pop me, won't you\nBut you know I'll whoop ya motherfucking ass bitch, don't you\nMy family strong, your mams don't need so stop breathing'\nBefore you cats and you ass get deleted\n\n[ Chorus 2x]\nLook, ain't nobody stoppin' this here\nYou'll see it, it's on and poppin' this year\nMound up (Mound up!) Pounds up! (Pounds up!)\nWe build this foundation, from the ground up nigga\n\n[Verse 2 : Billy Danze ]\nStand up faggot, I'll let you have it where you post at\n(William Berckowicz!) Back with my golden fiend and Womack\n(BLAOW!) Nigga hold that, Juliani can't control that\n(We buss outta clutches on Magnum triggers) He know that\nWith the same cats that blaze DAT's on the boulevard\nWe remain strapped, then came back, doin' it hard\nSo send your soldiers cobra and I will send everyone of 'em back\nWith holes under they' hat, falls of through they' back\nDamn with it motherfucker (BK!) All day real with it motherfucker\nI'm not your average, I'm from a block where they trap cops\nAnd made 'em holler ten-thirteen\nIt's the commander, Danze, hands, down\nYou need to know who you fucking with now\nNow kill-a-kill again, with an unusual will to win\nAn unusual will to sin, stop fucking with me\n\n[ Chorus 2x]\nLook, ain't nobody stoppin' this here\nYou'll see it, it's on and poppin' this year\nMound up (Mound up!) Pounds up! (Pounds up!)\nWe build this foundation, from the ground up nigga\n\n\n[ Verse 3 : Lil' Fame ]\nIt's an every day thing in a every day game\nMore day every day, motherfucker bang (BANG!)\nIt's the streets in me, and me, I'm staying tuned to this shit\nIt's music to my ears, I'm immune to this shit\nI'm suffering, from a disease called 'Leave me the fuck alone'\nIn this full blown (blown), bitch\nM.O.P., prepare for the ruckus\nAnd we murder-murder-ma-murder-murder you motherfuckers\n\n[ Verse 4 : Billy Danze ]\nAllow me the way out, down out, pull my gun out\nRun out in the middle of a street light (Bum, bum bum)\nAh, there you go, bastard, murder international, custom main caskets\nNow could any of you cocksuckers turn to me\nThe way this streetgame is going is concerning me\nWhatever happened to the old days\nWe all blaze, we all study criminal ways\n\n[ Chorus 2x]\nLook, ain't nobody stoppin' this here\nYou'll see it, it's on and poppin' this year\nMound up (Mound up!) Pounds up! (Pounds up!)\nWe build this foundation, from the ground up nigga", "Foul Stench": "[Intro]\nSWAMPMAHN in this bitch\nYou know how we coming\n\n[Verse: SWAMP MAHN]\nComing out the swamp\nStill hating saying so many things\nOh my gosh\nIn this doing me\nBalling like Chris Bosh\nWondering\nI don't even know\nWhat to say\nCause it's off the dome\nOh gosh\nEveryone saying mad shit\nI'm still saying\nCan't you take a hint\nI really don't give a fuck\nAnd you still mustering\nI'm still mysterious\nOh gosh\nAnd you eating\nEverything with sauce\nCuz I'm just taking it\nCause you just mad\nHow I'm coming\nLike I'm not even trying\nMaybe morgue\nOh shit\nYea I know I'm busting into\nYo motherfucking mental\nYou can't even understand\nWhat I'm even saying?\nI'm just going BAAAM\nOh my gosh\nCause I'm so plain\nSo bland\nOh shit\nMy head is blank\nWhen you see my face\nBut slipt on the mic\nIt's just on another case\nBut\nLet me break out this cage\nYou feel me\nJust quit hating\nJust quit hating on SWAMPMAHN\nI'm up next\n\n[Verse: A-F-R-O]\nThe chapter of the saga, fast narration, causin'\nTrack elevation horror slash meditation noggin\nThe martyr danced on, the father lost the ransom\nFor his mom and handsome son, shot a random thug\nSlugs in the Kevlar, gun fun\nSettle on the fund from the lust, trust shunned, slums bare arms\nThe poorest village mourn the form of its children\nThe norm was timid, scornin' orange trimmings for a livin'\nDon't underestimate the child with revenge\nIn his eyes, he repents on the lives that he sends\nTo the sky, in defense, he relies in the lens\nTried twice by the feds, shied right from the pen\nNine times he extends lines, writing with a pencil\nMental reading, leaving heathens bleeding like a menstrual\nEven Stevens, grew up in evening gutter sewers\nNothin' newer, somethin' functioned crueler, eating guts and stomach ulcers\nAll he needed was to look up to someone older\nA role model, cold, hollow, non-sensical\nCold followed, slo-mo goblin showin' off\nTo Shaolin showmen, silence, throw 'em in a bottle\nPoem-wrote boss\n\nThe final battle lured the ripped child and his daddy\nBlind samurai, sword lie straight gripped in his hands, see\nShot hollows at his feet, and yelled, \"dance\"\nFailed as a male dad, pale, stale, jail, well-advanced\nHe consents all the pain in the village\n'Til the strangest scent of anger swayed, tempting the children\nTo gather all weapons, fathom all sections\nOn camera, caught pictures of the family, all massacred\n\n[Verse: Earl Sweatshirt]\nMore than feelings get hurt when the shotty goes\nBlow, ears get fucked from my audios\nI get more ass than potty holes\nHad these naughty flows ever since I was a snotty nose\nYoungin, mobbin’ with my shirt tucked in\nI’ll pop a nigga in his mouth to show him I wasn’t bluffin’\nBut, things changed like a Barack Campaign ad\nNiggas on the sneak tip I see you clearly through these Ray-Bans\nWait, now my erections go \"pshh\" down the necks of hoes\nWho next to go? The flexible bisexual, I’m thinkin’ so\nWhat’s perplexin’, though, is that this adolescent's flow\nIs hotter than a motherfuckin’ summer spent in Mexico\nCop me a mic, check and go, prepare for domination\nI got more flavors than a calm doctor has patients\nCut to the race, I’ll come in first place\nRespect me or catch a Nike SB to the face\nNow, I whooped so many niggas that they callin’ me racist\nI annihilate them, my flows amazing as grace is\nAsk them motherfuckers locked up in my basement\nI won’t give a shit, fuck, once your face hit’s the pavement\nA hater only flatters me\nWho's up to bat? We bastards, we savage, y'all handle more balls than Agassi\nNo body passes me, Fantastic 3 plus 1\nLeave catastrophes wherever we run, umm\nHun, pardon the casualties\nLyrically you can’t pass me\nNigga tryina pass me got slapped like a black chicks ass cheek\nI’m cold make the track sneeze, breakin’ niggas like bad knees\nI got sweet steeze, so sweet I attract bees\nWith my, brainiac flows, the zaniest hoes know\nI hit niggas playin’ me with low blows\nTo keep your eyes wide shut like a No-Doz\nI cop dough and stay afloat when I show boat, nigga\n\n[Verse: MF DOOM]\nSo nasty that it's probably somewhat of a travesty\nHaving me, then he told the people \"You can call me, Your Majesty!\"\nKeep your battery charged, you know it won't\nStick yo, and it's not his fault you kick slow\nShould've let your trick ho chick hold your sick glow\nPlus nobody couldn't do nothin' once he let the brick go\nAnd you know I know that's a bunch of snow\nThe beat is so butter, Peep the slow cutter\nAs he utter the calm flow (\"Your mother—\"), don't talk about my moms, yo\nSometimes he rhyme quick, sometimes he rhyme slow\nOr vice versa, whip up a slice of nice verse pie\nHit it on the first try, villain: the worst guy\nSpot hot tracks like spot a pair of fat asses\nShots of the scotch from out of square shot glasses\nAnd he won't stop 'til he got the masses\nAnd show 'em what they know not through flows of hot molasses\nDo it like the robot to headspin to boogaloo\nTook a few minutes to convince the average bug-a-boo\nIt's ugly, like look at you, it's a damn shame\nJust remember ALL CAPS when you spell the man name\n\n[Verse: Capital STEEZ]\nS is for the stamina, T is for the talent\nAnd then two E so you don't forget the name Excalibur\nZ's the Zip Zinger board that I'm passing you on\nYou still hoping that I pass the baton\nBut, I hope you got your cameras on\nPlus ain't no passenger surviving when the damage is done\nAll you cats can fine your damages I'm smashin' the song\nPlus your shit is outdated like the calendar's wrong, boy\nSo fall back, it's all caps, record that\nOr you can get your jaw cracked and stomped like floor mats\nPlus we're right outside your crib, doormats\nWith two niggas holding on the back, bra strap\nPlus they got the big bangers call it bra strap\nAnd leave your melon leaking like breastfeeding\nShe said she tempted but she won't let me caress the cleavage\nIt's the Khan bitch, why you need a better reason?\nClass clown, found it funny to correct my teachers\nI stand proud, but I never said my pledge allegiance\nI'm a veteran, flowing way colder than the seven seas\nOf course you be subjected to these heavy breezes\nOr check the tag miss, straight STEEZ varsity jacket\nSetting me apart from the average\nCause I'm a motherfucking star, asterisk\nFuck friends, I'm in it for the dollars like mavericks\nGet paid, get queued, get away\nDashin, take 14th to Manhattan\nSkip fashion, I'm still a chick magnet\nFor women with assets that's thicker than they accents\nShe say she got her man on a leash\nWear the pants in the relationship with panties beneath\nSo I proceed to ask if she can stand on her knees\nYou already know my capital, Capital STEEZ\n\n[Outro]\nNo, that was too much man\nThere's some fucking clichés man\nWhy can't I be just like the other rappers and just fucking rap?\nWhy I always got to like overdo this shit man?", "Monosodium Glutamate": "[Instrumental]", "Off the Books / Just to Get a Rep (MF Doom Special Blend)": "[Produced by MF DOOM]\n\n[Verse 1 : Big Punisher]\nHey yo it's all love, but love's got a thin line\nAnd Pun's got a big nine, respect crime but not when it reflect mine\nThe shit I'm on is wrong but it lasts long\nPull a fast one, then Pun'll wake up, with the stash gone\nI'm mad strong, and my cream is fast\nSmoke the greenest grass, my bitch got the meanest ass\nAnd a taste legit, I don't have to waste a whole case of Crist'\nAll it takes is my pretty face and my gangsta wit\nLace the click, cause we all share\nIt's all fair like love and war, thug galore with the long hair\nBig Pun, Pun the name that makes the kids run\nLike spelling murder reverse it deliver redrum\nCome one, come all, if you wanna brawl\nI'm the mighty Thor clotheslining motherfuckers like Steven Segall\nCause all you gonna get, is your ass kicked or up in a casket\nThat's it (that's it?) That's it\n\n[Verse 2 : Cuban Link]\nPunisher bash it, at last it's, rappers that really blast shit\nCats getting Big Willie niggas like Billy Bathgate\nUp in Jimmy's Cafe, havin caviar\nCrackin Cristal at the bar, smokin cigars, livin large\nWe rob and steal, run with the mob, doin jobs for bills\nI'm hard to kill for real nigga guard your grill\nI like to chill, spark an L and get high\nI'm one hell of a guy, fly pelican fly\n\n[Verse 3 : JuJu]\nWhattup Duke-o, you know, politickin papi chuco\nI'm out here, watching for Jake, getting this loot though\nShoot bro, I got a waterproof suit yo\nSwervin like a A.K.A. in Beirut yo\nSqueezin, out of automatic M3's and\nPlease, you ain't seen no thugs like these\nI can tell you lots of things that'll make you believe\nIn Corona yo it's better to take than to receive\n\n[Verse 4 : Psycho Les]\nYour career's on life support, and I'mma pull the plug\nAnd have every thug shootin that Beatnut drug\nIn they blood, no escapin this\nNiggas is goin over their favorite shit (for what?) to be tapin this\nWorld premier, loud and clear\nLa and beer, get the dough, blow up the show\nDissapear, jump in the Cavalier\nFeelin marvelous, street pharmacist, twist arboles\nFor pleasure, bring your territory terror\nKeep my workers under pressure got em sayin \"FUCK LESTER\"\nBut that's aight Duke-o, my heart nowadays too cold\nDon't give a fuck where you been what you done\nWhere you go, you know, peep this statement\nIn black shades like a secret, agent\nWe're night thieves, roll up on you like sleeves\nWe light trees, bust these and stack cheese\n\n[Chorus 2x]\nIt's off the hook this year\nMakin mad money off the books this year, ain't nothin\nBut crooks in here\nGettin mad money off the books this year\n\n[Verse 5 : Guru]\nBrothers are amused by others brother's reps\nBut the thing they know best is where the gun is kept\nCause in the night you'll feel fright\nAnd at the sight of a four-fifth, I guess you just might\nWanna do a dance or two\nCause they could maybe bust you for self or with a crew\nNo matter if you or your brother's a star\nHe could pop you and jet without a getaway car\nAnd some might say that he's a dummy\nBut he's sticking you and taking all of your money\nIt's a daily operation\nHe might be loose in the park or lurking at the train station\nMad brothers know his name\nSo he thinks he got a little fame from the stick-up game\nAnd while we're blaming society\nHe's at a party with his man\nThey got their eye on the gold chain that the next man's wearing\nIt looks big but they ain't staring\nJust thinking of a way and when to get the brother\nThey'll be long gone before the kid recovers\nAnd back around the way he'll have the chain on his neck\nClaiming respect, just to get a rep", "Coriander": "[Instrumental]", "Nettle Leaves": "[Instrumental]", "Galangal Root": "[Instrumental]", "Star Anis": "[Instrumental]", "Four Thieves Vinegar": "[Instrumental]", "Dead Bent (Original 12\" Version)": "[Intro]\n\"DOOM mumbling and singing\"\n\n[Verse 1]\nI hold the mic, like niggas hold their girls tight\nBut I ain't after her, probably your Acura pearl white\nThe hooker? Nah, as many times as I done split it\nTo be specific more times than dimes in a briz-nick\nWhen you broke North, I crashed the barbecue like Riddick\nAt the Garden, true, that's the God in me, pardon you\nJeepers! I was tore back, the ho gained access to my beeper\nCalled back my secretary gatekeeper\nLike I ain't peep her, I said, \"Darling you was stupid though\"\nYou know the Super Villain, (He is a super hoe)\n\n[Verse 2]\nI had this style ever since I was a child\nI got this other style I ain't flip in a while, it goes\nPure scientific intelligence, with one point of relevance\nEmcees their styles need Velamints\nAnd once the smoke clear, tell 'em it's The Super Metal Face Villain, He came through raw like the elements\nOn 99 plus one of them\nPlus with a flow to pull a fraud nigga file from out in front of him\nWhen we with y'all, we had tons of fun\nMe and my duns and them\nActual true and living sons of them\nDead planets and God-U\nThrowing divine rules to come through, we will over charge you\nAnd won't feel remorse for shit\nExcept for once (?) and lost them shits\nScientific going berserk like Red Alert\nI really went to pick up wiznork for cheddar dirt\nTo fund these experiments is where I went\nObviously dead bent, and spent every red cent\nTo rule you, and still drop more jewels than schools do\nOr even TV news that's designed to fool you (who?)\nYeah you, who hear the most grimy suggestions\nFrom niggas with fly names and I.D. questions\nThat's a Secret like Victoria teddy sets that's edible\nThem's not ready yet for the incredible\nTeam of MC's who broke all fakes\nWho thought they were slaughter proof\nStomping through like North Face waterproof\n\n[Outro]\nTat-tat, that's the end of that\nAfter hit the bar where baby girl bartender at\nI told her more wine, mingling with no single mentions of\nStay tuned for more spine tingling adventures of ...", "Black Snake Root": "[Instrumental]", "Orange Blossoms": "[Instrumental]", "Devastator": "[Verse 1: Trunks]\n\nLast Will and Testament, first Fallen Angel\nKicked out of Heaven, fell at a weird angle\nHit the ground running; scarred, tail tangled\nNow he just raises the bar and leaves 'em mangled\n\nSo yeah motherfucker\nI got the drive of a redneck trucker\nTractor pull, act a fool\nWe'll see who's backing you\nOnce we see what these cats'll do\n\nIt's like panthro, liono, and tiger in a thunder tank\nFuck where you from, I'm claiming anywhere you ain't\nTake anything you can't, now ain't that something?\nTie a rope around the neck of the beat, and get it jumping\n\n\n[Verse 2: MF DOOM]", "Patchouly Leaves": "[Instrumental]", "New Beginning": "[MF Doom]\nYo, yo\nBring in the big guns, weapons is ready\nIn the square shoot the heady reppin the yeti is ready\nBout time last train from Gun Hill, Dunn chill\nStay filled with exhiliration from one kill\n\n[Scott Free]\nYo, rock for ? row don't tempt me\nSmack the drum black, black rap Jack Dempsey\nYou get laced without a trace just for takin up space\nBill Bill the bombville you still catch a Gas Face\nFor real", "Camphor": "[Instrumental]", "Go With The Flow (Original 12\" Version)": "\"Yeah, here we go...just go with the flow\" (repeats 4 times)\n\nYo, I'd like to check this microphone before I start right quick\nMicrophone check 2,2,1,2,1,2\n\n[Verse 1]\nBig up all the Monsta Island massive\nAnd beware before I triple dare you like the last kid\nWho ask me what we don't got that you got son\nFor one, flow that's elementary my dear Wat-son\nSecondly, ever since I was little\nNot so much to riddle, least rhyme to the syllable\nKeep tracks that make a Arab thief clap\nWith no hands, I chop these drums off\nTruly yours, G Rap\nActual fact, relax\nIn this land of lyrical loss, black\nI'm not the cool sleet stack\nThe one who might stop and talk to you\nPoison to few, niggas who be bitin styles I'm like pork to\nOooh...what you got to lose? Let mud fly\nWhen I got blues I chew whole crews that's bud dry\nSo I ask why the style's from the cess\nShit be fuckin with my eye as I pull it to the chest\nThe super muthafuckin' villain grip the mic wit an iron hand\nThrowin emcees to the fire from out da fryin' pan\nIt ain't no use in tryin, man\nSon, stop cryin\nFrontin' like you death-defyin'\nYou need to stop lyin'\nSpeak your piece only once you're spoken to first\nNow lemme hear your verse while I'm chokin' you\nWith bubbly fine rhymes like a editor\nThrow them to my collection of skulls and spines like Predator\nFuck around, the only niggas who could hear the same sound (who?)\nWas Jet Jaguar and James Brown\n(Yeah, yeah only them two niggas?)\nAnd I'm glad I took the time to write their names down to big 'em up\n(True, true)\n\n[Verse 2]\nI'd like to say hi\nIt's {?} fly the odd Merlin\nThat's quick to whip up a script like Rod Sterling\n{?} bad bitch who used to whip the Sterling\nWho see God ?, never see God earlin'\nMy man Grimm had his little monkey like Space Ghost\nMe myself I got flavors that out-taste most\nWith numb gums, some rhymers is lake toast\nBack to you MF Doom, you late show host\nS to the U to the P E R-uh\nWho chronicle these times in a 3-D horror\n{?} co-star or in a realer drama\nWho break bread with stingy kin-men, indian borrower\nLone gunmen who candidly flip fly floes\nSingle-handedly with one eye closed\nIn a fly pose, no shirt {?}\nMay see me stack the quarter-mill cash pay\nThat's in a smash way how he did it\nMuthafucka probably couldn't peep it past a minute", "Myrrh": "[Instrumental]", "Gazzillion Ear (Jneiro Jarel/Dave Sitek Remix)": "[Verse 1]\nVillain, man, never ran with krills in his hand and\nWon't stop rockin' til he clocked in a gazillion grand\nTillin' the wasteland sands\nRaps on backs of treasure maps, stacks to the ceilin' fan\nHe rest when he's ashes\nAsk 'em after ten miles in his ga-lashes, smashes stashes\nChip on his shoulder with a slip on holster\nA clip, a folder and his grip on a boulder bolster\nThey supposed ta know, it show when his aura glow\nGet from out the row, when he get dough it's horrible\nTime is money, spend, waste, save, invest the fess\nThe ten case of cave a chicken chest S\nYes ya'll the dub will get ya trickles\nThe best ballers pitch in and rub to get a nickels\nBut tut tut, he about to change the price again\nIt go up each time he blow up like hydrogen\nVillain here, have em shrillin' in fear\nAnd won't stop top illin' til he a gazillionaire\nGrillin' stare, yeah ya boy had drama\nGot 'em on a mental plane, avoided bad karma\nOnce sold an inbred skinhead a nigga joke\nPlus a brand new chrome smoker with the triggers broke\nI thought I told 'em, \"Firing pins was separate\"\nHe find out later when he tries to go and rep it\nTook a Jehovah money for a Arabic Torah\nCharged an advance to translate it and ignored it, sorta\nOne monkey don't stop no slaughter\nA junkie want ta cop a quarter ton, run for the border\nKnow the drill, it ain't worth the overkill\nFlow skill, still there's no thrill\nVilla bill ya ten K bills in his pilla\nVilla, when it gets realer, split the skrilla with—\n\n[Verse 2]\n—Dilla, (Dilla) mix, mix, mix\nDo a deal for kicks and get rich quick\nSketch lyric, bet 'cha bottom nick on some vic\nIck from the drumstick, come with the dumb shtick\nSick slick, hidden in a book\nThe only way they find it if you're spittin' in a hook\nListen, don't look now, keep walkin'\nTraded three beans for this cow, cheap talkin'\nHawk men stalkin' hear that we hawkin' often\nCoughin' to a coffin, might as well scoff the pork then\nHe's like Worf, some say stronger though\nOff the top Jay Strongbow, play along bro\nWear a mask like yo off the Gong Show\nFlow slow as Mongo, Don Juan thong pro\nFor ya info when he's not practicin' Jim Crow\nOr actressin' and some nympho bimbo\nHe's playin' Ray J the old tape\nDOOM—well what can I say like JJ in a gold cape\nFill it to the rim like brim\nVillain and ya won't find him in no gym\nProbably a foggy bog with the frogs\nWith a dot on the guard as he squat on a log\nHalf cocked and half baked\nUsed to keep a full stock of work, half rocked and half shake\nMy mistake, sign a track agreement\nFor more G's than lines and cracks in the cement\nIn any event it's fake like wrestlin'\nGet 'em like Jake The Snake on mescalines\nAhem, elixir for the dry throat\nTried to hit the high note, Villain since a itsy bitsy zygote\nBy remote, send in the meat wagon\nBraggin' MC's packed in with they feets draggin'\nThese stats are staggerin'\nHad his PhD in indiscreet street hagglin'\nVillain, his agenda is clear\nEndin' this year with dividends to spare, here\nIt's not meant for the seein'\nWent through the ceilin' after enterin' his center bein'\nA new meanin' to sales through the roof\nGuaranteed raw and saw his truth was truth, proof\nIt's the return of the tramp\nWho do a duet jam when Ernest Goes To Camp\nFor the right earn - na'mean like Vern\nWe need some more oil for the machines to burn, learn\nJiminy crickets\nHe gets lucky like winnin' free tickets off SimplyLyrics\nOne man's waste is another man's soap\nSons fan base know the brotha man's dope\nA real weirdo with a bugged rare flow\nAnd the way his hair grow was ugly as a scarecrow\nHe wears a mask so the charge won't grab\nOn a rooftop with a large stone slab\nHeads up, talk white and thought niggerish\nRefuse to walk tight and got his off the vigorish\nBlack licorice and equally as yucky\nHow he handled the money was strictly Dan Stuckie\nMonkey hustle, man on fire\nLater for the date than the Hadron Collider\nAnd cost more, it be seemin' like a style\nDOOM leave the competition steamin' like a pile\nSmile, ding! Sparklin' jewels\nIn effect like alternate side of the street parkin' rules\nFools, the roach was never dead\nLive for a week, then dehydrate with a severed head\nInstead it was depicted as flicked in\nSplit, the wicks lit", "Gas Drawls [Demo]": "It's that butter shit niggas know I always never stutter with\nCheck the styles, check it, uh, peep it\n\n[Verse 1]\n\nI re-up on bad dreams, bag up screams in fiftys\nBe up on mad schemes that heat shop like jiffy-pop(pop)\nShit, an instant, get smoked like Winston - cancers\nAnd cut halves through them gangsters, too\nIn real life, the real trife scene\nMight steal your life with the assault machine\nRifle, dead up, it's a setup like bull-fight\nBe blunted how we like couldn't white or in full flight\nX, the unemotional, call me anti-social\nOn the run from off the gun death tally commercial\nDeath valley is like rehearsal, to the streets\nTo my peeps, ??? beats\nLike the weapons of war\nNow you keep from steppin' on my floor, or delivery front door\nSpecial ed, y'all motherfuckers master yours\nMy disaster causes you: Hell.. in them gas drawls\nThe supervillain, cooler than a million, I be chills\nStill quick to slice squares like Sicilians\nDon't make me have to hurt them feelings\nI'll ruin you in the dirt that I be doin' in my dealings\nSendin spirits through the ceilin', chrome peelin'\nDome blown, in the comforts of your own home\nGrown, big wheelin' and high rollin'\nI hold the lye, I keep the sty on my eye swollen\n\nBitch, nigga, switch the style\nX a massive-versatile\nBig up to Monster Isle\n\nI saw you in Hell with them gas drawls\nPeep it\n\n[Verse 2]\nTo my brother Subroc and Black Ju\nI crack brew for (you), two more, three men, two up\nI hit the brew up like nobody knows how X the unseen feels\nWhen giving crews a brush with death like between meals\nTwo times a day with brothers who's tight like a noose\nWith more rhymes in use than Dr. Seuss or motherfuckin' mother goose\nX the suspicious flirter\nThat every hooker heard o', next to malicious murder\nA track type vicious fulfillin' the pipe wishes\nThe misses may be legal minus the baby eagle\nAny given summer's eve don't breathe\nSixteen shots I do believe and one up the sleeve\nMaster of the O to predict ya last pause\nI told you, Hell and gas drawls, breakin'\nGlass and plastic jaws like federal drastic laws\nFed up from fightin' secret wars with them Fantastic Fours (invisible bitch)\nVersus Doom wit' the metal face before I go to state\nThe ho better settle case\nThe flow is at pedal pace - steady like tricycles\nBeware all suckers is froze like icicles\nI'm baggin' bitches like nickels\nCause I licked 'em where they tickle before I hit the clit though\nI'ma split till I pronounce, more hits than a ounce no doubt\nAbout to bounce, X the unannounced, I'm out\n\n[Outro]\nAnd I like to give a shout to my man Jet Jaguar\nYou know, D-Smooth, ??? One\nMaster of the O\nI call this joint\nIn hell with them Gas Drawls", "Viktor Vaughn": "Delete this", "Sumac Berries": "[Instrumental]", "Devil’s Shoestring": "[Instrumental]", "No Snakes Alive (MF EP Version)": "MF DOOM ft. King Geedorah, Jet Jaguar, and Rodan - “No Snakes Alive (MF EP Version)”\n[Emcee(s): King Geedorah, Jet Jaguar, and Rodan]\n[Producer(s): MF DOOM (Original Instrumental from Metal Fingers - “Star Anis”)]\n\n[Verse 1: King Geedorah]\nGeedorah has arrived, you guys could take five\nBy the time it’s over, no snakes alive\nTake the dive, I’m telling you, you’re better off\nThen up against the flow that make her take her sweater off\nFrom the setoff, when it came to scripts, he could hardly brag\nIt’s the result of concentration and lollygag\nI said, “Yeah right.”  He pulled a mic out a snotty rag\nWas sealed up air-tight, and tied up in a body bag\nGet an advance and catch chance writer’s block.  After\nSpending the first and last penny, my own worst enemy\nTell me if I’m OD’ing.  Use a flow\nAnd made deals with these cats who keep sending dough, so\nThe Three-Headed set it, never get busted\nHe’s a man of his word who’s yet to be trusted\nBeats encrypted, multi-faceted, encrusted\nSweaty palm, keep mic rusted\nSort of mellow type of fellow\nWho sometimes spaz on wife like Othello\nHell no.  He only works like Illuminati\nOr Gotti.  All shotty, he might use karate\nAzar the Gaza caught cut, I’ll ask why\nA mask with the ball-style caps saying, “That’s fly”\nExact dough ‘til it stack high\nThe white hoes, black guys, the rap game’s black eye\n\n[Verse 2: Jet Jaguar]\nExhilaration, Jet Jag’s accelerations\nTouch speeds minds can’t conceive\nAchieve altered altitudes and angles, angels answer\nAura, illumination, awesome interpretation\nAwkward alarm, ankle house arrest\nWho’s best?  Monster Island Czars\nCrush pawn dreams to be king\nA frank reality, calculation could never be\nQuest destined, distant competition dusted\nDisgusted, race for second, crowded, clouded\nConfusion, conclusion: simple, plain\nSelf-education, self-made millionaires\nSerpents slithering, sidewinds searching\nStalking, heat-sensing, can’t have me\nJet Jag’s Rikki-Tikki-Tavi, superhero\nHit zero to sixty, hot pursuit, pedal to\nThe floor, handling\nLyrics, traction\nSwerving left, right\nMaking head-fakes\nPlaying high stakes\nLevitates\nQuick!  Hit breaks, they fly past, hit wall, parts\nFly loose, killer mongoose\n\n[Verse 3: Rodan]\nFake niggas continue to practice the art of intimidation\nSterile minds conceive thought for artificial insemination\nSyntax the sequence, arranging lessons so deliberate, making\nWise words clear, but population stay illiterate\nConsider it.  Gods define power, fools get rid of it, men build\nDreams on promises but lacking the will to deliver it\nYo, I dissolve connivers like saliva on tic-tacs gone\nAstray, but get the job done like socks that’s mismatched\nFlip tracks, murder snakes, drunk niggas killing six packs\nChoking on venom, suffering tricknological kickbacks\nPoverty-stricken minds with thoughts barely worth two cents\nBuild history through time, linear design on blueprints\nA nuisance lies in disguise, Eighty-Five Percent never knew\nWise men arise, pull files like Internal Revenue\nForever true, opposing self-evidence with leverage\nUpset the beast belly, concoct homogenized beverage\nClever shit, calculated sabotage, Trojan Horse\nGiftwrapped ambush, we put energy in motion that grows in force\nChosen swords strategically aligned throughout the underworld\nGod of Elevation kill Superman, rape Wondergirl\nPolice character decapitated, fake beings susceptible\nTo everyday occurrence, a fatal outcome’s inevitable\n\n[Verse 4: King Geedorah]\nMight as well join the force\nBoss.  Chance?  Take a loss like a coin-toss\nRoll with a double-headed nickel\nWhile the partner Jet Jag with the sickle, you in a pickle\nKing Geedorah, your ass needs to leave him alone\n‘Fore he cold-catch a seizure and then you’re blown\nIf he ain’t the best, he’s the best in\nThe top three out of myself, I, and me", "Gazzillion Ear (Dr. Who Dat? Remix)": "[Verse 1]\nVillain, man, never ran with krills in his hand and\nWon't stop rockin' til he clocked in a gazillion [x2]\nRaps on backs of treasure maps, stacks to the ceilin' fan\nHe rest when he's ashes\nAsk 'em after ten miles in his ga-lashes, smashes stashes\nChip on his shoulder with a slip on holster\nA clip, a folder and his grip on a boulder bolster\nThey supposed ta know, it show when his aura glow\nGet from out the row, when he get dough it's horrible\nTime is money, spend, waste, save, invest the fess\nThe ten case of cave a chicken chest S\nYes ya'll the dub will get ya trickles\nThe best ballers pitch in and rub to get a nickels\nBut tut tut, he about to change the price again\nIt go up each time he blow up like hydrogen\nVillain here, have em shrillin' in fear\nAnd won't stop top illin' til he a gazillionaire\nGrillin' stare, yeah ya boy had drama\nGot 'em on a mental plane, avoided bad karma\nOnce sold an inbred skinhead a nigga joke\nPlus a brand new chrome smoker with the triggers broke\nI thought I told 'em, \"Firing pins was separate\"\nHe find out later when he tries to go and rep it\nTook a Jehovah money for a Arabic Torah\nCharged an advance to translate it and ignored it, sorta\nOne monkey don't stop no slaughter\nA junkie want ta cop a quarter ton, run for the border\nKnow the drill, it ain't worth the overkill\nFlow skill, still there's no thrill\nVilla bill ya ten K bills in his pilla\nVilla, when it gets realer, split the skrilla with—\n\n[Verse 2]\n—Dilla, (Dilla) mix, mix, mix\nDo a deal for kicks and get rich quick\nSketch lyric, bet 'cha bottom nick on some vic\nIck from the drumstick, come with the dumb shtick\nSick slick, hidden in a book\nThe only way they find it if you're spittin' in a hook\nListen, don't look now, keep walkin'\nTraded three beans for this cow, cheap talkin'\nHawk men stalkin' hear that we hawkin' often\nCoughin' to a coffin, might as well scoff the pork then\nHe's like Worf, some say stronger though\nOff the top Jay Strongbow, play along bro\nWear a mask like yo off the Gong Show\nFlow slow as Mongo, Don Juan thong pro\nFor ya info when he's not practicin' Jim Crow\nOr actressin' and some nympho bimbo\nHe's playin' Ray J the old tape\nDOOM—well what can I say like JJ in a gold cape\nFill it to the rim like brim\nVillain and ya won't find him in no gym\nProbably a foggy bog with the frogs\nWith a dot on the guard as he squat on a log\nHalf cocked and half baked\nUsed to keep a full stock of work, half rocked and half shake\nMy mistake, sign a track agreement\nFor more G's than lines and cracks in the cement\nIn any event it's fake like wrestlin'\nGet 'em like Jake The Snake on mescalines\nAhem, elixir for the dry throat\nTried to hit the high note, Villain since a itsy bitsy zygote\nBy remote, send in the meat wagon\nBraggin' MC's packed in with they feets draggin'\nThese stats are staggerin'\nHad his PhD in indiscreet street hagglin'\nVillain, his agenda is clear\nEndin' this year with dividends to spare, here\nIt's not meant for the seein'\nWent through the ceilin' after enterin' his center bein'\nA new meanin' to sales through the roof\nGuaranteed raw and saw his truth was truth, proof\nIt's the return of the tramp\nWho do a duet jam when Ernest Goes To Camp\nFor the right earn - na'mean like Vern\nWe need some more oil for the machines to burn, learn\nJiminy crickets\nHe gets lucky like winnin' free tickets off SimplyLyrics\nOne man's waste is another man's soap\nSons fan base know the brotha man's dope\nA real weirdo with a bugged rare flow\nAnd the way his hair grow was ugly as a scarecrow\nHe wears a mask so the charge won't grab\nOn a rooftop with a large stone slab\nHeads up, talk white and thought niggerish\nRefuse to walk tight and got his off the vigorish\nBlack licorice and equally as yucky\nHow he handled the money was strictly Dan Stuckie\nMonkey hustle, man on fire\nLater for the date than the Hadron Collider\nAnd cost more, it be seemin' like a style\nDOOM leave the competition steamin' like a pile\nSmile, ding! Sparklin' jewels\nIn effect like alternate side of the street parkin' rules\nFools, the roach was never dead\nLive for a week, then dehydrate with a severed head\nInstead it was depicted as flicked in\nSplit, the wicks lit", "Buckeyes": "[Instrumental]", "All Spice": "[Instrumental]", "What a Nigga Know?": "[Instrumental]", "High John": "[Instrumental]", "Calamus Root": "[Instrumental]", "Chrysanthemum Flowers": "[Instrumental]", "Fo Ti": "[Instrumental]", "Shallots": "[Instrumental]", "Dragon’s Blood - Resin": "[Instrumental]", "Coltsfoot Leaf": "[Instrumental]", "Coca Leaf": "[Instrumental]", "Cedar": "[Instrumental]", "Peach Extract": "[Instrumental]", "Yellow Dock": "[Instrumental]", "Smokin’ That Shit!": "[Instrumental]", "Confusion": "Stuck in a maze, a labyrinth of hate. Shattered doors in\nA mask of haze. Struggling madly in a cage. Desperately\nSearching for a way out of the maze. Running blindly not\nFeeling the floor, nothing to stand on we fall. Lost in\nThe halls, I'm looking for the doors. Confusion! My\nSenses are dying. My soul is crying. Let me out, let me\nOut! I'm screaming! Running blindly through the visions\nBarefoot and defenseless. Running blindly through the\nDark, infested woods. Time and time again. Disillusion\nI'm deeper in the maze. Further from the light. I scream\nOut of the confusion. I'm being consumed by confusion. My\n\nWorld has been shattered. Crippled. All we have left is\nFragments of doors. Though we once had but never had\nWe've all been fooled. Confusion. My senses are dying my\nSoul is crying. Let me out. Let me out. I'm screaming\nI'm living in a demented labyrinth. tortured. Lost\nCrippled. I'm a part of this confusion. Shattered\nConfusion. Shattered vision. All that I have left is\nIllusion. I'm screaming at the confusion. I'm being\nConsumed by confusion. In an abstract, in a world of\nConfusion!", "Humrush": "[Instrumental]", "Horehound": "[Instrumental]", "Myrtle Leaf": "[Instrumental]", "Who Me?": "[Instrumental]", "Contact Blitt": "[Instrumental]", "Wormwood": "[Instrumental]", "Want Not Need": "Wrapped, Packaged\nPleasing to the eye\nAdvertised, Brainwashed\nYou're ready to buy\n\nWant not need\nConsumer greed\n\nDon't know where it came from\nAnd don't really care\nAs long as there's more\nAs long as it's there\nEveryone has one\nWhy haven't I?\nSaw it on TV\nJust gotta buy!\n\nWant not need\nConsumer greed", "Hyssop": "[Instrumental]", "Latoya (MF Doom Special Blend)": "Transcibing soon", "Plumskinzz": "[Instrumental]", "Gazzillion Ear (acapella)": "[Verse 1]\nVillain, man, never ran with krills in his hand and\nWon't stop rockin' til he clocked in a gazillion grand\nTillin' the wasteland sands\nRaps on backs of treasure maps, stacks to the ceilin' fan\nHe rest when he's ashes\nAsk 'em after ten miles in his ga-lashes, smashes stashes\nChip on his shoulder with a slip on holster\nA clip, a folder and his grip on a boulder bolster\nThey supposed ta know, it show when his aura glow\nGet from out the row, when he get dough it's horrible\nTime is money, spend, waste, save, invest the fess\nThe ten case of cave a chicken chest S\nYes ya'll the dub will get ya trickles\nThe best ballers pitch in and rub to get a nickels\nBut tut tut, he about to change the price again\nIt go up each time he blow up like hydrogen\nVillain here, have em shrillin' in fear\nAnd won't stop top illin' til he a gazillionaire\nGrillin' stare, yeah ya boy had drama\nGot 'em on a mental plane, avoided bad karma\nOnce sold an inbred skinhead a nigga joke\nPlus a brand new chrome smoker with the triggers broke\nI thought I told 'em, \"Firing pins was separate\"\nHe find out later when he tries to go and rep it\nTook a Jehovah money for a Arabic Torah\nCharged an advance to translate it and ignored it, sorta\nOne monkey don't stop no slaughter\nA junkie want ta cop a quarter ton, run for the border\nKnow the drill, it ain't worth the overkill\nFlow skill, still there's no thrill\nVilla bill ya ten K bills in his pilla\nVilla, when it gets realer, split the skrilla with—\n\n[Verse 2]\n—Dilla, (Dilla) mix, mix, mix\nDo a deal for kicks and get rich quick\nSketch lyric, bet 'cha bottom nick on some vic\nIck from the drumstick, come with the dumb shtick\nSick slick, hidden in a book\nThe only way they find it if you're spittin' in a hook\nListen, don't look now, keep walkin'\nTraded three beans for this cow, cheap talkin'\nHawk men stalkin' hear that we hawkin' often\nCoughin' to a coffin, might as well scoff the pork then\nHe's like Worf, some say stronger though\nOff the top Jay Strongbow, play along bro\nWear a mask like yo off the Gong Show\nFlow slow as Mongo, Don Juan thong pro\nFor ya info when he's not practicin' Jim Crow\nOr actressin' and some nympho bimbo\nHe's playin' Ray J the old tape\nDOOM—well what can I say like JJ in a gold cape\nFill it to the rim like brim\nVillain and ya won't find him in no gym\nProbably a foggy bog with the frogs\nWith a dot on the guard as he squat on a log\nHalf cocked and half baked\nUsed to keep a full stock of work, half rocked and half shake\nMy mistake, sign a track agreement\nFor more G's than lines and cracks in the cement\nIn any event it's fake like wrestlin'\nGet 'em like Jake The Snake on mescalines\nAhem, elixir for the dry throat\nTried to hit the high note, Villain since a itsy bitsy zygote\nBy remote, send in the meat wagon\nBraggin' MC's packed in with they feets draggin'\nThese stats are staggerin'\nHad his PhD in indiscreet street hagglin'\nVillain, his agenda is clear\nEndin' this year with dividends to spare, here\nIt's not meant for the seein'\nWent through the ceilin' after enterin' his center bein'\nA new meanin' to sales through the roof\nGuaranteed raw and saw his truth was truth, proof\nIt's the return of the tramp\nWho do a duet jam when Ernest Goes To Camp\nFor the right earn - na'mean like Vern\nWe need some more oil for the machines to burn, learn\nJiminy crickets\nHe gets lucky like winnin' free tickets off SimplyLyrics\nOne man's waste is another man's soap\nSons fan base know the brotha man's dope\nA real weirdo with a bugged rare flow\nAnd the way his hair grow was ugly as a scarecrow\nHe wears a mask so the charge won't grab\nOn a rooftop with a large stone slab\nHeads up, talk white and thought niggerish\nRefuse to walk tight and got his off the vigorish\nBlack licorice and equally as yucky\nHow he handled the money was strictly Dan Stuckie\nMonkey hustle, man on fire\nLater for the date than the Hadron Collider\nAnd cost more, it be seemin' like a style\nDOOM leave the competition steamin' like a pile\nSmile, ding! Sparklin' jewels\nIn effect like alternate side of the street parkin' rules\nFools, the roach was never dead\nLive for a week, then dehydrate with a severed head\nInstead it was depicted as flicked in\nSplit, the wicks lit", "Garbage Day #3": "[Instrumental]", "Spikenard": "[Instrumental]", "Doomed": "Forced live lives\nWe don't want to lead\nAbiding by rules\nLiving on our knees", "It Sounded Like a Roc!": "[Instrumental]", "Untitled (Meditation)": "[Instrumental]", "Go With the Flow (Live)": "[Verse 1: MF DOOM]\nBig up all the Monsta Island massive\nAnd beware before I triple dare you like the last kid\nWho asked me what we don't got that you got son\nFor one flow that's elementary my dear Watson\nSecondly, ever since I was little\nNot so much to riddle, least rhyme to the syllable\nKeep tracks that make a Arab thief clap\nWith no hands, I chopped these drums off, truly yours, G Rap\nActual fact, relax\nIn this land of lyrical lost, black, I'm not the cool sleestak\nThe one who might stop and talk to you\nPoisoned a few, niggas who be biting styles I'm like pork too\nOoh, what you got to lose? Let mud fly\nWhen I got blues I chew whole crews that's bud dry\nSo I ask why the styes from the cess\nShit be fucking with my eye as I pull it to the chest\nThe super motherfucking villain grip the mic with an iron hand\nThrowing MCs to the fire from out the frying pan\nIt ain't no use in trying, man, son stop crying\nFronting like you death-defying, you need to stop lying\nSpeak your piece only once you're spoken to first\nNow let me hear your verse while I'm choking you\nWith well refined rhymes like a editor\nThrow them to my collections of skulls and spines like Predator\nFuck around, the only niggas who could hear the same sound (Who?) was Jet Jaguar and James Brown\n(yeah yeah, only them two)\nAin't you glad I took the time to write their names down to big 'em up (True, true)\nI'd like to say, \"Hi, it's Sci.Fly the odd Merlin\"\nThat's quick to whip up a script like Rod Serling\nWho eye on bad bitch who used to whip the Sterling\nWho see God toke but never see God hurlin'\nMy man Grimm had his little monkey like Space Ghost\nMe myself I got flavors that out-taste most\nWith numb gums, some rhymers is lactose\nBack to you MF DOOM, you late show host\nS to the U to the P E R-uh\nWho chronicle these times in a 3D horror\nThriller porno co-starrer in a realer drama\nWho break bread with stingy kin-men, indian borrower\nLone gunman who candidly flip fly flows\nSingle-handedly with one eye closed\nIn a fly pose, no shirt Alayé\nMay see me stack the quarter-mill cash pay\nThat's that n a smash way how he did it\nMotherfucker probably couldn't peep it past a minute\nExquisite scripts, that quick shit, go with flow\nThat's how we do it though", "Get-U-Now": "[Instrumental]", "Intermission": "This might be a good time to replenish your napkin supply. Let us take a short break. Now relax.\nRelax\nWhat do you want?\n(speaking Klingon)\nI don't speak Klingon\n(speaking Klingon)\nNo. Where is the bathroom?\nDo you know anyone here?\nNo, I don't know anyone here.\nAre you transporting Tribbles?\nNo, I'm not transporting Tribbles.\nI'm a Terreth! Are you a Klingon?\nYes. What do you want?\n(villian!)\n(speaking Klingon)\n(Well, thanks!)\nExcuse me\n(spitting noise)\nWhat is your number, Terreth?\nMy eyes sting. Now I can smell something. Help! Get help quickly!\n(crying)\nTo Terrens, this might seem a tackless way to begin a conversation, but among Klingons, it's considered quite civil.\nStop relaxing!\n(speaking Klingon)", "Act 1": "Tracks performed in act 1:\nHoe Cakes\nKon Queso\nKon Karne\nOne Beer\nBeef Rapp\nVomitspit\nAccordion\nMeat Grinder\nAll Caps\nCurls\nFigaro\nPeople Places & Things", "Constipated Monkey": "[Instrumental]", "Kat-Girl-Real-Time": "Supervillain!\nMmhmm\nVillain, villain!\nVillain!\nVuh...\nVillain! Villain! Villain! Villain! Villain! Villain!\nVillain! Villain! Villain! VILLAIN!\nVillain...\n(chuckles)", "Cinquefoil": "[Instrumental]", "Get.the.Feta": "Villain is willy nilly!\n(Live in stereo)\nWant you to call me at that address, if I'm still there, then I'll make sure you get the crack\nDoom has taken over every continent! Meanwhile, back in space, Doom continues to search for colleagues\nAnd your name?\nKhan is my name. Khan, nothing else. Khan\nAs the funky beat continues, a rock steady\nWe have got to try to find Doom!\nGood luck!\nTime to get the feta!", "Meditation": "[Instrumental]", "Bergamot": "[Instrumental]", "Bark": "[Instrumental]", "Act 2": "Tracks performed in act 2:\nGo With The Flow\nDoomsday\nHey!\nRhymes Like Dimes\nChange The Beat\nThe Fine Print", "Passion Flower": "[Instrumental]"}